NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RESOLVED will publish to */
  #define AAR_PUBLISH_RESOLVED_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define AAR_PUBLISH_RESOLVED_CHIDX_Msk (0xFFUL << AAR_PUBLISH_RESOLVED_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define AAR_PUBLISH_RESOLVED_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define AAR_PUBLISH_RESOLVED_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define AAR_PUBLISH_RESOLVED_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define AAR_PUBLISH_RESOLVED_EN_Msk (0x1UL << AAR_PUBLISH_RESOLVED_EN_Pos) /*!< Bit mask of EN field.                        */
  #define AAR_PUBLISH_RESOLVED_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define AAR_PUBLISH_RESOLVED_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define AAR_PUBLISH_RESOLVED_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define AAR_PUBLISH_RESOLVED_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* AAR_PUBLISH_NOTRESOLVED: Publish configuration for event NOTRESOLVED */
  #define AAR_PUBLISH_NOTRESOLVED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_NOTRESOLVED register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event NOTRESOLVED will publish to */
  #define AAR_PUBLISH_NOTRESOLVED_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define AAR_PUBLISH_NOTRESOLVED_CHIDX_Msk (0xFFUL << AAR_PUBLISH_NOTRESOLVED_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define AAR_PUBLISH_NOTRESOLVED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define AAR_PUBLISH_NOTRESOLVED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define AAR_PUBLISH_NOTRESOLVED_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define AAR_PUBLISH_NOTRESOLVED_EN_Msk (0x1UL << AAR_PUBLISH_NOTRESOLVED_EN_Pos) /*!< Bit mask of EN field.                  */
  #define AAR_PUBLISH_NOTRESOLVED_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define AAR_PUBLISH_NOTRESOLVED_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define AAR_PUBLISH_NOTRESOLVED_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define AAR_PUBLISH_NOTRESOLVED_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* AAR_INTENSET: Enable interrupt */
  #define AAR_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* END @Bit 0 : Write '1' to enable interrupt for event END */
  #define AAR_INTENSET_END_Pos (0UL)                 /*!< Position of END field.                                               */
  #define AAR_INTENSET_END_Msk (0x1UL << AAR_INTENSET_END_Pos) /*!< Bit mask of END field.                                     */
  #define AAR_INTENSET_END_Min (0x0UL)               /*!< Min enumerator value of END field.                                   */
  #define AAR_INTENSET_END_Max (0x1UL)               /*!< Max enumerator value of END field.                                   */
  #define AAR_INTENSET_END_Set (0x1UL)               /*!< Enable                                                               */
  #define AAR_INTENSET_END_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define AAR_INTENSET_END_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* RESOLVED @Bit 1 : Write '1' to enable interrupt for event RESOLVED */
  #define AAR_INTENSET_RESOLVED_Pos (1UL)            /*!< Position of RESOLVED field.                                          */
  #define AAR_INTENSET_RESOLVED_Msk (0x1UL << AAR_INTENSET_RESOLVED_Pos) /*!< Bit mask of RESOLVED field.                      */
  #define AAR_INTENSET_RESOLVED_Min (0x0UL)          /*!< Min enumerator value of RESOLVED field.                              */
  #define AAR_INTENSET_RESOLVED_Max (0x1UL)          /*!< Max enumerator value of RESOLVED field.                              */
  #define AAR_INTENSET_RESOLVED_Set (0x1UL)          /*!< Enable                                                               */
  #define AAR_INTENSET_RESOLVED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define AAR_INTENSET_RESOLVED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* NOTRESOLVED @Bit 2 : Write '1' to enable interrupt for event NOTRESOLVED */
  #define AAR_INTENSET_NOTRESOLVED_Pos (2UL)         /*!< Position of NOTRESOLVED field.                                       */
  #define AAR_INTENSET_NOTRESOLVED_Msk (0x1UL << AAR_INTENSET_NOTRESOLVED_Pos) /*!< Bit mask of NOTRESOLVED field.             */
  #define AAR_INTENSET_NOTRESOLVED_Min (0x0UL)       /*!< Min enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENSET_NOTRESOLVED_Max (0x1UL)       /*!< Max enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENSET_NOTRESOLVED_Set (0x1UL)       /*!< Enable                                                               */
  #define AAR_INTENSET_NOTRESOLVED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define AAR_INTENSET_NOTRESOLVED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


