NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PRIPORT3 @Bits 9..11 : Priority value of port number 3. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Pos (9UL) /*!< Position of PRIPORT3 field.                                        */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Pos) /*!< Bit mask of PRIPORT3
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Min (0x0UL) /*!< Min value of PRIPORT3 field.                                     */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Max (0x7UL) /*!< Max size of PRIPORT3 field.                                      */

/* PRIPORT4 @Bits 12..14 : Priority value of port number 4. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Pos (12UL) /*!< Position of PRIPORT4 field.                                       */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Pos) /*!< Bit mask of PRIPORT4
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Min (0x0UL) /*!< Min value of PRIPORT4 field.                                     */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Max (0x7UL) /*!< Max size of PRIPORT4 field.                                      */

/* PRIPORT5 @Bits 15..17 : Priority value of port number 5. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Pos (15UL) /*!< Position of PRIPORT5 field.                                       */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Pos) /*!< Bit mask of PRIPORT5
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Min (0x0UL) /*!< Min value of PRIPORT5 field.                                     */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Max (0x7UL) /*!< Max size of PRIPORT5 field.                                      */

/* PRIPORT6 @Bits 18..20 : Priority value of port number 6. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Pos (18UL) /*!< Position of PRIPORT6 field.                                       */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Pos) /*!< Bit mask of PRIPORT6
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Min (0x0UL) /*!< Min value of PRIPORT6 field.                                     */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Max (0x7UL) /*!< Max size of PRIPORT6 field.                                      */

/* PRIPORT7 @Bits 21..23 : Priority value of port number 7. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Pos (21UL) /*!< Position of PRIPORT7 field.                                       */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Pos) /*!< Bit mask of PRIPORT7
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Min (0x0UL) /*!< Min value of PRIPORT7 field.                                     */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Max (0x7UL) /*!< Max size of PRIPORT7 field.                                      */


/* ATBFUNNEL_ITATBDATA0: The ITATBDATA0 register performs different functions depending on whether the access is a read or a
                          write. */

  #define ATBFUNNEL_ITATBDATA0_ResetValue (0x00000000UL) /*!< Reset value of ITATBDATA0 register.                              */

/* ATDATA0 @Bit 0 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Pos (0UL)     /*!< Position of ATDATA0 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA0_Pos) /*!< Bit mask of ATDATA0 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Min (0x0UL)   /*!< Min enumerator value of ATDATA0 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Max (0x1UL)   /*!< Max enumerator value of ATDATA0 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA1 @Bit 1 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Pos (1UL)     /*!< Position of ATDATA1 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA1_Pos) /*!< Bit mask of ATDATA1 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Min (0x0UL)   /*!< Min enumerator value of ATDATA1 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Max (0x1UL)   /*!< Max enumerator value of ATDATA1 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA2 @Bit 2 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Pos (2UL)     /*!< Position of ATDATA2 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA2_Pos) /*!< Bit mask of ATDATA2 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Min (0x0UL)   /*!< Min enumerator value of ATDATA2 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Max (0x1UL)   /*!< Max enumerator value of ATDATA2 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_High (0x1UL)  /*!< Pin is logic 1.                                                      */

/* ATDATA3 @Bit 3 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Pos (3UL)     /*!< Position of ATDATA3 field.                                           */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA3_Pos) /*!< Bit mask of ATDATA3 field.         */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Min (0x0UL)   /*!< Min enumerator value of ATDATA3 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Max (0x1UL)   /*!< Max enumerator value of ATDATA3 field.                               */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Low (0x0UL)   /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_High (0x1UL)  /*!< Pin is logic 1.                                                      */

