NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ATDATA11 @Bit 11 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Pos (11UL)   /*!< Position of ATDATA11 field.                                          */
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA11_Pos) /*!< Bit mask of ATDATA11 field.      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Min (0x0UL)  /*!< Min enumerator value of ATDATA11 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Max (0x1UL)  /*!< Max enumerator value of ATDATA11 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Low (0x0UL)  /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_High (0x1UL) /*!< Pin is logic 1.                                                      */

/* ATDATA12 @Bit 12 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Pos (12UL)   /*!< Position of ATDATA12 field.                                          */
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA12_Pos) /*!< Bit mask of ATDATA12 field.      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Min (0x0UL)  /*!< Min enumerator value of ATDATA12 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Max (0x1UL)  /*!< Max enumerator value of ATDATA12 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Low (0x0UL)  /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_High (0x1UL) /*!< Pin is logic 1.                                                      */

/* ATDATA13 @Bit 13 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Pos (13UL)   /*!< Position of ATDATA13 field.                                          */
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA13_Pos) /*!< Bit mask of ATDATA13 field.      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Min (0x0UL)  /*!< Min enumerator value of ATDATA13 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Max (0x1UL)  /*!< Max enumerator value of ATDATA13 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Low (0x0UL)  /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_High (0x1UL) /*!< Pin is logic 1.                                                      */

/* ATDATA14 @Bit 14 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Pos (14UL)   /*!< Position of ATDATA14 field.                                          */
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA14_Pos) /*!< Bit mask of ATDATA14 field.      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Min (0x0UL)  /*!< Min enumerator value of ATDATA14 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Max (0x1UL)  /*!< Max enumerator value of ATDATA14 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Low (0x0UL)  /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_High (0x1UL) /*!< Pin is logic 1.                                                      */

/* ATDATA15 @Bit 15 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Pos (15UL)   /*!< Position of ATDATA15 field.                                          */
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA15_Pos) /*!< Bit mask of ATDATA15 field.      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Min (0x0UL)  /*!< Min enumerator value of ATDATA15 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Max (0x1UL)  /*!< Max enumerator value of ATDATA15 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Low (0x0UL)  /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_High (0x1UL) /*!< Pin is logic 1.                                                      */

/* ATDATA16 @Bit 16 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Pos (16UL)   /*!< Position of ATDATA16 field.                                          */
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA16_Pos) /*!< Bit mask of ATDATA16 field.      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Min (0x0UL)  /*!< Min enumerator value of ATDATA16 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Max (0x1UL)  /*!< Max enumerator value of ATDATA16 field.                              */
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Low (0x0UL)  /*!< Pin is logic 0.                                                      */
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_High (0x1UL) /*!< Pin is logic 1.                                                      */


/* ATBFUNNEL_ITATBCTR2: The ITATBCTR2 register performs different functions depending on whether the access is a read or a
                         write. */

  #define ATBFUNNEL_ITATBCTR2_ResetValue (0x00000000UL) /*!< Reset value of ITATBCTR2 register.                                */

