NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* BIT1 @Bit 1 : Read or clear claim bit 1. */
  #define ATBFUNNEL_CLAIMCLR_BIT1_Pos (1UL)          /*!< Position of BIT1 field.                                              */
  #define ATBFUNNEL_CLAIMCLR_BIT1_Msk (0x1UL << ATBFUNNEL_CLAIMCLR_BIT1_Pos) /*!< Bit mask of BIT1 field.                      */
  #define ATBFUNNEL_CLAIMCLR_BIT1_Min (0x0UL)        /*!< Min enumerator value of BIT1 field.                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT1_Max (0x1UL)        /*!< Max enumerator value of BIT1 field.                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT1_Cleared (0x0UL)    /*!< Claim bit 1 is not set.                                              */
  #define ATBFUNNEL_CLAIMCLR_BIT1_Set (0x1UL)        /*!< Claim bit 1 is set.                                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT1_Clear (0x1UL)      /*!< Clear claim bit 1.                                                   */

/* BIT2 @Bit 2 : Read or clear claim bit 2. */
  #define ATBFUNNEL_CLAIMCLR_BIT2_Pos (2UL)          /*!< Position of BIT2 field.                                              */
  #define ATBFUNNEL_CLAIMCLR_BIT2_Msk (0x1UL << ATBFUNNEL_CLAIMCLR_BIT2_Pos) /*!< Bit mask of BIT2 field.                      */
  #define ATBFUNNEL_CLAIMCLR_BIT2_Min (0x0UL)        /*!< Min enumerator value of BIT2 field.                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT2_Max (0x1UL)        /*!< Max enumerator value of BIT2 field.                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT2_Cleared (0x0UL)    /*!< Claim bit 2 is not set.                                              */
  #define ATBFUNNEL_CLAIMCLR_BIT2_Set (0x1UL)        /*!< Claim bit 2 is set.                                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT2_Clear (0x1UL)      /*!< Clear claim bit 2.                                                   */

/* BIT3 @Bit 3 : Read or clear claim bit 3. */
  #define ATBFUNNEL_CLAIMCLR_BIT3_Pos (3UL)          /*!< Position of BIT3 field.                                              */
  #define ATBFUNNEL_CLAIMCLR_BIT3_Msk (0x1UL << ATBFUNNEL_CLAIMCLR_BIT3_Pos) /*!< Bit mask of BIT3 field.                      */
  #define ATBFUNNEL_CLAIMCLR_BIT3_Min (0x0UL)        /*!< Min enumerator value of BIT3 field.                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT3_Max (0x1UL)        /*!< Max enumerator value of BIT3 field.                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT3_Cleared (0x0UL)    /*!< Claim bit 3 is not set.                                              */
  #define ATBFUNNEL_CLAIMCLR_BIT3_Set (0x1UL)        /*!< Claim bit 3 is set.                                                  */
  #define ATBFUNNEL_CLAIMCLR_BIT3_Clear (0x1UL)      /*!< Clear claim bit 3.                                                   */


/* ATBFUNNEL_LAR: This is used to enable write access to device registers. */
  #define ATBFUNNEL_LAR_ResetValue (0x00000000UL)    /*!< Reset value of LAR register.                                         */

/* ACCESS @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.
                        */

  #define ATBFUNNEL_LAR_ACCESS_Pos (0UL)             /*!< Position of ACCESS field.                                            */
  #define ATBFUNNEL_LAR_ACCESS_Msk (0xFFFFFFFFUL << ATBFUNNEL_LAR_ACCESS_Pos) /*!< Bit mask of ACCESS field.                   */
  #define ATBFUNNEL_LAR_ACCESS_Min (0xC5ACCE55UL)    /*!< Min enumerator value of ACCESS field.                                */
  #define ATBFUNNEL_LAR_ACCESS_Max (0xC5ACCE55UL)    /*!< Max enumerator value of ACCESS field.                                */
  #define ATBFUNNEL_LAR_ACCESS_UnLock (0xC5ACCE55UL) /*!< Unlock register interface.                                           */


/* ATBFUNNEL_LSR: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under
                   debug. Accesses to the extended stimulus port registers are not affected by the lock mechanism. This register
                   must always be present although there might not be any lock access control mechanism. The lock mechanism,
                   where present and locked, must block write accesses to any control register, except the Lock Access Register.
                   For most components this covers all registers except for the Lock Access Register. */

  #define ATBFUNNEL_LSR_ResetValue (0x00000000UL)    /*!< Reset value of LSR register.                                         */

/* PRESENT @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define ATBFUNNEL_LSR_PRESENT_Pos (0UL)            /*!< Position of PRESENT field.                                           */
  #define ATBFUNNEL_LSR_PRESENT_Msk (0x1UL << ATBFUNNEL_LSR_PRESENT_Pos) /*!< Bit mask of PRESENT field.                       */
  #define ATBFUNNEL_LSR_PRESENT_Min (0x0UL)          /*!< Min enumerator value of PRESENT field.                               */
  #define ATBFUNNEL_LSR_PRESENT_Max (0x1UL)          /*!< Max enumerator value of PRESENT field.                               */
  #define ATBFUNNEL_LSR_PRESENT_NotImplemented (0x0UL) /*!< No lock control mechanism exists, writes to the Lock Access Register
                                                            are ignored.*/
  #define ATBFUNNEL_LSR_PRESENT_Implemented (0x1UL)  /*!< Lock control mechanism is present.                                   */

/* LOCKED @Bit 1 : Returns the current status of the Lock. */
  #define ATBFUNNEL_LSR_LOCKED_Pos (1UL)             /*!< Position of LOCKED field.                                            */
  #define ATBFUNNEL_LSR_LOCKED_Msk (0x1UL << ATBFUNNEL_LSR_LOCKED_Pos) /*!< Bit mask of LOCKED field.                          */
  #define ATBFUNNEL_LSR_LOCKED_Min (0x0UL)           /*!< Min enumerator value of LOCKED field.                                */
  #define ATBFUNNEL_LSR_LOCKED_Max (0x1UL)           /*!< Max enumerator value of LOCKED field.                                */
  #define ATBFUNNEL_LSR_LOCKED_UnLocked (0x0UL)      /*!< Write access is allowed to this device.                              */
  #define ATBFUNNEL_LSR_LOCKED_Locked (0x1UL)        /*!< Write access to the component is blocked. All writes to control
                                                          registers are ignored. Reads are permitted.*/

/* TYPE @Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
  #define ATBFUNNEL_LSR_TYPE_Pos (2UL)               /*!< Position of TYPE field.                                              */
  #define ATBFUNNEL_LSR_TYPE_Msk (0x1UL << ATBFUNNEL_LSR_TYPE_Pos) /*!< Bit mask of TYPE field.                                */
  #define ATBFUNNEL_LSR_TYPE_Min (0x0UL)             /*!< Min enumerator value of TYPE field.                                  */
  #define ATBFUNNEL_LSR_TYPE_Max (0x1UL)             /*!< Max enumerator value of TYPE field.                                  */
  #define ATBFUNNEL_LSR_TYPE_Bits32 (0x0UL)          /*!< This component implements a 32-bit Lock Access Register.             */
  #define ATBFUNNEL_LSR_TYPE_Bits8 (0x1UL)           /*!< This component implements an 8-bit Lock Access Register.             */


/* ATBFUNNEL_AUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define ATBFUNNEL_AUTHSTATUS_ResetValue (0x00000000UL) /*!< Reset value of AUTHSTATUS register.                              */

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define ATBFUNNEL_AUTHSTATUS_NSID_Pos (0UL)        /*!< Position of NSID field.                                              */
  #define ATBFUNNEL_AUTHSTATUS_NSID_Msk (0x3UL << ATBFUNNEL_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                  */
  #define ATBFUNNEL_AUTHSTATUS_NSID_Min (0x0UL)      /*!< Min enumerator value of NSID field.                                  */
  #define ATBFUNNEL_AUTHSTATUS_NSID_Max (0x1UL)      /*!< Max enumerator value of NSID field.                                  */
  #define ATBFUNNEL_AUTHSTATUS_NSID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                */
  #define ATBFUNNEL_AUTHSTATUS_NSID_Implemented (0x1UL) /*!< The feature is implemented.                                       */

