NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define ATBFUNNEL_AUTHSTATUS_NSNID_Pos (2UL)       /*!< Position of NSNID field.                                             */
  #define ATBFUNNEL_AUTHSTATUS_NSNID_Msk (0x3UL << ATBFUNNEL_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.               */
  #define ATBFUNNEL_AUTHSTATUS_NSNID_Min (0x0UL)     /*!< Min enumerator value of NSNID field.                                 */
  #define ATBFUNNEL_AUTHSTATUS_NSNID_Max (0x1UL)     /*!< Max enumerator value of NSNID field.                                 */
  #define ATBFUNNEL_AUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                               */
  #define ATBFUNNEL_AUTHSTATUS_NSNID_Implemented (0x1UL) /*!< The feature is implemented.                                      */

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define ATBFUNNEL_AUTHSTATUS_SID_Pos (4UL)         /*!< Position of SID field.                                               */
  #define ATBFUNNEL_AUTHSTATUS_SID_Msk (0x3UL << ATBFUNNEL_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                     */
  #define ATBFUNNEL_AUTHSTATUS_SID_Min (0x0UL)       /*!< Min enumerator value of SID field.                                   */
  #define ATBFUNNEL_AUTHSTATUS_SID_Max (0x1UL)       /*!< Max enumerator value of SID field.                                   */
  #define ATBFUNNEL_AUTHSTATUS_SID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                 */
  #define ATBFUNNEL_AUTHSTATUS_SID_Implemented (0x1UL) /*!< The feature is implemented.                                        */

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define ATBFUNNEL_AUTHSTATUS_SNID_Pos (6UL)        /*!< Position of SNID field.                                              */
  #define ATBFUNNEL_AUTHSTATUS_SNID_Msk (0x3UL << ATBFUNNEL_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                  */
  #define ATBFUNNEL_AUTHSTATUS_SNID_Min (0x0UL)      /*!< Min enumerator value of SNID field.                                  */
  #define ATBFUNNEL_AUTHSTATUS_SNID_Max (0x1UL)      /*!< Max enumerator value of SNID field.                                  */
  #define ATBFUNNEL_AUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                */
  #define ATBFUNNEL_AUTHSTATUS_SNID_Implemented (0x1UL) /*!< The feature is implemented.                                       */


/* ATBFUNNEL_DEVID: Indicates the capabilities of the component. */
  #define ATBFUNNEL_DEVID_ResetValue (0x00000000UL)  /*!< Reset value of DEVID register.                                       */

/* PORTCOUNT @Bits 0..3 : Indicates the number of input ports connected. 0x0 and 0x1 are illegal values. */
  #define ATBFUNNEL_DEVID_PORTCOUNT_Pos (0UL)        /*!< Position of PORTCOUNT field.                                         */
  #define ATBFUNNEL_DEVID_PORTCOUNT_Msk (0xFUL << ATBFUNNEL_DEVID_PORTCOUNT_Pos) /*!< Bit mask of PORTCOUNT field.             */
  #define ATBFUNNEL_DEVID_PORTCOUNT_Min (0x2UL)      /*!< Min value of PORTCOUNT field.                                        */
  #define ATBFUNNEL_DEVID_PORTCOUNT_Max (0x8UL)      /*!< Max size of PORTCOUNT field.                                         */


/* ATBFUNNEL_DEVTYPE: The DEVTYPE register provides a debugger with information about the component when the Part Number field
                       is not recognized. The debugger can then report this information. */

  #define ATBFUNNEL_DEVTYPE_ResetValue (0x00000000UL) /*!< Reset value of DEVTYPE register.                                    */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define ATBFUNNEL_DEVTYPE_MAJOR_Pos (0UL)          /*!< Position of MAJOR field.                                             */
  #define ATBFUNNEL_DEVTYPE_MAJOR_Msk (0xFUL << ATBFUNNEL_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                     */
  #define ATBFUNNEL_DEVTYPE_MAJOR_Min (0x2UL)        /*!< Min enumerator value of MAJOR field.                                 */
  #define ATBFUNNEL_DEVTYPE_MAJOR_Max (0x2UL)        /*!< Max enumerator value of MAJOR field.                                 */
  #define ATBFUNNEL_DEVTYPE_MAJOR_InputOutputDevice (0x2UL) /*!< Indicates that this component has ATB inputs and outputs.     */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define ATBFUNNEL_DEVTYPE_SUB_Pos (4UL)            /*!< Position of SUB field.                                               */
  #define ATBFUNNEL_DEVTYPE_SUB_Msk (0xFUL << ATBFUNNEL_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                           */
  #define ATBFUNNEL_DEVTYPE_SUB_Min (0x1UL)          /*!< Min enumerator value of SUB field.                                   */
  #define ATBFUNNEL_DEVTYPE_SUB_Max (0x1UL)          /*!< Max enumerator value of SUB field.                                   */
  #define ATBFUNNEL_DEVTYPE_SUB_Replicator (0x1UL)   /*!< This component arbitrates ATB inputs mapping to ATB outputs.         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       ATBREPLICATOR                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct ATBREPLICATOR =================================================== */
/**
  * @brief ATB Replicator module
  */
  typedef struct {                                   /*!< ATBREPLICATOR Structure                                              */
    __IOM uint32_t IDFILTER0;                        /*!< (@ 0x00000000) The IDFILTER0 register enables the programming of ID
                                                                         filtering for master port 0.*/
    __IOM uint32_t IDFILTER1;                        /*!< (@ 0x00000004) The IDFILTER1 register enables the programming of ID
                                                                         filtering for master port 1.*/
    __IM uint32_t RESERVED[956];
    __IOM uint32_t ITATBCTR1;                        /*!< (@ 0x00000EF8) The ITATBCTR1 register returns the value of the
                                                                         atreadym0, atreadym1, and atvalids inputs in
                                                                         integration mode.*/
    __IOM uint32_t ITATBCTR0;                        /*!< (@ 0x00000EFC) The ITATBCTR0 register controls the value of the
                                                                         atvalidm0, atvalidm1, and atreadys outputs in
                                                                         integration mode.*/
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) The ITCTRL register enables the component to switch
                                                                         from a functional mode, which is the default behavior,
                                                                         to integration mode where the inputs and outputs of the
                                                                         component can be directly controlled for the purposes
                                                                         of integration testing and topology detection.*/
    __IM uint32_t RESERVED1[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMSET register sets
                                                                         bits in the claim tag, and determines the number of
                                                                         claim bits implemented.*/
    __IOM uint32_t CLAIMCLR;                         /*!< (@ 0x00000FA4) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMCLR register sets
                                                                         the bits in the claim tag to 0 and determines the
                                                                         current value of the claim tag.*/
    __IM uint32_t RESERVED2[2];
    __IOM uint32_t LAR;                              /*!< (@ 0x00000FB0) This is used to enable write access to device
                                                                         registers.*/
    __IOM uint32_t LSR;                              /*!< (@ 0x00000FB4) This indicates the status of the lock control
                                                                         mechanism. This lock prevents accidental writes by code
                                                                         under debug. Accesses to the extended stimulus port
                                                                         registers are not affected by the lock mechanism. This
                                                                         register must always be present although there might
                                                                         not be any lock access control mechanism. The lock
                                                                         mechanism, where present and locked, must block write
                                                                         accesses to any control register, except the Lock
                                                                         Access Register. For most components this covers all
                                                                         registers except for the Lock Access Register.*/
    __IOM uint32_t AUTHSTATUS;                       /*!< (@ 0x00000FB8) Indicates the current level of tracing permitted by the
                                                                         system*/
    __IM uint32_t RESERVED3[3];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Indicates the capabilities of the component.          */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) The DEVTYPE register provides a debugger with
                                                                         information about the component when the Part Number
                                                                         field is not recognized. The debugger can then report
                                                                         this information.*/
    __IOM uint32_t PIDR4;                            /*!< (@ 0x00000FD0) Coresight peripheral identification registers.        */
    __IM uint32_t RESERVED4[3];
    __IOM uint32_t PIDR0;                            /*!< (@ 0x00000FE0) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR1;                            /*!< (@ 0x00000FE4) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR2;                            /*!< (@ 0x00000FE8) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR3;                            /*!< (@ 0x00000FEC) Coresight peripheral identification registers.        */
    __IOM uint32_t CIDR0;                            /*!< (@ 0x00000FF0) Coresight component identification registers.         */
    __IOM uint32_t CIDR1;                            /*!< (@ 0x00000FF4) Coresight component identification registers.         */
    __IOM uint32_t CIDR2;                            /*!< (@ 0x00000FF8) Coresight component identification registers.         */
    __IOM uint32_t CIDR3;                            /*!< (@ 0x00000FFC) Coresight component identification registers.         */
  } NRF_ATBREPLICATOR_Type;                          /*!< Size = 4096 (0x1000)                                                 */

/* ATBREPLICATOR_IDFILTER0: The IDFILTER0 register enables the programming of ID filtering for master port 0. */
  #define ATBREPLICATOR_IDFILTER0_ResetValue (0x00000000UL) /*!< Reset value of IDFILTER0 register.                            */

/* ID0_00_0F @Bit 0 : Enable or disable ID filtering for IDs 0x00_0x0F. */
  #define ATBREPLICATOR_IDFILTER0_ID0_00_0F_Pos (0UL) /*!< Position of ID0_00_0F field.                                        */
  #define ATBREPLICATOR_IDFILTER0_ID0_00_0F_Msk (0x1UL << ATBREPLICATOR_IDFILTER0_ID0_00_0F_Pos) /*!< Bit mask of ID0_00_0F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_00_0F_Min (0x0UL) /*!< Min enumerator value of ID0_00_0F field.                          */
  #define ATBREPLICATOR_IDFILTER0_ID0_00_0F_Max (0x1UL) /*!< Max enumerator value of ID0_00_0F field.                          */
  #define ATBREPLICATOR_IDFILTER0_ID0_00_0F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 0.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_00_0F_Selected (0x1UL) /*!< Transactions with these IDs are discarded by the replicator. */

/* ID0_10_1F @Bit 1 : Enable or disable ID filtering for IDs 0x10_0x1F. */
  #define ATBREPLICATOR_IDFILTER0_ID0_10_1F_Pos (1UL) /*!< Position of ID0_10_1F field.                                        */
  #define ATBREPLICATOR_IDFILTER0_ID0_10_1F_Msk (0x1UL << ATBREPLICATOR_IDFILTER0_ID0_10_1F_Pos) /*!< Bit mask of ID0_10_1F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_10_1F_Min (0x0UL) /*!< Min enumerator value of ID0_10_1F field.                          */
  #define ATBREPLICATOR_IDFILTER0_ID0_10_1F_Max (0x1UL) /*!< Max enumerator value of ID0_10_1F field.                          */
  #define ATBREPLICATOR_IDFILTER0_ID0_10_1F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 0.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_10_1F_Selected (0x1UL) /*!< Transactions with these IDs are discarded by the replicator. */

/* ID0_20_2F @Bit 2 : Enable or disable ID filtering for IDs 0x20_0x2F. */
  #define ATBREPLICATOR_IDFILTER0_ID0_20_2F_Pos (2UL) /*!< Position of ID0_20_2F field.                                        */
  #define ATBREPLICATOR_IDFILTER0_ID0_20_2F_Msk (0x1UL << ATBREPLICATOR_IDFILTER0_ID0_20_2F_Pos) /*!< Bit mask of ID0_20_2F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_20_2F_Min (0x0UL) /*!< Min enumerator value of ID0_20_2F field.                          */
  #define ATBREPLICATOR_IDFILTER0_ID0_20_2F_Max (0x1UL) /*!< Max enumerator value of ID0_20_2F field.                          */
  #define ATBREPLICATOR_IDFILTER0_ID0_20_2F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 0.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_20_2F_Selected (0x1UL) /*!< Transactions with these IDs are discarded by the replicator. */

