NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ID1_30_3F @Bit 3 : Enable or disable ID filtering for IDs 0x30_0x3F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Pos (3UL) /*!< Position of ID1_30_3F field.                                        */
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_30_3F_Pos) /*!< Bit mask of ID1_30_3F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Min (0x0UL) /*!< Min enumerator value of ID1_30_3F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Max (0x1UL) /*!< Max enumerator value of ID1_30_3F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Selected (0x1UL) /*!< Transactions with these IDs are discarded by the replicator. */

/* ID1_40_4F @Bit 4 : Enable or disable ID filtering for IDs 0x40_0x4F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Pos (4UL) /*!< Position of ID1_40_4F field.                                        */
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_40_4F_Pos) /*!< Bit mask of ID1_40_4F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Min (0x0UL) /*!< Min enumerator value of ID1_40_4F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Max (0x1UL) /*!< Max enumerator value of ID1_40_4F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Selected (0x1UL) /*!< Transactions with these IDs are discarded by the replicator. */

/* ID1_50_5F @Bit 5 : Enable or disable ID filtering for IDs 0x50_0x5F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Pos (5UL) /*!< Position of ID1_50_5F field.                                        */
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_50_5F_Pos) /*!< Bit mask of ID1_50_5F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Min (0x0UL) /*!< Min enumerator value of ID1_50_5F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Max (0x1UL) /*!< Max enumerator value of ID1_50_5F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Selected (0x1UL) /*!< Transactions with these IDs are discarded by the replicator. */

/* ID1_60_6F @Bit 6 : Enable or disable ID filtering for IDs 0x60_0x6F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Pos (6UL) /*!< Position of ID1_60_6F field.                                        */
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_60_6F_Pos) /*!< Bit mask of ID1_60_6F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Min (0x0UL) /*!< Min enumerator value of ID1_60_6F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Max (0x1UL) /*!< Max enumerator value of ID1_60_6F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Selected (0x1UL) /*!< Transactions with these IDs are discarded by the replicator. */

/* ID1_70_7F @Bit 7 : Enable or disable ID filtering for IDs 0x70_0x7F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Pos (7UL) /*!< Position of ID1_70_7F field.                                        */
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_70_7F_Pos) /*!< Bit mask of ID1_70_7F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Min (0x0UL) /*!< Min enumerator value of ID1_70_7F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Max (0x1UL) /*!< Max enumerator value of ID1_70_7F field.                          */
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Selected (0x1UL) /*!< Transactions with these IDs are discarded by the replicator. */


/* ATBREPLICATOR_ITATBCTR1: The ITATBCTR1 register returns the value of the atreadym0, atreadym1, and atvalids inputs in
                             integration mode. */

  #define ATBREPLICATOR_ITATBCTR1_ResetValue (0x00000000UL) /*!< Reset value of ITATBCTR1 register.                            */

/* ATREADYM0 @Bit 0 : Reads the value of the atreadym0 input. */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Pos (0UL) /*!< Position of ATREADYM0 field.                                        */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Msk (0x1UL << ATBREPLICATOR_ITATBCTR1_ATREADYM0_Pos) /*!< Bit mask of ATREADYM0
                                                                            field.*/
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Min (0x0UL) /*!< Min enumerator value of ATREADYM0 field.                          */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Max (0x1UL) /*!< Max enumerator value of ATREADYM0 field.                          */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Low (0x0UL) /*!< Pin is logic 0.                                                   */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_High (0x1UL) /*!< Pin is logic 1.                                                  */

/* ATREADYM1 @Bit 1 : Reads the value of the atreadym1 input. */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Pos (1UL) /*!< Position of ATREADYM1 field.                                        */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Msk (0x1UL << ATBREPLICATOR_ITATBCTR1_ATREADYM1_Pos) /*!< Bit mask of ATREADYM1
                                                                            field.*/
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Min (0x0UL) /*!< Min enumerator value of ATREADYM1 field.                          */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Max (0x1UL) /*!< Max enumerator value of ATREADYM1 field.                          */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Low (0x0UL) /*!< Pin is logic 0.                                                   */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_High (0x1UL) /*!< Pin is logic 1.                                                  */

/* ATVALIDS @Bit 3 : Reads the value of the atvalids input. */
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Pos (3UL) /*!< Position of ATVALIDS field.                                          */
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Msk (0x1UL << ATBREPLICATOR_ITATBCTR1_ATVALIDS_Pos) /*!< Bit mask of ATVALIDS field.*/
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Min (0x0UL) /*!< Min enumerator value of ATVALIDS field.                            */
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Max (0x1UL) /*!< Max enumerator value of ATVALIDS field.                            */
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Low (0x0UL) /*!< Pin is logic 0.                                                    */
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_High (0x1UL) /*!< Pin is logic 1.                                                   */


/* ATBREPLICATOR_ITATBCTR0: The ITATBCTR0 register controls the value of the atvalidm0, atvalidm1, and atreadys outputs in
                             integration mode. */

