NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
  #define ATBREPLICATOR_ITATBCTR0_ResetValue (0x00000000UL) /*!< Reset value of ITATBCTR0 register.                            */

/* ATVALIDM0 @Bit 0 : Sets the value of the atvalidm0 output. */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Pos (0UL) /*!< Position of ATVALIDM0 field.                                        */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Msk (0x1UL << ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Pos) /*!< Bit mask of ATVALIDM0
                                                                            field.*/
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Min (0x0UL) /*!< Min enumerator value of ATVALIDM0 field.                          */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Max (0x1UL) /*!< Max enumerator value of ATVALIDM0 field.                          */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Low (0x0UL) /*!< Pin is logic 0.                                                   */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_High (0x1UL) /*!< Pin is logic 1.                                                  */

/* ATVALIDM1 @Bit 2 : Sets the value of the atvalidm1 output. */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Pos (2UL) /*!< Position of ATVALIDM1 field.                                        */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Msk (0x1UL << ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Pos) /*!< Bit mask of ATVALIDM1
                                                                            field.*/
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Min (0x0UL) /*!< Min enumerator value of ATVALIDM1 field.                          */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Max (0x1UL) /*!< Max enumerator value of ATVALIDM1 field.                          */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Low (0x0UL) /*!< Pin is logic 0.                                                   */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_High (0x1UL) /*!< Pin is logic 1.                                                  */

/* ATREADYS @Bit 3 : Sets the value of the atreadys output. */
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Pos (3UL) /*!< Position of ATREADYS field.                                          */
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Msk (0x1UL << ATBREPLICATOR_ITATBCTR0_ATREADYS_Pos) /*!< Bit mask of ATREADYS field.*/
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Min (0x0UL) /*!< Min enumerator value of ATREADYS field.                            */
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Max (0x1UL) /*!< Max enumerator value of ATREADYS field.                            */
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Low (0x0UL) /*!< Pin is logic 0.                                                    */
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_High (0x1UL) /*!< Pin is logic 1.                                                   */


/* ATBREPLICATOR_ITCTRL: The ITCTRL register enables the component to switch from a functional mode, which is the default
                          behavior, to integration mode where the inputs and outputs of the component can be directly controlled
                          for the purposes of integration testing and topology detection. */

  #define ATBREPLICATOR_ITCTRL_ResetValue (0x00000000UL) /*!< Reset value of ITCTRL register.                                  */

/* IME @Bit 0 : Integration Mode Enable. */
  #define ATBREPLICATOR_ITCTRL_IME_Pos (0UL)         /*!< Position of IME field.                                               */
  #define ATBREPLICATOR_ITCTRL_IME_Msk (0x1UL << ATBREPLICATOR_ITCTRL_IME_Pos) /*!< Bit mask of IME field.                     */
  #define ATBREPLICATOR_ITCTRL_IME_Min (0x0UL)       /*!< Min enumerator value of IME field.                                   */
  #define ATBREPLICATOR_ITCTRL_IME_Max (0x1UL)       /*!< Max enumerator value of IME field.                                   */
  #define ATBREPLICATOR_ITCTRL_IME_Disabled (0x0UL)  /*!< Integration mode disabled.                                           */
  #define ATBREPLICATOR_ITCTRL_IME_Enabled (0x1UL)   /*!< Integration mode enabled.                                            */


/* ATBREPLICATOR_CLAIMSET: Software can use the claim tag to coordinate application and debugger access to trace unit
                            functionality. The claim tags have no effect on the operation of the component. The CLAIMSET
                            register sets bits in the claim tag, and determines the number of claim bits implemented. */

  #define ATBREPLICATOR_CLAIMSET_ResetValue (0x00000000UL) /*!< Reset value of CLAIMSET register.                              */

/* BIT0 @Bit 0 : Set claim bit 0 and check if bit is implemented or not. */
  #define ATBREPLICATOR_CLAIMSET_BIT0_Pos (0UL)      /*!< Position of BIT0 field.                                              */
  #define ATBREPLICATOR_CLAIMSET_BIT0_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT0_Pos) /*!< Bit mask of BIT0 field.              */
  #define ATBREPLICATOR_CLAIMSET_BIT0_Min (0x0UL)    /*!< Min enumerator value of BIT0 field.                                  */
  #define ATBREPLICATOR_CLAIMSET_BIT0_Max (0x1UL)    /*!< Max enumerator value of BIT0 field.                                  */
  #define ATBREPLICATOR_CLAIMSET_BIT0_NotImplemented (0x0UL) /*!< Claim bit 0 is not implemented.                              */
  #define ATBREPLICATOR_CLAIMSET_BIT0_Implemented (0x1UL) /*!< Claim bit 0 is implemented.                                     */
  #define ATBREPLICATOR_CLAIMSET_BIT0_Set (0x1UL)    /*!< Set claim bit 0.                                                     */

/* BIT1 @Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
  #define ATBREPLICATOR_CLAIMSET_BIT1_Pos (1UL)      /*!< Position of BIT1 field.                                              */
  #define ATBREPLICATOR_CLAIMSET_BIT1_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT1_Pos) /*!< Bit mask of BIT1 field.              */
  #define ATBREPLICATOR_CLAIMSET_BIT1_Min (0x0UL)    /*!< Min enumerator value of BIT1 field.                                  */
  #define ATBREPLICATOR_CLAIMSET_BIT1_Max (0x1UL)    /*!< Max enumerator value of BIT1 field.                                  */
  #define ATBREPLICATOR_CLAIMSET_BIT1_NotImplemented (0x0UL) /*!< Claim bit 1 is not implemented.                              */
  #define ATBREPLICATOR_CLAIMSET_BIT1_Implemented (0x1UL) /*!< Claim bit 1 is implemented.                                     */
  #define ATBREPLICATOR_CLAIMSET_BIT1_Set (0x1UL)    /*!< Set claim bit 1.                                                     */

/* BIT2 @Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
  #define ATBREPLICATOR_CLAIMSET_BIT2_Pos (2UL)      /*!< Position of BIT2 field.                                              */
  #define ATBREPLICATOR_CLAIMSET_BIT2_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT2_Pos) /*!< Bit mask of BIT2 field.              */
  #define ATBREPLICATOR_CLAIMSET_BIT2_Min (0x0UL)    /*!< Min enumerator value of BIT2 field.                                  */
  #define ATBREPLICATOR_CLAIMSET_BIT2_Max (0x1UL)    /*!< Max enumerator value of BIT2 field.                                  */
  #define ATBREPLICATOR_CLAIMSET_BIT2_NotImplemented (0x0UL) /*!< Claim bit 2 is not implemented.                              */
  #define ATBREPLICATOR_CLAIMSET_BIT2_Implemented (0x1UL) /*!< Claim bit 2 is implemented.                                     */
  #define ATBREPLICATOR_CLAIMSET_BIT2_Set (0x1UL)    /*!< Set claim bit 2.                                                     */

