NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TRIGGERED16 @Bit 16 : Read pending status of interrupt for event TRIGGERED[16] */
  #define BELLBOARD_INTPEND2_TRIGGERED16_Pos (16UL)  /*!< Position of TRIGGERED16 field.                                       */
  #define BELLBOARD_INTPEND2_TRIGGERED16_Msk (0x1UL << BELLBOARD_INTPEND2_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16 field. */
  #define BELLBOARD_INTPEND2_TRIGGERED16_Min (0x0UL) /*!< Min enumerator value of TRIGGERED16 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED16_Max (0x1UL) /*!< Max enumerator value of TRIGGERED16 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED16_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND2_TRIGGERED16_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED17 @Bit 17 : Read pending status of interrupt for event TRIGGERED[17] */
  #define BELLBOARD_INTPEND2_TRIGGERED17_Pos (17UL)  /*!< Position of TRIGGERED17 field.                                       */
  #define BELLBOARD_INTPEND2_TRIGGERED17_Msk (0x1UL << BELLBOARD_INTPEND2_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17 field. */
  #define BELLBOARD_INTPEND2_TRIGGERED17_Min (0x0UL) /*!< Min enumerator value of TRIGGERED17 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED17_Max (0x1UL) /*!< Max enumerator value of TRIGGERED17 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED17_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND2_TRIGGERED17_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED18 @Bit 18 : Read pending status of interrupt for event TRIGGERED[18] */
  #define BELLBOARD_INTPEND2_TRIGGERED18_Pos (18UL)  /*!< Position of TRIGGERED18 field.                                       */
  #define BELLBOARD_INTPEND2_TRIGGERED18_Msk (0x1UL << BELLBOARD_INTPEND2_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18 field. */
  #define BELLBOARD_INTPEND2_TRIGGERED18_Min (0x0UL) /*!< Min enumerator value of TRIGGERED18 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED18_Max (0x1UL) /*!< Max enumerator value of TRIGGERED18 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED18_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND2_TRIGGERED18_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED19 @Bit 19 : Read pending status of interrupt for event TRIGGERED[19] */
  #define BELLBOARD_INTPEND2_TRIGGERED19_Pos (19UL)  /*!< Position of TRIGGERED19 field.                                       */
  #define BELLBOARD_INTPEND2_TRIGGERED19_Msk (0x1UL << BELLBOARD_INTPEND2_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field. */
  #define BELLBOARD_INTPEND2_TRIGGERED19_Min (0x0UL) /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED19_Max (0x1UL) /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED19_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND2_TRIGGERED19_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED20 @Bit 20 : Read pending status of interrupt for event TRIGGERED[20] */
  #define BELLBOARD_INTPEND2_TRIGGERED20_Pos (20UL)  /*!< Position of TRIGGERED20 field.                                       */
  #define BELLBOARD_INTPEND2_TRIGGERED20_Msk (0x1UL << BELLBOARD_INTPEND2_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field. */
  #define BELLBOARD_INTPEND2_TRIGGERED20_Min (0x0UL) /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED20_Max (0x1UL) /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED20_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND2_TRIGGERED20_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED21 @Bit 21 : Read pending status of interrupt for event TRIGGERED[21] */
  #define BELLBOARD_INTPEND2_TRIGGERED21_Pos (21UL)  /*!< Position of TRIGGERED21 field.                                       */
  #define BELLBOARD_INTPEND2_TRIGGERED21_Msk (0x1UL << BELLBOARD_INTPEND2_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field. */
  #define BELLBOARD_INTPEND2_TRIGGERED21_Min (0x0UL) /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED21_Max (0x1UL) /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED21_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND2_TRIGGERED21_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED22 @Bit 22 : Read pending status of interrupt for event TRIGGERED[22] */
  #define BELLBOARD_INTPEND2_TRIGGERED22_Pos (22UL)  /*!< Position of TRIGGERED22 field.                                       */
  #define BELLBOARD_INTPEND2_TRIGGERED22_Msk (0x1UL << BELLBOARD_INTPEND2_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field. */
  #define BELLBOARD_INTPEND2_TRIGGERED22_Min (0x0UL) /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED22_Max (0x1UL) /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED22_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND2_TRIGGERED22_Pending (0x1UL) /*!< Read: Pending                                                    */

/* TRIGGERED23 @Bit 23 : Read pending status of interrupt for event TRIGGERED[23] */
  #define BELLBOARD_INTPEND2_TRIGGERED23_Pos (23UL)  /*!< Position of TRIGGERED23 field.                                       */
  #define BELLBOARD_INTPEND2_TRIGGERED23_Msk (0x1UL << BELLBOARD_INTPEND2_TRIGGERED23_Pos) /*!< Bit mask of TRIGGERED23 field. */
  #define BELLBOARD_INTPEND2_TRIGGERED23_Min (0x0UL) /*!< Min enumerator value of TRIGGERED23 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED23_Max (0x1UL) /*!< Max enumerator value of TRIGGERED23 field.                           */
  #define BELLBOARD_INTPEND2_TRIGGERED23_NotPending (0x0UL) /*!< Read: Not pending                                             */
  #define BELLBOARD_INTPEND2_TRIGGERED23_Pending (0x1UL) /*!< Read: Pending                                                    */

