NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TRIGGERED12 @Bit 12 : Write '1' to enable interrupt for event TRIGGERED[12] */
  #define BELLBOARD_INTENSET3_TRIGGERED12_Pos (12UL) /*!< Position of TRIGGERED12 field.                                       */
  #define BELLBOARD_INTENSET3_TRIGGERED12_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED12_Pos) /*!< Bit mask of TRIGGERED12
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED12_Min (0x0UL) /*!< Min enumerator value of TRIGGERED12 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED12_Max (0x1UL) /*!< Max enumerator value of TRIGGERED12 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED12_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET3_TRIGGERED12_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET3_TRIGGERED12_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED13 @Bit 13 : Write '1' to enable interrupt for event TRIGGERED[13] */
  #define BELLBOARD_INTENSET3_TRIGGERED13_Pos (13UL) /*!< Position of TRIGGERED13 field.                                       */
  #define BELLBOARD_INTENSET3_TRIGGERED13_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED13_Pos) /*!< Bit mask of TRIGGERED13
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED13_Min (0x0UL) /*!< Min enumerator value of TRIGGERED13 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED13_Max (0x1UL) /*!< Max enumerator value of TRIGGERED13 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED13_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET3_TRIGGERED13_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET3_TRIGGERED13_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED14 @Bit 14 : Write '1' to enable interrupt for event TRIGGERED[14] */
  #define BELLBOARD_INTENSET3_TRIGGERED14_Pos (14UL) /*!< Position of TRIGGERED14 field.                                       */
  #define BELLBOARD_INTENSET3_TRIGGERED14_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED14_Pos) /*!< Bit mask of TRIGGERED14
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED14_Min (0x0UL) /*!< Min enumerator value of TRIGGERED14 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED14_Max (0x1UL) /*!< Max enumerator value of TRIGGERED14 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED14_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET3_TRIGGERED14_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET3_TRIGGERED14_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED15 @Bit 15 : Write '1' to enable interrupt for event TRIGGERED[15] */
  #define BELLBOARD_INTENSET3_TRIGGERED15_Pos (15UL) /*!< Position of TRIGGERED15 field.                                       */
  #define BELLBOARD_INTENSET3_TRIGGERED15_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED15_Pos) /*!< Bit mask of TRIGGERED15
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED15_Min (0x0UL) /*!< Min enumerator value of TRIGGERED15 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED15_Max (0x1UL) /*!< Max enumerator value of TRIGGERED15 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED15_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET3_TRIGGERED15_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET3_TRIGGERED15_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED16 @Bit 16 : Write '1' to enable interrupt for event TRIGGERED[16] */
  #define BELLBOARD_INTENSET3_TRIGGERED16_Pos (16UL) /*!< Position of TRIGGERED16 field.                                       */
  #define BELLBOARD_INTENSET3_TRIGGERED16_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED16_Min (0x0UL) /*!< Min enumerator value of TRIGGERED16 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED16_Max (0x1UL) /*!< Max enumerator value of TRIGGERED16 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED16_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET3_TRIGGERED16_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET3_TRIGGERED16_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED17 @Bit 17 : Write '1' to enable interrupt for event TRIGGERED[17] */
  #define BELLBOARD_INTENSET3_TRIGGERED17_Pos (17UL) /*!< Position of TRIGGERED17 field.                                       */
  #define BELLBOARD_INTENSET3_TRIGGERED17_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED17_Min (0x0UL) /*!< Min enumerator value of TRIGGERED17 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED17_Max (0x1UL) /*!< Max enumerator value of TRIGGERED17 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED17_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET3_TRIGGERED17_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET3_TRIGGERED17_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* TRIGGERED18 @Bit 18 : Write '1' to enable interrupt for event TRIGGERED[18] */
  #define BELLBOARD_INTENSET3_TRIGGERED18_Pos (18UL) /*!< Position of TRIGGERED18 field.                                       */
  #define BELLBOARD_INTENSET3_TRIGGERED18_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED18_Min (0x0UL) /*!< Min enumerator value of TRIGGERED18 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED18_Max (0x1UL) /*!< Max enumerator value of TRIGGERED18 field.                          */
  #define BELLBOARD_INTENSET3_TRIGGERED18_Set (0x1UL) /*!< Enable                                                              */
  #define BELLBOARD_INTENSET3_TRIGGERED18_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define BELLBOARD_INTENSET3_TRIGGERED18_Enabled (0x1UL) /*!< Read: Enabled                                                   */

