NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* BICR_IOPORT_POWER1: Power configuration for P8 to P15 IO ports. */
  #define BICR_IOPORT_POWER1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of POWER1 register.                                    */

/* P9 @Bits 4..7 : P9 power configuration. */
  #define BICR_IOPORT_POWER1_P9_Pos (4UL)            /*!< Position of P9 field.                                                */
  #define BICR_IOPORT_POWER1_P9_Msk (0xFUL << BICR_IOPORT_POWER1_P9_Pos) /*!< Bit mask of P9 field.                            */
  #define BICR_IOPORT_POWER1_P9_Min (0x0UL)          /*!< Min enumerator value of P9 field.                                    */
  #define BICR_IOPORT_POWER1_P9_Max (0xFUL)          /*!< Max enumerator value of P9 field.                                    */
  #define BICR_IOPORT_POWER1_P9_Unconfigured (0xFUL) /*!< Port supply is unconfigured.                                         */
  #define BICR_IOPORT_POWER1_P9_Disconnected (0x0UL) /*!< Port supply rail is not connected. Port cannot be used.              */
  #define BICR_IOPORT_POWER1_P9_Shorted (0x1UL)      /*!< Port supply is shorted on the PCB to VDD_AO_1V8.                     */
  #define BICR_IOPORT_POWER1_P9_External1V8 (0x2UL)  /*!< Port supply is provided externally at 1.8 V. Use this option if the
                                                          port is supplied through SWEXT.*/
  #define BICR_IOPORT_POWER1_P9_ExternalFull (0x4UL) /*!< Port supply is provided externally with a full range of values, from 3
                                                          V to 1.8 V.*/


/* BICR_IOPORT_DRIVECTRL0: Drive control configuration for P0 to P7 IO ports. */
  #define BICR_IOPORT_DRIVECTRL0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DRIVECTRL0 register.                            */

/* P6 @Bits 24..27 : P6 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL0_P6_Pos (24UL)       /*!< Position of P6 field.                                                */
  #define BICR_IOPORT_DRIVECTRL0_P6_Msk (0xFUL << BICR_IOPORT_DRIVECTRL0_P6_Pos) /*!< Bit mask of P6 field.                    */
  #define BICR_IOPORT_DRIVECTRL0_P6_Min (0x0UL)      /*!< Min enumerator value of P6 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P6_Max (0xFUL)      /*!< Max enumerator value of P6 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P6_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms33 (0x0UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 33 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms40 (0x1UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 40 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms50 (0x2UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 50 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms66 (0x3UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 66 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms100 (0x4UL)  /*!< PORTCNF.DRIVECTRL will be adjusted for 100 Ohms.                     */

/* P7 @Bits 28..31 : P7 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL0_P7_Pos (28UL)       /*!< Position of P7 field.                                                */
  #define BICR_IOPORT_DRIVECTRL0_P7_Msk (0xFUL << BICR_IOPORT_DRIVECTRL0_P7_Pos) /*!< Bit mask of P7 field.                    */
  #define BICR_IOPORT_DRIVECTRL0_P7_Min (0x0UL)      /*!< Min enumerator value of P7 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P7_Max (0xFUL)      /*!< Max enumerator value of P7 field.                                    */
  #define BICR_IOPORT_DRIVECTRL0_P7_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms33 (0x0UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 33 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms40 (0x1UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 40 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms50 (0x2UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 50 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms66 (0x3UL)   /*!< PORTCNF.DRIVECTRL will be adjusted for 66 Ohms.                      */
  #define BICR_IOPORT_DRIVECTRL0_P7_Ohms100 (0x4UL)  /*!< PORTCNF.DRIVECTRL will be adjusted for 100 Ohms.                     */



/* ==================================================== Struct BICR_LFOSC ==================================================== */
/**
  * @brief LFOSC [BICR_LFOSC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LFXOCONFIG;                        /*!< (@ 0x00000000) LFXO configuration.                                   */
  __IOM uint32_t  LFXOCAL;                           /*!< (@ 0x00000004) LFXO calibration requested. Must be written to
                                                                         0xFFFFFFFF after any modification of the LFXO board
                                                                         circuit, load capacitance, or crystal swap, or update
                                                                         of the register LFOSC.LFXOCONFIG.*/
  __IOM uint32_t  LFRCAUTOCALCONFIG;                 /*!< (@ 0x00000008) LFRC autocalibration configuration.                   */
} NRF_BICR_LFOSC_Type;                               /*!< Size = 12 (0x00C)                                                    */

/* BICR_LFOSC_LFXOCONFIG: LFXO configuration. */
  #define BICR_LFOSC_LFXOCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFXOCONFIG register.                             */

/* ACCURACY @Bits 0..3 : LFXO crystal or external signal accuracy. */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Pos (0UL)   /*!< Position of ACCURACY field.                                          */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Msk (0xFUL << BICR_LFOSC_LFXOCONFIG_ACCURACY_Pos) /*!< Bit mask of ACCURACY field.    */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Min (0x0UL) /*!< Min enumerator value of ACCURACY field.                              */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Max (0xFUL) /*!< Max enumerator value of ACCURACY field.                              */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Unconfigured (0xFUL) /*!< The accuracy is unconfigured.                               */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_500ppm (0x0UL) /*!< LFXO crystal or external signal has an accuracy of 500 ppm.       */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_250ppm (0x1UL) /*!< LFXO crystal or external signal has an accuracy of 250 ppm.       */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_150ppm (0x2UL) /*!< LFXO crystal or external signal has an accuracy of 150 ppm.       */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_100ppm (0x3UL) /*!< LFXO crystal or external signal has an accuracy of 100 ppm.       */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_75ppm (0x4UL) /*!< LFXO crystal or external signal has an accuracy of 75 ppm.         */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_50ppm (0x5UL) /*!< LFXO crystal or external signal has an accuracy of 50 ppm.         */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_30ppm (0x6UL) /*!< LFXO crystal or external signal has an accuracy of 30 ppm.         */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_20ppm (0x7UL) /*!< LFXO crystal or external signal has an accuracy of 20 ppm.         */

/* MODE @Bits 4..6 : LFXO mode. LFXO will not start unless MODE is configured. Setting this field to anyting but Unconfigured
                     will be used as the indication that the selected source is available as input to the LFXO. */

  #define BICR_LFOSC_LFXOCONFIG_MODE_Pos (4UL)       /*!< Position of MODE field.                                              */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Msk (0x7UL << BICR_LFOSC_LFXOCONFIG_MODE_Pos) /*!< Bit mask of MODE field.                */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Min (0x0UL)     /*!< Min enumerator value of MODE field.                                  */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Max (0x7UL)     /*!< Max enumerator value of MODE field.                                  */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Unconfigured (0x7UL) /*!< The mode is unconfigured.                                       */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Crystal (0x0UL) /*!< LFXO in external crystal oscillator mode.                            */
  #define BICR_LFOSC_LFXOCONFIG_MODE_ExtSine (0x2UL) /*!< LFXO in external sine wave mode.                                     */
  #define BICR_LFOSC_LFXOCONFIG_MODE_ExtSquare (0x3UL) /*!< LFXO in external square wave mode.                                 */
  #define BICR_LFOSC_LFXOCONFIG_MODE_Disabled (0x6UL) /*!< LFXO is not to be used.                                             */

/* LOADCAP @Bits 8..15 : Built-in load capacitors selection in 1 pF steps. Max. value 25 pF. */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Pos (8UL)    /*!< Position of LOADCAP field.                                           */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Msk (0xFFUL << BICR_LFOSC_LFXOCONFIG_LOADCAP_Pos) /*!< Bit mask of LOADCAP field.      */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Min (0x0UL)  /*!< Min enumerator value of LOADCAP field.                               */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Max (0xFFUL) /*!< Max enumerator value of LOADCAP field.                               */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Unconfigured (0xFFUL) /*!< The built-in load capacitors is unconfigured. LFXO will not
                                                                   start unless LOADCAP is configured.*/
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_External (0x00UL) /*!< Do not use the built-in load capacitors, only external capacitors
                                                               will be used.*/

/* TIME @Bits 16..27 : LFXO startup time in ms. */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Pos (16UL)      /*!< Position of TIME field.                                              */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Msk (0xFFFUL << BICR_LFOSC_LFXOCONFIG_TIME_Pos) /*!< Bit mask of TIME field.              */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Min (0xFFFUL)   /*!< Min enumerator value of TIME field.                                  */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Max (0xFFFUL)   /*!< Max enumerator value of TIME field.                                  */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Unconfigured (0xFFFUL) /*!< Startup time has not been configured.                         */


/* BICR_LFOSC_LFXOCAL: LFXO calibration requested. Must be written to 0xFFFFFFFF after any modification of the LFXO board
                        circuit, load capacitance, or crystal swap, or update of the register LFOSC.LFXOCONFIG. */

  #define BICR_LFOSC_LFXOCAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFXOCAL register.                                   */

