NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* BICR_HFXO_STARTUPTIME: HFXO startup time in us. */
  #define BICR_HFXO_STARTUPTIME_ResetValue (0xFFFFFFFFUL) /*!< Reset value of STARTUPTIME register.                            */

/* TIME @Bits 0..31 : HFXO startup time in us. */
  #define BICR_HFXO_STARTUPTIME_TIME_Pos (0UL)       /*!< Position of TIME field.                                              */
  #define BICR_HFXO_STARTUPTIME_TIME_Msk (0xFFFFFFFFUL << BICR_HFXO_STARTUPTIME_TIME_Pos) /*!< Bit mask of TIME field.         */
  #define BICR_HFXO_STARTUPTIME_TIME_Min (0xFFFFFFFFUL) /*!< Min enumerator value of TIME field.                               */
  #define BICR_HFXO_STARTUPTIME_TIME_Max (0xFFFFFFFFUL) /*!< Max enumerator value of TIME field.                               */
  #define BICR_HFXO_STARTUPTIME_TIME_Unconfigured (0xFFFFFFFFUL) /*!< Startup time has not been configured.                    */


/* ======================================================= Struct BICR ======================================================= */
/**
  * @brief Board information configuration registers
  */
  typedef struct {                                   /*!< BICR Structure                                                       */
    __IOM NRF_BICR_POWER_Type POWER;                 /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_BICR_IOPORT_Type IOPORT;               /*!< (@ 0x00000004) (unspecified)                                         */
    __IM uint32_t RESERVED[2];
    __IOM NRF_BICR_LFOSC_Type LFOSC;                 /*!< (@ 0x00000018) (unspecified)                                         */
    __IOM NRF_BICR_HFXO_Type HFXO;                   /*!< (@ 0x00000024) (unspecified)                                         */
  } NRF_BICR_Type;                                   /*!< Size = 44 (0x02C)                                                    */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct CACHE_PROFILING ================================================== */
/**
  * @brief PROFILING [CACHE_PROFILING] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Enable the profiling counters.                        */
  __OM  uint32_t  CLEAR;                             /*!< (@ 0x00000004) Clear the profiling counters.                         */
  __IM  uint32_t  HIT;                               /*!< (@ 0x00000008) The cache hit counter for cache region.               */
  __IM  uint32_t  MISS;                              /*!< (@ 0x0000000C) The cache miss counter for cache region.              */
  __IM  uint32_t  LMISS;                             /*!< (@ 0x00000010) The cache line miss counter for cache region.         */
  __IM  uint32_t  READS;                             /*!< (@ 0x00000014) Number of reads for cache region.                     */
  __IM  uint32_t  WRITES;                            /*!< (@ 0x00000018) Number of writes for cache region.                    */
} NRF_CACHE_PROFILING_Type;                          /*!< Size = 28 (0x01C)                                                    */

/* CACHE_PROFILING_ENABLE: Enable the profiling counters. */
  #define CACHE_PROFILING_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                */

/* ENABLE @Bit 0 : Enable the profiling counters */
  #define CACHE_PROFILING_ENABLE_ENABLE_Pos (0UL)    /*!< Position of ENABLE field.                                            */
  #define CACHE_PROFILING_ENABLE_ENABLE_Msk (0x1UL << CACHE_PROFILING_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.        */
  #define CACHE_PROFILING_ENABLE_ENABLE_Min (0x0UL)  /*!< Min enumerator value of ENABLE field.                                */
  #define CACHE_PROFILING_ENABLE_ENABLE_Max (0x1UL)  /*!< Max enumerator value of ENABLE field.                                */
  #define CACHE_PROFILING_ENABLE_ENABLE_Disable (0x0UL) /*!< Disable profiling                                                 */
  #define CACHE_PROFILING_ENABLE_ENABLE_Enable (0x1UL) /*!< Enable profiling                                                   */


/* CACHE_PROFILING_CLEAR: Clear the profiling counters. */
  #define CACHE_PROFILING_CLEAR_ResetValue (0x00000000UL) /*!< Reset value of CLEAR register.                                  */

/* CLEAR @Bit 0 : Clearing the profiling counters */
  #define CACHE_PROFILING_CLEAR_CLEAR_Pos (0UL)      /*!< Position of CLEAR field.                                             */
  #define CACHE_PROFILING_CLEAR_CLEAR_Msk (0x1UL << CACHE_PROFILING_CLEAR_CLEAR_Pos) /*!< Bit mask of CLEAR field.             */
  #define CACHE_PROFILING_CLEAR_CLEAR_Min (0x1UL)    /*!< Min enumerator value of CLEAR field.                                 */
  #define CACHE_PROFILING_CLEAR_CLEAR_Max (0x1UL)    /*!< Max enumerator value of CLEAR field.                                 */
  #define CACHE_PROFILING_CLEAR_CLEAR_Clear (0x1UL)  /*!< Clear the profiling counters                                         */


/* CACHE_PROFILING_HIT: The cache hit counter for cache region. */
  #define CACHE_PROFILING_HIT_ResetValue (0x00000000UL) /*!< Reset value of HIT register.                                      */

/* HITS @Bits 0..31 : Number of cache hits */
  #define CACHE_PROFILING_HIT_HITS_Pos (0UL)         /*!< Position of HITS field.                                              */
  #define CACHE_PROFILING_HIT_HITS_Msk (0xFFFFFFFFUL << CACHE_PROFILING_HIT_HITS_Pos) /*!< Bit mask of HITS field.             */


/* CACHE_PROFILING_MISS: The cache miss counter for cache region. */
  #define CACHE_PROFILING_MISS_ResetValue (0x00000000UL) /*!< Reset value of MISS register.                                    */

/* MISSES @Bits 0..31 : Number of cache misses */
  #define CACHE_PROFILING_MISS_MISSES_Pos (0UL)      /*!< Position of MISSES field.                                            */
  #define CACHE_PROFILING_MISS_MISSES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_MISS_MISSES_Pos) /*!< Bit mask of MISSES field.     */


