NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CACHE_PROFILING_LMISS: The cache line miss counter for cache region. */
  #define CACHE_PROFILING_LMISS_ResetValue (0x00000000UL) /*!< Reset value of LMISS register.                                  */

/* LMISSES @Bits 0..31 : Number of cache line misses */
  #define CACHE_PROFILING_LMISS_LMISSES_Pos (0UL)    /*!< Position of LMISSES field.                                           */
  #define CACHE_PROFILING_LMISS_LMISSES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_LMISS_LMISSES_Pos) /*!< Bit mask of LMISSES field.*/


/* CACHE_PROFILING_READS: Number of reads for cache region. */
  #define CACHE_PROFILING_READS_ResetValue (0x00000000UL) /*!< Reset value of READS register.                                  */

/* READS @Bits 0..31 : Number of reads for cache region. */
  #define CACHE_PROFILING_READS_READS_Pos (0UL)      /*!< Position of READS field.                                             */
  #define CACHE_PROFILING_READS_READS_Msk (0xFFFFFFFFUL << CACHE_PROFILING_READS_READS_Pos) /*!< Bit mask of READS field.      */


/* CACHE_PROFILING_WRITES: Number of writes for cache region. */
  #define CACHE_PROFILING_WRITES_ResetValue (0x00000000UL) /*!< Reset value of WRITES register.                                */

/* WRITES @Bits 0..31 : Number of writes for cache region. */
  #define CACHE_PROFILING_WRITES_WRITES_Pos (0UL)    /*!< Position of WRITES field.                                            */
  #define CACHE_PROFILING_WRITES_WRITES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_WRITES_WRITES_Pos) /*!< Bit mask of WRITES field. */



/* ============================================== Struct CACHE_COHERENCYSTATUS =============================================== */
/**
  * @brief COHERENCYSTATUS [CACHE_COHERENCYSTATUS] (unspecified)
  */
typedef struct {
  __IM  uint32_t  INVALIDATELINE;                    /*!< (@ 0x00000000) Performs an atomic read of the STATUS registers and
                                                                         triggering the Invalidate operation; accessible for
                                                                         non-secure access as well.*/
  __IM  uint32_t  CLEANLINE;                         /*!< (@ 0x00000004) Performs an atomic read of the STATUS registers and
                                                                         triggering the Clean operation; accessible for
                                                                         non-secure access as well.*/
  __IM  uint32_t  FLUSHLINE;                         /*!< (@ 0x00000008) Performs an atomic read of the STATUS registers and
                                                                         triggering the Flush operation; accessible for
                                                                         non-secure access as well.*/
} NRF_CACHE_COHERENCYSTATUS_Type;                    /*!< Size = 12 (0x00C)                                                    */

/* CACHE_COHERENCYSTATUS_INVALIDATELINE: Performs an atomic read of the STATUS registers and triggering the Invalidate
                                          operation; accessible for non-secure access as well. */

  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_ResetValue (0x00000000UL) /*!< Reset value of INVALIDATELINE register.          */

/* BUSY @Bit 0 : Status */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Pos (0UL) /*!< Position of BUSY field.                                     */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Msk (0x1UL << CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Pos) /*!< Bit mask
                                                                            of BUSY field.*/
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                       */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                       */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Ready (0x0UL) /*!< STATUS.READY was ready                                  */
  #define CACHE_COHERENCYSTATUS_INVALIDATELINE_BUSY_Busy (0x1UL) /*!< STATUS.READY was busy                                    */


/* CACHE_COHERENCYSTATUS_CLEANLINE: Performs an atomic read of the STATUS registers and triggering the Clean operation;
                                     accessible for non-secure access as well. */

  #define CACHE_COHERENCYSTATUS_CLEANLINE_ResetValue (0x00000000UL) /*!< Reset value of CLEANLINE register.                    */

/* BUSY @Bit 0 : Status */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Pos (0UL) /*!< Position of BUSY field.                                          */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Msk (0x1UL << CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Pos) /*!< Bit mask of BUSY
                                                                            field.*/
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                            */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                            */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Ready (0x0UL) /*!< STATUS.READY was ready                                       */
  #define CACHE_COHERENCYSTATUS_CLEANLINE_BUSY_Busy (0x1UL) /*!< STATUS.READY was busy                                         */


/* CACHE_COHERENCYSTATUS_FLUSHLINE: Performs an atomic read of the STATUS registers and triggering the Flush operation;
                                     accessible for non-secure access as well. */

  #define CACHE_COHERENCYSTATUS_FLUSHLINE_ResetValue (0x00000000UL) /*!< Reset value of FLUSHLINE register.                    */

/* BUSY @Bit 0 : Status */
  #define CACHE_COHERENCYSTATUS_FLUSHLINE_BUSY_Pos (0UL) /*!< Position of BUSY field.                                          */
  #define CACHE_COHERENCYSTATUS_FLUSHLINE_BUSY_Msk (0x1UL << CACHE_COHERENCYSTATUS_FLUSHLINE_BUSY_Pos) /*!< Bit mask of BUSY
                                                                            field.*/
  #define CACHE_COHERENCYSTATUS_FLUSHLINE_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                            */
  #define CACHE_COHERENCYSTATUS_FLUSHLINE_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                            */
  #define CACHE_COHERENCYSTATUS_FLUSHLINE_BUSY_Ready (0x0UL) /*!< STATUS.READY was ready                                       */
  #define CACHE_COHERENCYSTATUS_FLUSHLINE_BUSY_Busy (0x1UL) /*!< STATUS.READY was busy                                         */


/* ====================================================== Struct CACHE ======================================================= */
/**
  * @brief Cache
  */
  typedef struct {                                   /*!< CACHE Structure                                                      */
    __OM uint32_t TASKS_SAVE;                        /*!< (@ 0x00000000) Save the cache state to a retained memory space.      */
    __OM uint32_t TASKS_RESTORE;                     /*!< (@ 0x00000004) Restore the cache state from a retained memory space. */
    __OM uint32_t TASKS_INVALIDATECACHE;             /*!< (@ 0x00000008) Invalidate the cache.                                 */
    __OM uint32_t TASKS_CLEANCACHE;                  /*!< (@ 0x0000000C) Clean the cache.                                      */
    __OM uint32_t TASKS_FLUSHCACHE;                  /*!< (@ 0x00000010) Flush the cache.                                      */
    __OM uint32_t TASKS_INVALIDATELINE;              /*!< (@ 0x00000014) Invalidate the line.                                  */
    __OM uint32_t TASKS_CLEANLINE;                   /*!< (@ 0x00000018) Clean the line.                                       */
    __OM uint32_t TASKS_FLUSHLINE;                   /*!< (@ 0x0000001C) Flush the line.                                       */
    __OM uint32_t TASKS_ERASE;                       /*!< (@ 0x00000020) Erase the cache.                                      */
    __IM uint32_t RESERVED[55];
    __IOM uint32_t EVENTS_DONE;                      /*!< (@ 0x00000100) Save or Restore task is done.                         */
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Status of the cache activities.                       */
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000404) Enable cache.                                         */
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t LINEADDR;                         /*!< (@ 0x00000410) Memory address covered by the line to be maintained.  */
    __IOM NRF_CACHE_PROFILING_Type PROFILING;        /*!< (@ 0x00000414) (unspecified)                                         */
    __IOM uint32_t DEBUGLOCK;                        /*!< (@ 0x00000430) Lock debug mode.                                      */
    __IOM uint32_t WRITELOCK;                        /*!< (@ 0x00000434) Lock cache updates.                                   */
    __IM uint32_t RESERVED4[17];
    __IOM uint32_t LINEADDRNS;                       /*!< (@ 0x0000047C) Same as register LINEADDR, but for non-secure access.
                                                                         The bit 28 of the address is hard coded to 0.*/
    __IOM NRF_CACHE_COHERENCYSTATUS_Type COHERENCYSTATUS; /*!< (@ 0x00000480) (unspecified)                                    */
  } NRF_CACHE_Type;                                  /*!< Size = 1164 (0x48C)                                                  */

/* CACHE_TASKS_SAVE: Save the cache state to a retained memory space. */
  #define CACHE_TASKS_SAVE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SAVE register.                                  */

/* TASKS_SAVE @Bit 0 : Save the cache state to a retained memory space. */
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Pos (0UL)      /*!< Position of TASKS_SAVE field.                                        */
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Msk (0x1UL << CACHE_TASKS_SAVE_TASKS_SAVE_Pos) /*!< Bit mask of TASKS_SAVE field.        */
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Min (0x1UL)    /*!< Min enumerator value of TASKS_SAVE field.                            */
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Max (0x1UL)    /*!< Max enumerator value of TASKS_SAVE field.                            */
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Trigger (0x1UL) /*!< Trigger task                                                        */


/* CACHE_TASKS_RESTORE: Restore the cache state from a retained memory space. */
  #define CACHE_TASKS_RESTORE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESTORE register.                            */

