NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TASKS_RESTORE @Bit 0 : Restore the cache state from a retained memory space. */
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Pos (0UL) /*!< Position of TASKS_RESTORE field.                                    */
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Msk (0x1UL << CACHE_TASKS_RESTORE_TASKS_RESTORE_Pos) /*!< Bit mask of TASKS_RESTORE
                                                                            field.*/
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Min (0x1UL) /*!< Min enumerator value of TASKS_RESTORE field.                      */
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Max (0x1UL) /*!< Max enumerator value of TASKS_RESTORE field.                      */
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Trigger (0x1UL) /*!< Trigger task                                                  */


/* CACHE_TASKS_INVALIDATECACHE: Invalidate the cache. */
  #define CACHE_TASKS_INVALIDATECACHE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_INVALIDATECACHE register.            */

/* TASKS_INVALIDATECACHE @Bit 0 : Invalidate the cache. */
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Pos (0UL) /*!< Position of TASKS_INVALIDATECACHE field.            */
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Msk (0x1UL << CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Pos)
                                                                            /*!< Bit mask of TASKS_INVALIDATECACHE field.*/
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Min (0x1UL) /*!< Min enumerator value of TASKS_INVALIDATECACHE
                                                                            field.*/
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Max (0x1UL) /*!< Max enumerator value of TASKS_INVALIDATECACHE
                                                                            field.*/
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Trigger (0x1UL) /*!< Trigger task                                  */


/* CACHE_TASKS_CLEANCACHE: Clean the cache. */
  #define CACHE_TASKS_CLEANCACHE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CLEANCACHE register.                      */

/* TASKS_CLEANCACHE @Bit 0 : Clean the cache. */
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Pos (0UL) /*!< Position of TASKS_CLEANCACHE field.                           */
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Msk (0x1UL << CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Pos) /*!< Bit mask of
                                                                            TASKS_CLEANCACHE field.*/
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Min (0x1UL) /*!< Min enumerator value of TASKS_CLEANCACHE field.             */
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Max (0x1UL) /*!< Max enumerator value of TASKS_CLEANCACHE field.             */
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Trigger (0x1UL) /*!< Trigger task                                            */


/* CACHE_TASKS_FLUSHCACHE: Flush the cache. */
  #define CACHE_TASKS_FLUSHCACHE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FLUSHCACHE register.                      */

/* TASKS_FLUSHCACHE @Bit 0 : Flush the cache. */
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Pos (0UL) /*!< Position of TASKS_FLUSHCACHE field.                           */
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Msk (0x1UL << CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Pos) /*!< Bit mask of
                                                                            TASKS_FLUSHCACHE field.*/
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Min (0x1UL) /*!< Min enumerator value of TASKS_FLUSHCACHE field.             */
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Max (0x1UL) /*!< Max enumerator value of TASKS_FLUSHCACHE field.             */
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Trigger (0x1UL) /*!< Trigger task                                            */


/* CACHE_TASKS_INVALIDATELINE: Invalidate the line. */
  #define CACHE_TASKS_INVALIDATELINE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_INVALIDATELINE register.              */

/* TASKS_INVALIDATELINE @Bit 0 : Invalidate the line. */
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Pos (0UL) /*!< Position of TASKS_INVALIDATELINE field.               */
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Msk (0x1UL << CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Pos)
                                                                            /*!< Bit mask of TASKS_INVALIDATELINE field.*/
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Min (0x1UL) /*!< Min enumerator value of TASKS_INVALIDATELINE field. */
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Max (0x1UL) /*!< Max enumerator value of TASKS_INVALIDATELINE field. */
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Trigger (0x1UL) /*!< Trigger task                                    */


/* CACHE_TASKS_CLEANLINE: Clean the line. */
  #define CACHE_TASKS_CLEANLINE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CLEANLINE register.                        */

/* TASKS_CLEANLINE @Bit 0 : Clean the line. */
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Pos (0UL) /*!< Position of TASKS_CLEANLINE field.                              */
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Msk (0x1UL << CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Pos) /*!< Bit mask of
                                                                            TASKS_CLEANLINE field.*/
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Min (0x1UL) /*!< Min enumerator value of TASKS_CLEANLINE field.                */
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Max (0x1UL) /*!< Max enumerator value of TASKS_CLEANLINE field.                */
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Trigger (0x1UL) /*!< Trigger task                                              */


/* CACHE_TASKS_FLUSHLINE: Flush the line. */
  #define CACHE_TASKS_FLUSHLINE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FLUSHLINE register.                        */

/* TASKS_FLUSHLINE @Bit 0 : Flush the line. */
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Pos (0UL) /*!< Position of TASKS_FLUSHLINE field.                              */
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Msk (0x1UL << CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Pos) /*!< Bit mask of
                                                                            TASKS_FLUSHLINE field.*/
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Min (0x1UL) /*!< Min enumerator value of TASKS_FLUSHLINE field.                */
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Max (0x1UL) /*!< Max enumerator value of TASKS_FLUSHLINE field.                */
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Trigger (0x1UL) /*!< Trigger task                                              */


/* CACHE_TASKS_ERASE: Erase the cache. */
  #define CACHE_TASKS_ERASE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ERASE register.                                */

