NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CACHE_DEBUGLOCK: Lock debug mode. */
  #define CACHE_DEBUGLOCK_ResetValue (0x00000000UL)  /*!< Reset value of DEBUGLOCK register.                                   */

/* DEBUGLOCK @Bit 0 : Lock debug mode */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Pos (0UL)        /*!< Position of DEBUGLOCK field.                                         */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Msk (0x1UL << CACHE_DEBUGLOCK_DEBUGLOCK_Pos) /*!< Bit mask of DEBUGLOCK field.             */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Min (0x0UL)      /*!< Min enumerator value of DEBUGLOCK field.                             */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Max (0x1UL)      /*!< Max enumerator value of DEBUGLOCK field.                             */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Unlocked (0x0UL) /*!< Debug mode unlocked                                                  */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Locked (0x1UL)   /*!< Debug mode locked. Ignores any other value written.                  */


/* CACHE_WRITELOCK: Lock cache updates. */
  #define CACHE_WRITELOCK_ResetValue (0x00000000UL)  /*!< Reset value of WRITELOCK register.                                   */

/* WRITELOCK @Bit 0 : Lock cache updates */
  #define CACHE_WRITELOCK_WRITELOCK_Pos (0UL)        /*!< Position of WRITELOCK field.                                         */
  #define CACHE_WRITELOCK_WRITELOCK_Msk (0x1UL << CACHE_WRITELOCK_WRITELOCK_Pos) /*!< Bit mask of WRITELOCK field.             */
  #define CACHE_WRITELOCK_WRITELOCK_Min (0x0UL)      /*!< Min enumerator value of WRITELOCK field.                             */
  #define CACHE_WRITELOCK_WRITELOCK_Max (0x1UL)      /*!< Max enumerator value of WRITELOCK field.                             */
  #define CACHE_WRITELOCK_WRITELOCK_Unlocked (0x0UL) /*!< Cache updates unlocked                                               */
  #define CACHE_WRITELOCK_WRITELOCK_Locked (0x1UL)   /*!< Cache updates locked                                                 */


/* CACHE_LINEADDRNS: Same as register LINEADDR, but for non-secure access. The bit 28 of the address is hard coded to 0. */
  #define CACHE_LINEADDRNS_ResetValue (0x00000000UL) /*!< Reset value of LINEADDRNS register.                                  */

/* ADDR @Bits 0..31 : Address. */
  #define CACHE_LINEADDRNS_ADDR_Pos (0UL)            /*!< Position of ADDR field.                                              */
  #define CACHE_LINEADDRNS_ADDR_Msk (0xFFFFFFFFUL << CACHE_LINEADDRNS_ADDR_Pos) /*!< Bit mask of ADDR field.                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CAN                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CAN ======================================================== */
/**
  * @brief Controller Area Network
  */
  typedef struct {                                   /*!< CAN Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the CAN peripheral.                             */
    __OM uint32_t TASKS_STOPREQ;                     /*!< (@ 0x00000004) Request to stop the CAN peripheral                    */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000008) Stop the CAN peripheral                               */
    __IM uint32_t RESERVED[61];
    __IOM uint32_t EVENTS_CORE[2];                   /*!< (@ 0x00000100) Event indicating that interrupt n triggered at CAN
                                                                         core*/
    __IOM uint32_t EVENTS_DMU;                       /*!< (@ 0x00000108) Event indicating that interrupt triggered at CAN DMU  */
    __IOM uint32_t EVENTS_DMA;                       /*!< (@ 0x0000010C) Event indicating that interrupt triggered at CAN DMA  */
    __IOM uint32_t EVENTS_READYFORSTOP;              /*!< (@ 0x00000110) Event indicating that the CAN is ready to be stopped  */
    __IM uint32_t RESERVED1[59];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
  } NRF_CAN_Type;                                    /*!< Size = 784 (0x310)                                                   */

/* CAN_TASKS_START: Start the CAN peripheral. */
  #define CAN_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start the CAN peripheral. */
  #define CAN_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define CAN_TASKS_START_TASKS_START_Msk (0x1UL << CAN_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define CAN_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define CAN_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define CAN_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


