NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CORE1 @Bit 1 : Write '1' to enable interrupt for event CORE[1] */
  #define CAN_INTENSET_CORE1_Pos (1UL)               /*!< Position of CORE1 field.                                             */
  #define CAN_INTENSET_CORE1_Msk (0x1UL << CAN_INTENSET_CORE1_Pos) /*!< Bit mask of CORE1 field.                               */
  #define CAN_INTENSET_CORE1_Min (0x0UL)             /*!< Min enumerator value of CORE1 field.                                 */
  #define CAN_INTENSET_CORE1_Max (0x1UL)             /*!< Max enumerator value of CORE1 field.                                 */
  #define CAN_INTENSET_CORE1_Set (0x1UL)             /*!< Enable                                                               */
  #define CAN_INTENSET_CORE1_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define CAN_INTENSET_CORE1_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* DMU @Bit 2 : Write '1' to enable interrupt for event DMU */
  #define CAN_INTENSET_DMU_Pos (2UL)                 /*!< Position of DMU field.                                               */
  #define CAN_INTENSET_DMU_Msk (0x1UL << CAN_INTENSET_DMU_Pos) /*!< Bit mask of DMU field.                                     */
  #define CAN_INTENSET_DMU_Min (0x0UL)               /*!< Min enumerator value of DMU field.                                   */
  #define CAN_INTENSET_DMU_Max (0x1UL)               /*!< Max enumerator value of DMU field.                                   */
  #define CAN_INTENSET_DMU_Set (0x1UL)               /*!< Enable                                                               */
  #define CAN_INTENSET_DMU_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define CAN_INTENSET_DMU_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* DMA @Bit 3 : Write '1' to enable interrupt for event DMA */
  #define CAN_INTENSET_DMA_Pos (3UL)                 /*!< Position of DMA field.                                               */
  #define CAN_INTENSET_DMA_Msk (0x1UL << CAN_INTENSET_DMA_Pos) /*!< Bit mask of DMA field.                                     */
  #define CAN_INTENSET_DMA_Min (0x0UL)               /*!< Min enumerator value of DMA field.                                   */
  #define CAN_INTENSET_DMA_Max (0x1UL)               /*!< Max enumerator value of DMA field.                                   */
  #define CAN_INTENSET_DMA_Set (0x1UL)               /*!< Enable                                                               */
  #define CAN_INTENSET_DMA_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define CAN_INTENSET_DMA_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* READYFORSTOP @Bit 4 : Write '1' to enable interrupt for event READYFORSTOP */
  #define CAN_INTENSET_READYFORSTOP_Pos (4UL)        /*!< Position of READYFORSTOP field.                                      */
  #define CAN_INTENSET_READYFORSTOP_Msk (0x1UL << CAN_INTENSET_READYFORSTOP_Pos) /*!< Bit mask of READYFORSTOP field.          */
  #define CAN_INTENSET_READYFORSTOP_Min (0x0UL)      /*!< Min enumerator value of READYFORSTOP field.                          */
  #define CAN_INTENSET_READYFORSTOP_Max (0x1UL)      /*!< Max enumerator value of READYFORSTOP field.                          */
  #define CAN_INTENSET_READYFORSTOP_Set (0x1UL)      /*!< Enable                                                               */
  #define CAN_INTENSET_READYFORSTOP_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define CAN_INTENSET_READYFORSTOP_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* CAN_INTENCLR: Disable interrupt */
  #define CAN_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* CORE0 @Bit 0 : Write '1' to disable interrupt for event CORE[0] */
  #define CAN_INTENCLR_CORE0_Pos (0UL)               /*!< Position of CORE0 field.                                             */
  #define CAN_INTENCLR_CORE0_Msk (0x1UL << CAN_INTENCLR_CORE0_Pos) /*!< Bit mask of CORE0 field.                               */
  #define CAN_INTENCLR_CORE0_Min (0x0UL)             /*!< Min enumerator value of CORE0 field.                                 */
  #define CAN_INTENCLR_CORE0_Max (0x1UL)             /*!< Max enumerator value of CORE0 field.                                 */
  #define CAN_INTENCLR_CORE0_Clear (0x1UL)           /*!< Disable                                                              */
  #define CAN_INTENCLR_CORE0_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define CAN_INTENCLR_CORE0_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* CORE1 @Bit 1 : Write '1' to disable interrupt for event CORE[1] */
  #define CAN_INTENCLR_CORE1_Pos (1UL)               /*!< Position of CORE1 field.                                             */
  #define CAN_INTENCLR_CORE1_Msk (0x1UL << CAN_INTENCLR_CORE1_Pos) /*!< Bit mask of CORE1 field.                               */
  #define CAN_INTENCLR_CORE1_Min (0x0UL)             /*!< Min enumerator value of CORE1 field.                                 */
  #define CAN_INTENCLR_CORE1_Max (0x1UL)             /*!< Max enumerator value of CORE1 field.                                 */
  #define CAN_INTENCLR_CORE1_Clear (0x1UL)           /*!< Disable                                                              */
  #define CAN_INTENCLR_CORE1_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define CAN_INTENCLR_CORE1_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* DMU @Bit 2 : Write '1' to disable interrupt for event DMU */
  #define CAN_INTENCLR_DMU_Pos (2UL)                 /*!< Position of DMU field.                                               */
  #define CAN_INTENCLR_DMU_Msk (0x1UL << CAN_INTENCLR_DMU_Pos) /*!< Bit mask of DMU field.                                     */
  #define CAN_INTENCLR_DMU_Min (0x0UL)               /*!< Min enumerator value of DMU field.                                   */
  #define CAN_INTENCLR_DMU_Max (0x1UL)               /*!< Max enumerator value of DMU field.                                   */
  #define CAN_INTENCLR_DMU_Clear (0x1UL)             /*!< Disable                                                              */
  #define CAN_INTENCLR_DMU_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define CAN_INTENCLR_DMU_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* DMA @Bit 3 : Write '1' to disable interrupt for event DMA */
  #define CAN_INTENCLR_DMA_Pos (3UL)                 /*!< Position of DMA field.                                               */
  #define CAN_INTENCLR_DMA_Msk (0x1UL << CAN_INTENCLR_DMA_Pos) /*!< Bit mask of DMA field.                                     */
  #define CAN_INTENCLR_DMA_Min (0x0UL)               /*!< Min enumerator value of DMA field.                                   */
  #define CAN_INTENCLR_DMA_Max (0x1UL)               /*!< Max enumerator value of DMA field.                                   */
  #define CAN_INTENCLR_DMA_Clear (0x1UL)             /*!< Disable                                                              */
  #define CAN_INTENCLR_DMA_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define CAN_INTENCLR_DMA_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

