NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CCM_SUBSCRIBE_START: Subscribe configuration for task START */
  #define CCM_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define CCM_SUBSCRIBE_START_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define CCM_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define CCM_SUBSCRIBE_START_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define CCM_SUBSCRIBE_START_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CCM_SUBSCRIBE_START_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define CCM_SUBSCRIBE_START_EN_Msk (0x1UL << CCM_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                          */
  #define CCM_SUBSCRIBE_START_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define CCM_SUBSCRIBE_START_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define CCM_SUBSCRIBE_START_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define CCM_SUBSCRIBE_START_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* CCM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define CCM_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define CCM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define CCM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define CCM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define CCM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CCM_SUBSCRIBE_STOP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define CCM_SUBSCRIBE_STOP_EN_Msk (0x1UL << CCM_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define CCM_SUBSCRIBE_STOP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define CCM_SUBSCRIBE_STOP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define CCM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)     /*!< Disable subscription                                                 */
  #define CCM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)      /*!< Enable subscription                                                  */


/* CCM_SUBSCRIBE_RATEOVERRIDE: Subscribe configuration for task RATEOVERRIDE */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RATEOVERRIDE register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task RATEOVERRIDE will subscribe to */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Msk (0x1UL << CCM_SUBSCRIBE_RATEOVERRIDE_EN_Pos) /*!< Bit mask of EN field.            */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* CCM_EVENTS_END: Encrypt/decrypt complete or ended because of an error */
  #define CCM_EVENTS_END_ResetValue (0x00000000UL)   /*!< Reset value of EVENTS_END register.                                  */

/* EVENTS_END @Bit 0 : Encrypt/decrypt complete or ended because of an error */
  #define CCM_EVENTS_END_EVENTS_END_Pos (0UL)        /*!< Position of EVENTS_END field.                                        */
  #define CCM_EVENTS_END_EVENTS_END_Msk (0x1UL << CCM_EVENTS_END_EVENTS_END_Pos) /*!< Bit mask of EVENTS_END field.            */
  #define CCM_EVENTS_END_EVENTS_END_Min (0x0UL)      /*!< Min enumerator value of EVENTS_END field.                            */
  #define CCM_EVENTS_END_EVENTS_END_Max (0x1UL)      /*!< Max enumerator value of EVENTS_END field.                            */
  #define CCM_EVENTS_END_EVENTS_END_NotGenerated (0x0UL) /*!< Event not generated                                              */
  #define CCM_EVENTS_END_EVENTS_END_Generated (0x1UL) /*!< Event generated                                                     */


/* CCM_EVENTS_ERROR: CCM error event */
  #define CCM_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                                */

/* EVENTS_ERROR @Bit 0 : CCM error event */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)    /*!< Position of EVENTS_ERROR field.                                      */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << CCM_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field.  */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)  /*!< Min enumerator value of EVENTS_ERROR field.                          */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)  /*!< Max enumerator value of EVENTS_ERROR field.                          */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                                 */


/* CCM_PUBLISH_END: Publish configuration for event END */
  #define CCM_PUBLISH_END_ResetValue (0x00000000UL)  /*!< Reset value of PUBLISH_END register.                                 */

