NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CROSS @Bit 3 : Enable or disable interrupt for event CROSS */
  #define COMP_INTEN_CROSS_Pos (3UL)                 /*!< Position of CROSS field.                                             */
  #define COMP_INTEN_CROSS_Msk (0x1UL << COMP_INTEN_CROSS_Pos) /*!< Bit mask of CROSS field.                                   */
  #define COMP_INTEN_CROSS_Min (0x0UL)               /*!< Min enumerator value of CROSS field.                                 */
  #define COMP_INTEN_CROSS_Max (0x1UL)               /*!< Max enumerator value of CROSS field.                                 */
  #define COMP_INTEN_CROSS_Disabled (0x0UL)          /*!< Disable                                                              */
  #define COMP_INTEN_CROSS_Enabled (0x1UL)           /*!< Enable                                                               */


/* COMP_INTENSET: Enable interrupt */
  #define COMP_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define COMP_INTENSET_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define COMP_INTENSET_READY_Msk (0x1UL << COMP_INTENSET_READY_Pos) /*!< Bit mask of READY field.                             */
  #define COMP_INTENSET_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define COMP_INTENSET_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define COMP_INTENSET_READY_Set (0x1UL)            /*!< Enable                                                               */
  #define COMP_INTENSET_READY_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define COMP_INTENSET_READY_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* DOWN @Bit 1 : Write '1' to enable interrupt for event DOWN */
  #define COMP_INTENSET_DOWN_Pos (1UL)               /*!< Position of DOWN field.                                              */
  #define COMP_INTENSET_DOWN_Msk (0x1UL << COMP_INTENSET_DOWN_Pos) /*!< Bit mask of DOWN field.                                */
  #define COMP_INTENSET_DOWN_Min (0x0UL)             /*!< Min enumerator value of DOWN field.                                  */
  #define COMP_INTENSET_DOWN_Max (0x1UL)             /*!< Max enumerator value of DOWN field.                                  */
  #define COMP_INTENSET_DOWN_Set (0x1UL)             /*!< Enable                                                               */
  #define COMP_INTENSET_DOWN_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define COMP_INTENSET_DOWN_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* UP @Bit 2 : Write '1' to enable interrupt for event UP */
  #define COMP_INTENSET_UP_Pos (2UL)                 /*!< Position of UP field.                                                */
  #define COMP_INTENSET_UP_Msk (0x1UL << COMP_INTENSET_UP_Pos) /*!< Bit mask of UP field.                                      */
  #define COMP_INTENSET_UP_Min (0x0UL)               /*!< Min enumerator value of UP field.                                    */
  #define COMP_INTENSET_UP_Max (0x1UL)               /*!< Max enumerator value of UP field.                                    */
  #define COMP_INTENSET_UP_Set (0x1UL)               /*!< Enable                                                               */
  #define COMP_INTENSET_UP_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define COMP_INTENSET_UP_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* CROSS @Bit 3 : Write '1' to enable interrupt for event CROSS */
  #define COMP_INTENSET_CROSS_Pos (3UL)              /*!< Position of CROSS field.                                             */
  #define COMP_INTENSET_CROSS_Msk (0x1UL << COMP_INTENSET_CROSS_Pos) /*!< Bit mask of CROSS field.                             */
  #define COMP_INTENSET_CROSS_Min (0x0UL)            /*!< Min enumerator value of CROSS field.                                 */
  #define COMP_INTENSET_CROSS_Max (0x1UL)            /*!< Max enumerator value of CROSS field.                                 */
  #define COMP_INTENSET_CROSS_Set (0x1UL)            /*!< Enable                                                               */
  #define COMP_INTENSET_CROSS_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define COMP_INTENSET_CROSS_Enabled (0x1UL)        /*!< Read: Enabled                                                        */


/* COMP_INTENCLR: Disable interrupt */
  #define COMP_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define COMP_INTENCLR_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define COMP_INTENCLR_READY_Msk (0x1UL << COMP_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                             */
  #define COMP_INTENCLR_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define COMP_INTENCLR_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define COMP_INTENCLR_READY_Clear (0x1UL)          /*!< Disable                                                              */
  #define COMP_INTENCLR_READY_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define COMP_INTENCLR_READY_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* DOWN @Bit 1 : Write '1' to disable interrupt for event DOWN */
  #define COMP_INTENCLR_DOWN_Pos (1UL)               /*!< Position of DOWN field.                                              */
  #define COMP_INTENCLR_DOWN_Msk (0x1UL << COMP_INTENCLR_DOWN_Pos) /*!< Bit mask of DOWN field.                                */
  #define COMP_INTENCLR_DOWN_Min (0x0UL)             /*!< Min enumerator value of DOWN field.                                  */
  #define COMP_INTENCLR_DOWN_Max (0x1UL)             /*!< Max enumerator value of DOWN field.                                  */
  #define COMP_INTENCLR_DOWN_Clear (0x1UL)           /*!< Disable                                                              */
  #define COMP_INTENCLR_DOWN_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define COMP_INTENCLR_DOWN_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

