NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TASKS_ERASECACHE @Bit 0 : Invalidate the caches used by the CPU. */
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Pos (0UL) /*!< Position of TASKS_ERASECACHE field.                         */
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Msk (0x1UL << CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Pos) /*!< Bit mask
                                                                            of TASKS_ERASECACHE field.*/
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Min (0x1UL) /*!< Min enumerator value of TASKS_ERASECACHE field.           */
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Max (0x1UL) /*!< Max enumerator value of TASKS_ERASECACHE field.           */
  #define CPUCONF_TASKS_ERASECACHE_TASKS_ERASECACHE_Trigger (0x1UL) /*!< Trigger task                                          */


/* CPUCONF_INITSVTOR: Initial value of the secure VTOR (Vector Table Offset Register) after CPU reset. */
  #define CPUCONF_INITSVTOR_ResetValue (0x00000000UL) /*!< Reset value of INITSVTOR register.                                  */

/* INITSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define CPUCONF_INITSVTOR_INITSVTOR_Pos (0UL)      /*!< Position of INITSVTOR field.                                         */
  #define CPUCONF_INITSVTOR_INITSVTOR_Msk (0xFFFFFFFFUL << CPUCONF_INITSVTOR_INITSVTOR_Pos) /*!< Bit mask of INITSVTOR field.  */


/* CPUCONF_INITNSVTOR: Initial value of the non-secure VTOR (Vector Table Offset Register). */
  #define CPUCONF_INITNSVTOR_ResetValue (0x00000000UL) /*!< Reset value of INITNSVTOR register.                                */

/* INITNSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define CPUCONF_INITNSVTOR_INITNSVTOR_Pos (0UL)    /*!< Position of INITNSVTOR field.                                        */
  #define CPUCONF_INITNSVTOR_INITNSVTOR_Msk (0xFFFFFFFFUL << CPUCONF_INITNSVTOR_INITNSVTOR_Pos) /*!< Bit mask of INITNSVTOR
                                                                            field.*/


/* CPUCONF_CPUSTART: CPU start and clock and power request. */
  #define CPUCONF_CPUSTART_ResetValue (0x00000000UL) /*!< Reset value of CPUSTART register.                                    */

/* EN @Bit 0 : Enable to start the CPU. */
  #define CPUCONF_CPUSTART_EN_Pos (0UL)              /*!< Position of EN field.                                                */
  #define CPUCONF_CPUSTART_EN_Msk (0x1UL << CPUCONF_CPUSTART_EN_Pos) /*!< Bit mask of EN field.                                */
  #define CPUCONF_CPUSTART_EN_Min (0x0UL)            /*!< Min enumerator value of EN field.                                    */
  #define CPUCONF_CPUSTART_EN_Max (0x1UL)            /*!< Max enumerator value of EN field.                                    */
  #define CPUCONF_CPUSTART_EN_Stopped (0x0UL)        /*!< CPU stopped.                                                         */
  #define CPUCONF_CPUSTART_EN_Started (0x1UL)        /*!< CPU started.                                                         */


/* CPUCONF_CPUWAIT: CPU wait. */
  #define CPUCONF_CPUWAIT_ResetValue (0x00000000UL)  /*!< Reset value of CPUWAIT register.                                     */

/* EN @Bit 0 : Enable to the CPU wait. */
  #define CPUCONF_CPUWAIT_EN_Pos (0UL)               /*!< Position of EN field.                                                */
  #define CPUCONF_CPUWAIT_EN_Msk (0x1UL << CPUCONF_CPUWAIT_EN_Pos) /*!< Bit mask of EN field.                                  */
  #define CPUCONF_CPUWAIT_EN_Min (0x0UL)             /*!< Min enumerator value of EN field.                                    */
  #define CPUCONF_CPUWAIT_EN_Max (0x1UL)             /*!< Max enumerator value of EN field.                                    */
  #define CPUCONF_CPUWAIT_EN_Disabled (0x0UL)        /*!< CPU is not halted.                                                   */
  #define CPUCONF_CPUWAIT_EN_Enabled (0x1UL)         /*!< CPU is halted.                                                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CTI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CTI ======================================================== */
/**
  * @brief Cross-Trigger Interface control
  */
  typedef struct {                                   /*!< CTI Structure                                                        */
    __IOM uint32_t CTICONTROL;                       /*!< (@ 0x00000000) CTI Control register                                  */
    __IM uint32_t RESERVED[3];
    __OM uint32_t CTIINTACK;                         /*!< (@ 0x00000010) CTI Interrupt Acknowledge register                    */
    __IOM uint32_t CTIAPPSET;                        /*!< (@ 0x00000014) CTI Application Trigger Set register                  */
    __OM uint32_t CTIAPPCLEAR;                       /*!< (@ 0x00000018) CTI Application Trigger Clear register                */
    __OM uint32_t CTIAPPPULSE;                       /*!< (@ 0x0000001C) CTI Application Pulse register                        */
    __IOM uint32_t CTIINEN[8];                       /*!< (@ 0x00000020) CTI Trigger to Channel Enable register                */
    __IM uint32_t RESERVED1[24];
    __IOM uint32_t CTIOUTEN[8];                      /*!< (@ 0x000000A0) CTI Channel to Trigger Enable register                */
    __IM uint32_t RESERVED2[28];
    __IM uint32_t CTITRIGINSTATUS;                   /*!< (@ 0x00000130) CTI Trigger In Status register                        */
    __IM uint32_t CTITRIGOUTSTATUS;                  /*!< (@ 0x00000134) CTI Trigger Out Status register                       */
    __IM uint32_t CTICHINSTATUS;                     /*!< (@ 0x00000138) CTI Channel In Status register                        */
    __IM uint32_t RESERVED3;
    __IOM uint32_t CTIGATE;                          /*!< (@ 0x00000140) Enable CTI Channel Gate register                      */
    __IM uint32_t RESERVED4[926];
    __IM uint32_t DEVARCH;                           /*!< (@ 0x00000FBC) Device Architecture register                          */
    __IM uint32_t RESERVED5[2];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Device Configuration register                         */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) Device Type Identifier register                       */
    __IM uint32_t PIDR4;                             /*!< (@ 0x00000FD0) Peripheral ID4 Register                               */
    __IM uint32_t PIDR5;                             /*!< (@ 0x00000FD4) Peripheral ID5 register                               */
    __IM uint32_t PIDR6;                             /*!< (@ 0x00000FD8) Peripheral ID6 register                               */
    __IM uint32_t PIDR7;                             /*!< (@ 0x00000FDC) Peripheral ID7 register                               */
    __IM uint32_t PIDR0;                             /*!< (@ 0x00000FE0) Peripheral ID0 Register                               */
    __IM uint32_t PIDR1;                             /*!< (@ 0x00000FE4) Peripheral ID1 Register                               */
    __IM uint32_t PIDR2;                             /*!< (@ 0x00000FE8) Peripheral ID2 Register                               */
    __IM uint32_t PIDR3;                             /*!< (@ 0x00000FEC) Peripheral ID3 Register                               */
    __IM uint32_t CIDR0;                             /*!< (@ 0x00000FF0) Component ID0 Register                                */
    __IM uint32_t CIDR1;                             /*!< (@ 0x00000FF4) Component ID1 Register                                */
    __IM uint32_t CIDR2;                             /*!< (@ 0x00000FF8) Component ID2 Register                                */
    __IM uint32_t CIDR3;                             /*!< (@ 0x00000FFC) Component ID3 Register                                */
  } NRF_CTI_Type;                                    /*!< Size = 4096 (0x1000)                                                 */

/* CTI_CTICONTROL: CTI Control register */
  #define CTI_CTICONTROL_ResetValue (0x00000000UL)   /*!< Reset value of CTICONTROL register.                                  */

/* GLBEN @Bit 0 : Enables or disables the CTI. */
  #define CTI_CTICONTROL_GLBEN_Pos (0UL)             /*!< Position of GLBEN field.                                             */
  #define CTI_CTICONTROL_GLBEN_Msk (0x1UL << CTI_CTICONTROL_GLBEN_Pos) /*!< Bit mask of GLBEN field.                           */
  #define CTI_CTICONTROL_GLBEN_Min (0x0UL)           /*!< Min enumerator value of GLBEN field.                                 */
  #define CTI_CTICONTROL_GLBEN_Max (0x1UL)           /*!< Max enumerator value of GLBEN field.                                 */
  #define CTI_CTICONTROL_GLBEN_Disabled (0x0UL)      /*!< All cross-triggering mapping logic functionality is disabled.        */
  #define CTI_CTICONTROL_GLBEN_Enabled (0x1UL)       /*!< Cross-triggering mapping logic functionality is enabled.             */


/* CTI_CTIINTACK: CTI Interrupt Acknowledge register */
  #define CTI_CTIINTACK_ResetValue (0x00000000UL)    /*!< Reset value of CTIINTACK register.                                   */

