NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* INTACK0 @Bit 0 : Acknowledges the ctitrigout 0 output. */
  #define CTI_CTIINTACK_INTACK0_Pos (0UL)            /*!< Position of INTACK0 field.                                           */
  #define CTI_CTIINTACK_INTACK0_Msk (0x1UL << CTI_CTIINTACK_INTACK0_Pos) /*!< Bit mask of INTACK0 field.                       */
  #define CTI_CTIINTACK_INTACK0_Min (0x1UL)          /*!< Min enumerator value of INTACK0 field.                               */
  #define CTI_CTIINTACK_INTACK0_Max (0x1UL)          /*!< Max enumerator value of INTACK0 field.                               */
  #define CTI_CTIINTACK_INTACK0_Acknowledge (0x1UL)  /*!< Clears the ctitrigout.                                               */

/* INTACK1 @Bit 1 : Acknowledges the ctitrigout 1 output. */
  #define CTI_CTIINTACK_INTACK1_Pos (1UL)            /*!< Position of INTACK1 field.                                           */
  #define CTI_CTIINTACK_INTACK1_Msk (0x1UL << CTI_CTIINTACK_INTACK1_Pos) /*!< Bit mask of INTACK1 field.                       */
  #define CTI_CTIINTACK_INTACK1_Min (0x1UL)          /*!< Min enumerator value of INTACK1 field.                               */
  #define CTI_CTIINTACK_INTACK1_Max (0x1UL)          /*!< Max enumerator value of INTACK1 field.                               */
  #define CTI_CTIINTACK_INTACK1_Acknowledge (0x1UL)  /*!< Clears the ctitrigout.                                               */

/* INTACK2 @Bit 2 : Acknowledges the ctitrigout 2 output. */
  #define CTI_CTIINTACK_INTACK2_Pos (2UL)            /*!< Position of INTACK2 field.                                           */
  #define CTI_CTIINTACK_INTACK2_Msk (0x1UL << CTI_CTIINTACK_INTACK2_Pos) /*!< Bit mask of INTACK2 field.                       */
  #define CTI_CTIINTACK_INTACK2_Min (0x1UL)          /*!< Min enumerator value of INTACK2 field.                               */
  #define CTI_CTIINTACK_INTACK2_Max (0x1UL)          /*!< Max enumerator value of INTACK2 field.                               */
  #define CTI_CTIINTACK_INTACK2_Acknowledge (0x1UL)  /*!< Clears the ctitrigout.                                               */

/* INTACK3 @Bit 3 : Acknowledges the ctitrigout 3 output. */
  #define CTI_CTIINTACK_INTACK3_Pos (3UL)            /*!< Position of INTACK3 field.                                           */
  #define CTI_CTIINTACK_INTACK3_Msk (0x1UL << CTI_CTIINTACK_INTACK3_Pos) /*!< Bit mask of INTACK3 field.                       */
  #define CTI_CTIINTACK_INTACK3_Min (0x1UL)          /*!< Min enumerator value of INTACK3 field.                               */
  #define CTI_CTIINTACK_INTACK3_Max (0x1UL)          /*!< Max enumerator value of INTACK3 field.                               */
  #define CTI_CTIINTACK_INTACK3_Acknowledge (0x1UL)  /*!< Clears the ctitrigout.                                               */

/* INTACK4 @Bit 4 : Acknowledges the ctitrigout 4 output. */
  #define CTI_CTIINTACK_INTACK4_Pos (4UL)            /*!< Position of INTACK4 field.                                           */
  #define CTI_CTIINTACK_INTACK4_Msk (0x1UL << CTI_CTIINTACK_INTACK4_Pos) /*!< Bit mask of INTACK4 field.                       */
  #define CTI_CTIINTACK_INTACK4_Min (0x1UL)          /*!< Min enumerator value of INTACK4 field.                               */
  #define CTI_CTIINTACK_INTACK4_Max (0x1UL)          /*!< Max enumerator value of INTACK4 field.                               */
  #define CTI_CTIINTACK_INTACK4_Acknowledge (0x1UL)  /*!< Clears the ctitrigout.                                               */

/* INTACK5 @Bit 5 : Acknowledges the ctitrigout 5 output. */
  #define CTI_CTIINTACK_INTACK5_Pos (5UL)            /*!< Position of INTACK5 field.                                           */
  #define CTI_CTIINTACK_INTACK5_Msk (0x1UL << CTI_CTIINTACK_INTACK5_Pos) /*!< Bit mask of INTACK5 field.                       */
  #define CTI_CTIINTACK_INTACK5_Min (0x1UL)          /*!< Min enumerator value of INTACK5 field.                               */
  #define CTI_CTIINTACK_INTACK5_Max (0x1UL)          /*!< Max enumerator value of INTACK5 field.                               */
  #define CTI_CTIINTACK_INTACK5_Acknowledge (0x1UL)  /*!< Clears the ctitrigout.                                               */

/* INTACK6 @Bit 6 : Acknowledges the ctitrigout 6 output. */
  #define CTI_CTIINTACK_INTACK6_Pos (6UL)            /*!< Position of INTACK6 field.                                           */
  #define CTI_CTIINTACK_INTACK6_Msk (0x1UL << CTI_CTIINTACK_INTACK6_Pos) /*!< Bit mask of INTACK6 field.                       */
  #define CTI_CTIINTACK_INTACK6_Min (0x1UL)          /*!< Min enumerator value of INTACK6 field.                               */
  #define CTI_CTIINTACK_INTACK6_Max (0x1UL)          /*!< Max enumerator value of INTACK6 field.                               */
  #define CTI_CTIINTACK_INTACK6_Acknowledge (0x1UL)  /*!< Clears the ctitrigout.                                               */

/* INTACK7 @Bit 7 : Acknowledges the ctitrigout 7 output. */
  #define CTI_CTIINTACK_INTACK7_Pos (7UL)            /*!< Position of INTACK7 field.                                           */
  #define CTI_CTIINTACK_INTACK7_Msk (0x1UL << CTI_CTIINTACK_INTACK7_Pos) /*!< Bit mask of INTACK7 field.                       */
  #define CTI_CTIINTACK_INTACK7_Min (0x1UL)          /*!< Min enumerator value of INTACK7 field.                               */
  #define CTI_CTIINTACK_INTACK7_Max (0x1UL)          /*!< Max enumerator value of INTACK7 field.                               */
  #define CTI_CTIINTACK_INTACK7_Acknowledge (0x1UL)  /*!< Clears the ctitrigout.                                               */


/* CTI_CTIAPPSET: CTI Application Trigger Set register */
  #define CTI_CTIAPPSET_ResetValue (0x00000000UL)    /*!< Reset value of CTIAPPSET register.                                   */

/* APPSET0 @Bit 0 : Application trigger event for channel 0. */
  #define CTI_CTIAPPSET_APPSET0_Pos (0UL)            /*!< Position of APPSET0 field.                                           */
  #define CTI_CTIAPPSET_APPSET0_Msk (0x1UL << CTI_CTIAPPSET_APPSET0_Pos) /*!< Bit mask of APPSET0 field.                       */
  #define CTI_CTIAPPSET_APPSET0_Min (0x0UL)          /*!< Min enumerator value of APPSET0 field.                               */
  #define CTI_CTIAPPSET_APPSET0_Max (0x1UL)          /*!< Max enumerator value of APPSET0 field.                               */
  #define CTI_CTIAPPSET_APPSET0_Inactive (0x0UL)     /*!< Application trigger 0 is inactive.                                   */
  #define CTI_CTIAPPSET_APPSET0_Active (0x1UL)       /*!< Application trigger 0 is active.                                     */
  #define CTI_CTIAPPSET_APPSET0_Activate (0x1UL)     /*!< Generate channel event for channel 0.                                */

/* APPSET1 @Bit 1 : Application trigger event for channel 1. */
  #define CTI_CTIAPPSET_APPSET1_Pos (1UL)            /*!< Position of APPSET1 field.                                           */
  #define CTI_CTIAPPSET_APPSET1_Msk (0x1UL << CTI_CTIAPPSET_APPSET1_Pos) /*!< Bit mask of APPSET1 field.                       */
  #define CTI_CTIAPPSET_APPSET1_Min (0x0UL)          /*!< Min enumerator value of APPSET1 field.                               */
  #define CTI_CTIAPPSET_APPSET1_Max (0x1UL)          /*!< Max enumerator value of APPSET1 field.                               */
  #define CTI_CTIAPPSET_APPSET1_Inactive (0x0UL)     /*!< Application trigger 1 is inactive.                                   */
  #define CTI_CTIAPPSET_APPSET1_Active (0x1UL)       /*!< Application trigger 1 is active.                                     */
  #define CTI_CTIAPPSET_APPSET1_Activate (0x1UL)     /*!< Generate channel event for channel 1.                                */

/* APPSET2 @Bit 2 : Application trigger event for channel 2. */
  #define CTI_CTIAPPSET_APPSET2_Pos (2UL)            /*!< Position of APPSET2 field.                                           */
  #define CTI_CTIAPPSET_APPSET2_Msk (0x1UL << CTI_CTIAPPSET_APPSET2_Pos) /*!< Bit mask of APPSET2 field.                       */
  #define CTI_CTIAPPSET_APPSET2_Min (0x0UL)          /*!< Min enumerator value of APPSET2 field.                               */
  #define CTI_CTIAPPSET_APPSET2_Max (0x1UL)          /*!< Max enumerator value of APPSET2 field.                               */
  #define CTI_CTIAPPSET_APPSET2_Inactive (0x0UL)     /*!< Application trigger 2 is inactive.                                   */
  #define CTI_CTIAPPSET_APPSET2_Active (0x1UL)       /*!< Application trigger 2 is active.                                     */
  #define CTI_CTIAPPSET_APPSET2_Activate (0x1UL)     /*!< Generate channel event for channel 2.                                */

/* APPSET3 @Bit 3 : Application trigger event for channel 3. */
  #define CTI_CTIAPPSET_APPSET3_Pos (3UL)            /*!< Position of APPSET3 field.                                           */
  #define CTI_CTIAPPSET_APPSET3_Msk (0x1UL << CTI_CTIAPPSET_APPSET3_Pos) /*!< Bit mask of APPSET3 field.                       */
  #define CTI_CTIAPPSET_APPSET3_Min (0x0UL)          /*!< Min enumerator value of APPSET3 field.                               */
  #define CTI_CTIAPPSET_APPSET3_Max (0x1UL)          /*!< Max enumerator value of APPSET3 field.                               */
  #define CTI_CTIAPPSET_APPSET3_Inactive (0x0UL)     /*!< Application trigger 3 is inactive.                                   */
  #define CTI_CTIAPPSET_APPSET3_Active (0x1UL)       /*!< Application trigger 3 is active.                                     */
  #define CTI_CTIAPPSET_APPSET3_Activate (0x1UL)     /*!< Generate channel event for channel 3.                                */


/* CTI_CTIAPPCLEAR: CTI Application Trigger Clear register */
  #define CTI_CTIAPPCLEAR_ResetValue (0x00000000UL)  /*!< Reset value of CTIAPPCLEAR register.                                 */

