NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TRIGINEN1 @Bit 1 : Enables a cross trigger event to channel 1 when a ctitrigin input is activated. */
  #define CTI_CTIINEN_TRIGINEN1_Pos (1UL)            /*!< Position of TRIGINEN1 field.                                         */
  #define CTI_CTIINEN_TRIGINEN1_Msk (0x1UL << CTI_CTIINEN_TRIGINEN1_Pos) /*!< Bit mask of TRIGINEN1 field.                     */
  #define CTI_CTIINEN_TRIGINEN1_Min (0x0UL)          /*!< Min enumerator value of TRIGINEN1 field.                             */
  #define CTI_CTIINEN_TRIGINEN1_Max (0x1UL)          /*!< Max enumerator value of TRIGINEN1 field.                             */
  #define CTI_CTIINEN_TRIGINEN1_Disabled (0x0UL)     /*!< Input trigger n events are ignored by channel 1.                     */
  #define CTI_CTIINEN_TRIGINEN1_Enabled (0x1UL)      /*!< When an event is received on input trigger n (ctitrigin[n]), generate
                                                          an event on channel 1.*/

/* TRIGINEN2 @Bit 2 : Enables a cross trigger event to channel 2 when a ctitrigin input is activated. */
  #define CTI_CTIINEN_TRIGINEN2_Pos (2UL)            /*!< Position of TRIGINEN2 field.                                         */
  #define CTI_CTIINEN_TRIGINEN2_Msk (0x1UL << CTI_CTIINEN_TRIGINEN2_Pos) /*!< Bit mask of TRIGINEN2 field.                     */
  #define CTI_CTIINEN_TRIGINEN2_Min (0x0UL)          /*!< Min enumerator value of TRIGINEN2 field.                             */
  #define CTI_CTIINEN_TRIGINEN2_Max (0x1UL)          /*!< Max enumerator value of TRIGINEN2 field.                             */
  #define CTI_CTIINEN_TRIGINEN2_Disabled (0x0UL)     /*!< Input trigger n events are ignored by channel 2.                     */
  #define CTI_CTIINEN_TRIGINEN2_Enabled (0x1UL)      /*!< When an event is received on input trigger n (ctitrigin[n]), generate
                                                          an event on channel 2.*/

/* TRIGINEN3 @Bit 3 : Enables a cross trigger event to channel 3 when a ctitrigin input is activated. */
  #define CTI_CTIINEN_TRIGINEN3_Pos (3UL)            /*!< Position of TRIGINEN3 field.                                         */
  #define CTI_CTIINEN_TRIGINEN3_Msk (0x1UL << CTI_CTIINEN_TRIGINEN3_Pos) /*!< Bit mask of TRIGINEN3 field.                     */
  #define CTI_CTIINEN_TRIGINEN3_Min (0x0UL)          /*!< Min enumerator value of TRIGINEN3 field.                             */
  #define CTI_CTIINEN_TRIGINEN3_Max (0x1UL)          /*!< Max enumerator value of TRIGINEN3 field.                             */
  #define CTI_CTIINEN_TRIGINEN3_Disabled (0x0UL)     /*!< Input trigger n events are ignored by channel 3.                     */
  #define CTI_CTIINEN_TRIGINEN3_Enabled (0x1UL)      /*!< When an event is received on input trigger n (ctitrigin[n]), generate
                                                          an event on channel 3.*/


/* CTI_CTIOUTEN: CTI Channel to Trigger Enable register */
  #define CTI_CTIOUTEN_MaxCount (8UL)                /*!< Max size of CTIOUTEN[8] array.                                       */
  #define CTI_CTIOUTEN_MaxIndex (7UL)                /*!< Max index of CTIOUTEN[8] array.                                      */
  #define CTI_CTIOUTEN_MinIndex (0UL)                /*!< Min index of CTIOUTEN[8] array.                                      */
  #define CTI_CTIOUTEN_ResetValue (0x00000000UL)     /*!< Reset value of CTIOUTEN[8] register.                                 */

/* TRIGOUTEN0 @Bit 0 : Enables a cross trigger event to ctitrigout when channel 0 is activated. */
  #define CTI_CTIOUTEN_TRIGOUTEN0_Pos (0UL)          /*!< Position of TRIGOUTEN0 field.                                        */
  #define CTI_CTIOUTEN_TRIGOUTEN0_Msk (0x1UL << CTI_CTIOUTEN_TRIGOUTEN0_Pos) /*!< Bit mask of TRIGOUTEN0 field.                */
  #define CTI_CTIOUTEN_TRIGOUTEN0_Min (0x0UL)        /*!< Min enumerator value of TRIGOUTEN0 field.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN0_Max (0x1UL)        /*!< Max enumerator value of TRIGOUTEN0 field.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN0_Disabled (0x0UL)   /*!< Channel 0 is ignored by output trigger n.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN0_Enabled (0x1UL)    /*!< When an event occurs on channel 0, generate an event on output event n
                                                          (ctitrigout[n]).*/

/* TRIGOUTEN1 @Bit 1 : Enables a cross trigger event to ctitrigout when channel 1 is activated. */
  #define CTI_CTIOUTEN_TRIGOUTEN1_Pos (1UL)          /*!< Position of TRIGOUTEN1 field.                                        */
  #define CTI_CTIOUTEN_TRIGOUTEN1_Msk (0x1UL << CTI_CTIOUTEN_TRIGOUTEN1_Pos) /*!< Bit mask of TRIGOUTEN1 field.                */
  #define CTI_CTIOUTEN_TRIGOUTEN1_Min (0x0UL)        /*!< Min enumerator value of TRIGOUTEN1 field.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN1_Max (0x1UL)        /*!< Max enumerator value of TRIGOUTEN1 field.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN1_Disabled (0x0UL)   /*!< Channel 1 is ignored by output trigger n.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN1_Enabled (0x1UL)    /*!< When an event occurs on channel 1, generate an event on output event n
                                                          (ctitrigout[n]).*/

/* TRIGOUTEN2 @Bit 2 : Enables a cross trigger event to ctitrigout when channel 2 is activated. */
  #define CTI_CTIOUTEN_TRIGOUTEN2_Pos (2UL)          /*!< Position of TRIGOUTEN2 field.                                        */
  #define CTI_CTIOUTEN_TRIGOUTEN2_Msk (0x1UL << CTI_CTIOUTEN_TRIGOUTEN2_Pos) /*!< Bit mask of TRIGOUTEN2 field.                */
  #define CTI_CTIOUTEN_TRIGOUTEN2_Min (0x0UL)        /*!< Min enumerator value of TRIGOUTEN2 field.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN2_Max (0x1UL)        /*!< Max enumerator value of TRIGOUTEN2 field.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN2_Disabled (0x0UL)   /*!< Channel 2 is ignored by output trigger n.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN2_Enabled (0x1UL)    /*!< When an event occurs on channel 2, generate an event on output event n
                                                          (ctitrigout[n]).*/

/* TRIGOUTEN3 @Bit 3 : Enables a cross trigger event to ctitrigout when channel 3 is activated. */
  #define CTI_CTIOUTEN_TRIGOUTEN3_Pos (3UL)          /*!< Position of TRIGOUTEN3 field.                                        */
  #define CTI_CTIOUTEN_TRIGOUTEN3_Msk (0x1UL << CTI_CTIOUTEN_TRIGOUTEN3_Pos) /*!< Bit mask of TRIGOUTEN3 field.                */
  #define CTI_CTIOUTEN_TRIGOUTEN3_Min (0x0UL)        /*!< Min enumerator value of TRIGOUTEN3 field.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN3_Max (0x1UL)        /*!< Max enumerator value of TRIGOUTEN3 field.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN3_Disabled (0x0UL)   /*!< Channel 3 is ignored by output trigger n.                            */
  #define CTI_CTIOUTEN_TRIGOUTEN3_Enabled (0x1UL)    /*!< When an event occurs on channel 3, generate an event on output event n
                                                          (ctitrigout[n]).*/


/* CTI_CTITRIGINSTATUS: CTI Trigger In Status register */
  #define CTI_CTITRIGINSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CTITRIGINSTATUS register.                          */

