NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CTICHINSTATUS0 @Bit 0 : Shows the status of the ctitrigin 0 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Pos (0UL) /*!< Position of CTICHINSTATUS0 field.                                    */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS0_Pos) /*!< Bit mask of CTICHINSTATUS0
                                                                            field.*/
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Min (0x0UL) /*!< Min enumerator value of CTICHINSTATUS0 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Max (0x1UL) /*!< Max enumerator value of CTICHINSTATUS0 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Active (0x1UL) /*!< Ctichin 0 is active.                                            */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Inactive (0x0UL) /*!< Ctichin 0 is inactive.                                        */

/* CTICHINSTATUS1 @Bit 1 : Shows the status of the ctitrigin 1 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Pos (1UL) /*!< Position of CTICHINSTATUS1 field.                                    */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS1_Pos) /*!< Bit mask of CTICHINSTATUS1
                                                                            field.*/
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Min (0x0UL) /*!< Min enumerator value of CTICHINSTATUS1 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Max (0x1UL) /*!< Max enumerator value of CTICHINSTATUS1 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Active (0x1UL) /*!< Ctichin 1 is active.                                            */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Inactive (0x0UL) /*!< Ctichin 1 is inactive.                                        */

/* CTICHINSTATUS2 @Bit 2 : Shows the status of the ctitrigin 2 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Pos (2UL) /*!< Position of CTICHINSTATUS2 field.                                    */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS2_Pos) /*!< Bit mask of CTICHINSTATUS2
                                                                            field.*/
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Min (0x0UL) /*!< Min enumerator value of CTICHINSTATUS2 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Max (0x1UL) /*!< Max enumerator value of CTICHINSTATUS2 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Active (0x1UL) /*!< Ctichin 2 is active.                                            */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Inactive (0x0UL) /*!< Ctichin 2 is inactive.                                        */

/* CTICHINSTATUS3 @Bit 3 : Shows the status of the ctitrigin 3 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Pos (3UL) /*!< Position of CTICHINSTATUS3 field.                                    */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS3_Pos) /*!< Bit mask of CTICHINSTATUS3
                                                                            field.*/
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Min (0x0UL) /*!< Min enumerator value of CTICHINSTATUS3 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Max (0x1UL) /*!< Max enumerator value of CTICHINSTATUS3 field.                      */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Active (0x1UL) /*!< Ctichin 3 is active.                                            */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Inactive (0x0UL) /*!< Ctichin 3 is inactive.                                        */


/* CTI_CTIGATE: Enable CTI Channel Gate register */
  #define CTI_CTIGATE_ResetValue (0x0000000FUL)      /*!< Reset value of CTIGATE register.                                     */

/* CTIGATEEN0 @Bit 0 : Enable ctichout0. */
  #define CTI_CTIGATE_CTIGATEEN0_Pos (0UL)           /*!< Position of CTIGATEEN0 field.                                        */
  #define CTI_CTIGATE_CTIGATEEN0_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN0_Pos) /*!< Bit mask of CTIGATEEN0 field.                  */
  #define CTI_CTIGATE_CTIGATEEN0_Min (0x0UL)         /*!< Min enumerator value of CTIGATEEN0 field.                            */
  #define CTI_CTIGATE_CTIGATEEN0_Max (0x1UL)         /*!< Max enumerator value of CTIGATEEN0 field.                            */
  #define CTI_CTIGATE_CTIGATEEN0_Enabled (0x1UL)     /*!< Enable ctichout channel 0 propagation.                               */
  #define CTI_CTIGATE_CTIGATEEN0_Disabled (0x0UL)    /*!< Disable ctichout channel 0 propagation.                              */

/* CTIGATEEN1 @Bit 1 : Enable ctichout1. */
  #define CTI_CTIGATE_CTIGATEEN1_Pos (1UL)           /*!< Position of CTIGATEEN1 field.                                        */
  #define CTI_CTIGATE_CTIGATEEN1_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN1_Pos) /*!< Bit mask of CTIGATEEN1 field.                  */
  #define CTI_CTIGATE_CTIGATEEN1_Min (0x0UL)         /*!< Min enumerator value of CTIGATEEN1 field.                            */
  #define CTI_CTIGATE_CTIGATEEN1_Max (0x1UL)         /*!< Max enumerator value of CTIGATEEN1 field.                            */
  #define CTI_CTIGATE_CTIGATEEN1_Enabled (0x1UL)     /*!< Enable ctichout channel 1 propagation.                               */
  #define CTI_CTIGATE_CTIGATEEN1_Disabled (0x0UL)    /*!< Disable ctichout channel 1 propagation.                              */

/* CTIGATEEN2 @Bit 2 : Enable ctichout2. */
  #define CTI_CTIGATE_CTIGATEEN2_Pos (2UL)           /*!< Position of CTIGATEEN2 field.                                        */
  #define CTI_CTIGATE_CTIGATEEN2_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN2_Pos) /*!< Bit mask of CTIGATEEN2 field.                  */
  #define CTI_CTIGATE_CTIGATEEN2_Min (0x0UL)         /*!< Min enumerator value of CTIGATEEN2 field.                            */
  #define CTI_CTIGATE_CTIGATEEN2_Max (0x1UL)         /*!< Max enumerator value of CTIGATEEN2 field.                            */
  #define CTI_CTIGATE_CTIGATEEN2_Enabled (0x1UL)     /*!< Enable ctichout channel 2 propagation.                               */
  #define CTI_CTIGATE_CTIGATEEN2_Disabled (0x0UL)    /*!< Disable ctichout channel 2 propagation.                              */

/* CTIGATEEN3 @Bit 3 : Enable ctichout3. */
  #define CTI_CTIGATE_CTIGATEEN3_Pos (3UL)           /*!< Position of CTIGATEEN3 field.                                        */
  #define CTI_CTIGATE_CTIGATEEN3_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN3_Pos) /*!< Bit mask of CTIGATEEN3 field.                  */
  #define CTI_CTIGATE_CTIGATEEN3_Min (0x0UL)         /*!< Min enumerator value of CTIGATEEN3 field.                            */
  #define CTI_CTIGATE_CTIGATEEN3_Max (0x1UL)         /*!< Max enumerator value of CTIGATEEN3 field.                            */
  #define CTI_CTIGATE_CTIGATEEN3_Enabled (0x1UL)     /*!< Enable ctichout channel 3 propagation.                               */
  #define CTI_CTIGATE_CTIGATEEN3_Disabled (0x0UL)    /*!< Disable ctichout channel 3 propagation.                              */


/* CTI_DEVARCH: Device Architecture register */
  #define CTI_DEVARCH_ResetValue (0x47701A14UL)      /*!< Reset value of DEVARCH register.                                     */

/* Architecture @Bit 0 : Contains the CTI device architecture. */
  #define CTI_DEVARCH_Architecture_Pos (0UL)         /*!< Position of Architecture field.                                      */
  #define CTI_DEVARCH_Architecture_Msk (0x1UL << CTI_DEVARCH_Architecture_Pos) /*!< Bit mask of Architecture field.            */


/* CTI_DEVID: Device Configuration register */
  #define CTI_DEVID_ResetValue (0x00040800UL)        /*!< Reset value of DEVID register.                                       */

/* EXTMUXNUM @Bits 0..4 : Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using
                          asicctl. The default value of 0b00000 indicates that no multiplexing is present. */

  #define CTI_DEVID_EXTMUXNUM_Pos (0UL)              /*!< Position of EXTMUXNUM field.                                         */
  #define CTI_DEVID_EXTMUXNUM_Msk (0x1FUL << CTI_DEVID_EXTMUXNUM_Pos) /*!< Bit mask of EXTMUXNUM field.                        */

/* NUMTRIG @Bits 8..15 : Number of ECT triggers available. */
  #define CTI_DEVID_NUMTRIG_Pos (8UL)                /*!< Position of NUMTRIG field.                                           */
  #define CTI_DEVID_NUMTRIG_Msk (0xFFUL << CTI_DEVID_NUMTRIG_Pos) /*!< Bit mask of NUMTRIG field.                              */

