NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* READY @Bit 0 : Ready status. */
  #define CTRLAPPERI_INFO_READY_READY_Pos (0UL)      /*!< Position of READY field.                                             */
  #define CTRLAPPERI_INFO_READY_READY_Msk (0x1UL << CTRLAPPERI_INFO_READY_READY_Pos) /*!< Bit mask of READY field.             */
  #define CTRLAPPERI_INFO_READY_READY_Min (0x0UL)    /*!< Min enumerator value of READY field.                                 */
  #define CTRLAPPERI_INFO_READY_READY_Max (0x1UL)    /*!< Max enumerator value of READY field.                                 */
  #define CTRLAPPERI_INFO_READY_READY_Ready (0x0UL)  /*!< Ready                                                                */
  #define CTRLAPPERI_INFO_READY_READY_NotReady (0x1UL) /*!< Not ready                                                          */


/* ==================================================== Struct CTRLAPPERI ==================================================== */
/**
  * @brief Control access port
  */
  typedef struct {                                   /*!< CTRLAPPERI Structure                                                 */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_RXREADY;                   /*!< (@ 0x00000100) RXSTATUS is changed to DataPending                    */
    __IOM uint32_t EVENTS_TXDONE;                    /*!< (@ 0x00000104) TXSTATUS is changed to NoDataPending.                 */
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM NRF_CTRLAPPERI_MAILBOX_Type MAILBOX;       /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[29];
    __IOM NRF_CTRLAPPERI_INFO_Type INFO;             /*!< (@ 0x00000500) (unspecified)                                         */
    __IOM uint32_t BOOTSTATUS;                       /*!< (@ 0x0000050C) Boot status                                           */
  } NRF_CTRLAPPERI_Type;                             /*!< Size = 1296 (0x510)                                                  */

/* CTRLAPPERI_EVENTS_RXREADY: RXSTATUS is changed to DataPending */
  #define CTRLAPPERI_EVENTS_RXREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXREADY register.                     */

/* EVENTS_RXREADY @Bit 0 : RXSTATUS is changed to DataPending */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Pos (0UL) /*!< Position of EVENTS_RXREADY field.                            */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Msk (0x1UL << CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Pos) /*!< Bit mask of
                                                                            EVENTS_RXREADY field.*/
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXREADY field.              */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXREADY field.              */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Generated (0x1UL) /*!< Event generated                                      */


/* CTRLAPPERI_EVENTS_TXDONE: TXSTATUS is changed to NoDataPending. */
  #define CTRLAPPERI_EVENTS_TXDONE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXDONE register.                       */

/* EVENTS_TXDONE @Bit 0 : TXSTATUS is changed to NoDataPending. */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Pos (0UL) /*!< Position of EVENTS_TXDONE field.                               */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Msk (0x1UL << CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_TXDONE field.*/
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXDONE field.                 */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXDONE field.                 */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Generated (0x1UL) /*!< Event generated                                        */


/* CTRLAPPERI_INTEN: Enable or disable interrupt */
  #define CTRLAPPERI_INTEN_ResetValue (0x00000000UL) /*!< Reset value of INTEN register.                                       */

/* RXREADY @Bit 0 : Enable or disable interrupt for event RXREADY */
  #define CTRLAPPERI_INTEN_RXREADY_Pos (0UL)         /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTEN_RXREADY_Msk (0x1UL << CTRLAPPERI_INTEN_RXREADY_Pos) /*!< Bit mask of RXREADY field.                 */
  #define CTRLAPPERI_INTEN_RXREADY_Min (0x0UL)       /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTEN_RXREADY_Max (0x1UL)       /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTEN_RXREADY_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CTRLAPPERI_INTEN_RXREADY_Enabled (0x1UL)   /*!< Enable                                                               */

/* TXDONE @Bit 1 : Enable or disable interrupt for event TXDONE */
  #define CTRLAPPERI_INTEN_TXDONE_Pos (1UL)          /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTEN_TXDONE_Msk (0x1UL << CTRLAPPERI_INTEN_TXDONE_Pos) /*!< Bit mask of TXDONE field.                    */
  #define CTRLAPPERI_INTEN_TXDONE_Min (0x0UL)        /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTEN_TXDONE_Max (0x1UL)        /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTEN_TXDONE_Disabled (0x0UL)   /*!< Disable                                                              */
  #define CTRLAPPERI_INTEN_TXDONE_Enabled (0x1UL)    /*!< Enable                                                               */


/* CTRLAPPERI_INTENSET: Enable interrupt */
  #define CTRLAPPERI_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                 */

