NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RXREADY @Bit 0 : Write '1' to enable interrupt for event RXREADY */
  #define CTRLAPPERI_INTENSET_RXREADY_Pos (0UL)      /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTENSET_RXREADY_Msk (0x1UL << CTRLAPPERI_INTENSET_RXREADY_Pos) /*!< Bit mask of RXREADY field.           */
  #define CTRLAPPERI_INTENSET_RXREADY_Min (0x0UL)    /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENSET_RXREADY_Max (0x1UL)    /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENSET_RXREADY_Set (0x1UL)    /*!< Enable                                                               */
  #define CTRLAPPERI_INTENSET_RXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CTRLAPPERI_INTENSET_RXREADY_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TXDONE @Bit 1 : Write '1' to enable interrupt for event TXDONE */
  #define CTRLAPPERI_INTENSET_TXDONE_Pos (1UL)       /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTENSET_TXDONE_Msk (0x1UL << CTRLAPPERI_INTENSET_TXDONE_Pos) /*!< Bit mask of TXDONE field.              */
  #define CTRLAPPERI_INTENSET_TXDONE_Min (0x0UL)     /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENSET_TXDONE_Max (0x1UL)     /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENSET_TXDONE_Set (0x1UL)     /*!< Enable                                                               */
  #define CTRLAPPERI_INTENSET_TXDONE_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define CTRLAPPERI_INTENSET_TXDONE_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* CTRLAPPERI_INTENCLR: Disable interrupt */
  #define CTRLAPPERI_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                 */

/* RXREADY @Bit 0 : Write '1' to disable interrupt for event RXREADY */
  #define CTRLAPPERI_INTENCLR_RXREADY_Pos (0UL)      /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTENCLR_RXREADY_Msk (0x1UL << CTRLAPPERI_INTENCLR_RXREADY_Pos) /*!< Bit mask of RXREADY field.           */
  #define CTRLAPPERI_INTENCLR_RXREADY_Min (0x0UL)    /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENCLR_RXREADY_Max (0x1UL)    /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENCLR_RXREADY_Clear (0x1UL)  /*!< Disable                                                              */
  #define CTRLAPPERI_INTENCLR_RXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CTRLAPPERI_INTENCLR_RXREADY_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TXDONE @Bit 1 : Write '1' to disable interrupt for event TXDONE */
  #define CTRLAPPERI_INTENCLR_TXDONE_Pos (1UL)       /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTENCLR_TXDONE_Msk (0x1UL << CTRLAPPERI_INTENCLR_TXDONE_Pos) /*!< Bit mask of TXDONE field.              */
  #define CTRLAPPERI_INTENCLR_TXDONE_Min (0x0UL)     /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENCLR_TXDONE_Max (0x1UL)     /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENCLR_TXDONE_Clear (0x1UL)   /*!< Disable                                                              */
  #define CTRLAPPERI_INTENCLR_TXDONE_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define CTRLAPPERI_INTENCLR_TXDONE_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* CTRLAPPERI_INTPEND: Pending interrupts */
  #define CTRLAPPERI_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                   */

/* RXREADY @Bit 0 : Read pending status of interrupt for event RXREADY */
  #define CTRLAPPERI_INTPEND_RXREADY_Pos (0UL)       /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTPEND_RXREADY_Msk (0x1UL << CTRLAPPERI_INTPEND_RXREADY_Pos) /*!< Bit mask of RXREADY field.             */
  #define CTRLAPPERI_INTPEND_RXREADY_Min (0x0UL)     /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTPEND_RXREADY_Max (0x1UL)     /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTPEND_RXREADY_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define CTRLAPPERI_INTPEND_RXREADY_Pending (0x1UL) /*!< Read: Pending                                                        */

/* TXDONE @Bit 1 : Read pending status of interrupt for event TXDONE */
  #define CTRLAPPERI_INTPEND_TXDONE_Pos (1UL)        /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTPEND_TXDONE_Msk (0x1UL << CTRLAPPERI_INTPEND_TXDONE_Pos) /*!< Bit mask of TXDONE field.                */
  #define CTRLAPPERI_INTPEND_TXDONE_Min (0x0UL)      /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTPEND_TXDONE_Max (0x1UL)      /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTPEND_TXDONE_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define CTRLAPPERI_INTPEND_TXDONE_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* CTRLAPPERI_BOOTSTATUS: Boot status */
  #define CTRLAPPERI_BOOTSTATUS_ResetValue (0x00000000UL) /*!< Reset value of BOOTSTATUS register.                             */

