NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RX1ED @Bit 20 : RX0 Element Dequeued */
  #define DMU_DMUIR_RX1ED_Pos (20UL)                 /*!< Position of RX1ED field.                                             */
  #define DMU_DMUIR_RX1ED_Msk (0x1UL << DMU_DMUIR_RX1ED_Pos) /*!< Bit mask of RX1ED field.                                     */
  #define DMU_DMUIR_RX1ED_Min (0x0UL)                /*!< Min enumerator value of RX1ED field.                                 */
  #define DMU_DMUIR_RX1ED_Max (0x1UL)                /*!< Max enumerator value of RX1ED field.                                 */
  #define DMU_DMUIR_RX1ED_Clear (0x1UL)              /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1ED_NotGenerated (0x0UL)       /*!< No Rx message dequeued                                               */
  #define DMU_DMUIR_RX1ED_Generated (0x1UL)          /*!< Rx message successfully dequeued                                     */

/* RX1EIO @Bit 21 : RX1 Element Illegal Overwrite by timestamp */
  #define DMU_DMUIR_RX1EIO_Pos (21UL)                /*!< Position of RX1EIO field.                                            */
  #define DMU_DMUIR_RX1EIO_Msk (0x1UL << DMU_DMUIR_RX1EIO_Pos) /*!< Bit mask of RX1EIO field.                                  */
  #define DMU_DMUIR_RX1EIO_Min (0x0UL)               /*!< Min enumerator value of RX1EIO field.                                */
  #define DMU_DMUIR_RX1EIO_Max (0x1UL)               /*!< Max enumerator value of RX1EIO field.                                */
  #define DMU_DMUIR_RX1EIO_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_RX1EIO_NotGenerated (0x0UL)      /*!< No illegal overwrite detected                                        */
  #define DMU_DMUIR_RX1EIO_Generated (0x1UL)         /*!< DMU has internally overwritten the last element word of a SYNC
                                                          message*/

/* TXEENSA @Bit 24 : TX Event Element Not Start Address */
  #define DMU_DMUIR_TXEENSA_Pos (24UL)               /*!< Position of TXEENSA field.                                           */
  #define DMU_DMUIR_TXEENSA_Msk (0x1UL << DMU_DMUIR_TXEENSA_Pos) /*!< Bit mask of TXEENSA field.                               */
  #define DMU_DMUIR_TXEENSA_Min (0x0UL)              /*!< Min enumerator value of TXEENSA field.                               */
  #define DMU_DMUIR_TXEENSA_Max (0x1UL)              /*!< Max enumerator value of TXEENSA field.                               */
  #define DMU_DMUIR_TXEENSA_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEENSA_NotGenerated (0x0UL)     /*!< No illegal read access                                               */
  #define DMU_DMUIR_TXEENSA_Generated (0x1UL)        /*!< Read from TX Event Element begins without using start address,
                                                          exception recovery started.*/

/* TXEEID @Bit 25 : TX Event Element Illegal Dequeueing */
  #define DMU_DMUIR_TXEEID_Pos (25UL)                /*!< Position of TXEEID field.                                            */
  #define DMU_DMUIR_TXEEID_Msk (0x1UL << DMU_DMUIR_TXEEID_Pos) /*!< Bit mask of TXEEID field.                                  */
  #define DMU_DMUIR_TXEEID_Min (0x0UL)               /*!< Min enumerator value of TXEEID field.                                */
  #define DMU_DMUIR_TXEEID_Max (0x1UL)               /*!< Max enumerator value of TXEEID field.                                */
  #define DMU_DMUIR_TXEEID_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEEID_NotGenerated (0x0UL)      /*!< No illegal dequeueing                                                */
  #define DMU_DMUIR_TXEEID_Generated (0x1UL)         /*!< Start of dequeueing without request detected, exception recovery
                                                          started.*/

/* TXEEIAS @Bit 26 : TX Event Element Illegal Access Sequence */
  #define DMU_DMUIR_TXEEIAS_Pos (26UL)               /*!< Position of TXEEIAS field.                                           */
  #define DMU_DMUIR_TXEEIAS_Msk (0x1UL << DMU_DMUIR_TXEEIAS_Pos) /*!< Bit mask of TXEEIAS field.                               */
  #define DMU_DMUIR_TXEEIAS_Min (0x0UL)              /*!< Min enumerator value of TXEEIAS field.                               */
  #define DMU_DMUIR_TXEEIAS_Max (0x1UL)              /*!< Max enumerator value of TXEEIAS field.                               */
  #define DMU_DMUIR_TXEEIAS_Clear (0x1UL)            /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEEIAS_NotGenerated (0x0UL)     /*!< No illegal addressing sequence detected                              */
  #define DMU_DMUIR_TXEEIAS_Generated (0x1UL)        /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* TXEEIW @Bit 27 : TX Event Element Illegal Write */
  #define DMU_DMUIR_TXEEIW_Pos (27UL)                /*!< Position of TXEEIW field.                                            */
  #define DMU_DMUIR_TXEEIW_Msk (0x1UL << DMU_DMUIR_TXEEIW_Pos) /*!< Bit mask of TXEEIW field.                                  */
  #define DMU_DMUIR_TXEEIW_Min (0x0UL)               /*!< Min enumerator value of TXEEIW field.                                */
  #define DMU_DMUIR_TXEEIW_Max (0x1UL)               /*!< Max enumerator value of TXEEIW field.                                */
  #define DMU_DMUIR_TXEEIW_Clear (0x1UL)             /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEEIW_NotGenerated (0x0UL)      /*!< No write access detected                                             */
  #define DMU_DMUIR_TXEEIW_Generated (0x1UL)         /*!< Illegal write access to DMU TX Event Element detected, exception
                                                          recovery started.*/

/* TXEED @Bit 28 : TX Event Element Dequeued */
  #define DMU_DMUIR_TXEED_Pos (28UL)                 /*!< Position of TXEED field.                                             */
  #define DMU_DMUIR_TXEED_Msk (0x1UL << DMU_DMUIR_TXEED_Pos) /*!< Bit mask of TXEED field.                                     */
  #define DMU_DMUIR_TXEED_Min (0x0UL)                /*!< Min enumerator value of TXEED field.                                 */
  #define DMU_DMUIR_TXEED_Max (0x1UL)                /*!< Max enumerator value of TXEED field.                                 */
  #define DMU_DMUIR_TXEED_Clear (0x1UL)              /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_TXEED_NotGenerated (0x0UL)       /*!< No TX Event Element dequeued                                         */
  #define DMU_DMUIR_TXEED_Generated (0x1UL)          /*!< TX Event Element successfully dequeued                               */

/* DT @Bit 29 : Debug Trigger */
  #define DMU_DMUIR_DT_Pos (29UL)                    /*!< Position of DT field.                                                */
  #define DMU_DMUIR_DT_Msk (0x1UL << DMU_DMUIR_DT_Pos) /*!< Bit mask of DT field.                                              */
  #define DMU_DMUIR_DT_Min (0x0UL)                   /*!< Min enumerator value of DT field.                                    */
  #define DMU_DMUIR_DT_Max (0x1UL)                   /*!< Max enumerator value of DT field.                                    */
  #define DMU_DMUIR_DT_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_DT_NotGenerated (0x0UL)          /*!< Debug point not reached                                              */
  #define DMU_DMUIR_DT_Generated (0x1UL)             /*!< Debug point reached                                                  */

/* IAC @Bit 30 : Illegal Access while in Configuration mode */
  #define DMU_DMUIR_IAC_Pos (30UL)                   /*!< Position of IAC field.                                               */
  #define DMU_DMUIR_IAC_Msk (0x1UL << DMU_DMUIR_IAC_Pos) /*!< Bit mask of IAC field.                                           */
  #define DMU_DMUIR_IAC_Min (0x0UL)                  /*!< Min enumerator value of IAC field.                                   */
  #define DMU_DMUIR_IAC_Max (0x1UL)                  /*!< Max enumerator value of IAC field.                                   */
  #define DMU_DMUIR_IAC_Clear (0x1UL)                /*!< Write '1' to clear interrupt flag                                    */
  #define DMU_DMUIR_IAC_NotGenerated (0x0UL)         /*!< No Illegal Access while CCE mode                                     */
  #define DMU_DMUIR_IAC_Generated (0x1UL)            /*!< Illegal Access while CCE mode                                        */


/* DMU_DMUIE: DMU Interrupt Enable */
  #define DMU_DMUIE_ResetValue (0x00000000UL)        /*!< Reset value of DMUIE register.                                       */

