NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CH19 @Bit 19 : Enable or disable channel 19 */
  #define DPPIC_CHEN_CH19_Pos (19UL)                 /*!< Position of CH19 field.                                              */
  #define DPPIC_CHEN_CH19_Msk (0x1UL << DPPIC_CHEN_CH19_Pos) /*!< Bit mask of CH19 field.                                      */
  #define DPPIC_CHEN_CH19_Min (0x0UL)                /*!< Min enumerator value of CH19 field.                                  */
  #define DPPIC_CHEN_CH19_Max (0x1UL)                /*!< Max enumerator value of CH19 field.                                  */
  #define DPPIC_CHEN_CH19_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH19_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH20 @Bit 20 : Enable or disable channel 20 */
  #define DPPIC_CHEN_CH20_Pos (20UL)                 /*!< Position of CH20 field.                                              */
  #define DPPIC_CHEN_CH20_Msk (0x1UL << DPPIC_CHEN_CH20_Pos) /*!< Bit mask of CH20 field.                                      */
  #define DPPIC_CHEN_CH20_Min (0x0UL)                /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHEN_CH20_Max (0x1UL)                /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHEN_CH20_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH20_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH21 @Bit 21 : Enable or disable channel 21 */
  #define DPPIC_CHEN_CH21_Pos (21UL)                 /*!< Position of CH21 field.                                              */
  #define DPPIC_CHEN_CH21_Msk (0x1UL << DPPIC_CHEN_CH21_Pos) /*!< Bit mask of CH21 field.                                      */
  #define DPPIC_CHEN_CH21_Min (0x0UL)                /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHEN_CH21_Max (0x1UL)                /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHEN_CH21_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH21_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH22 @Bit 22 : Enable or disable channel 22 */
  #define DPPIC_CHEN_CH22_Pos (22UL)                 /*!< Position of CH22 field.                                              */
  #define DPPIC_CHEN_CH22_Msk (0x1UL << DPPIC_CHEN_CH22_Pos) /*!< Bit mask of CH22 field.                                      */
  #define DPPIC_CHEN_CH22_Min (0x0UL)                /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHEN_CH22_Max (0x1UL)                /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHEN_CH22_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH22_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH23 @Bit 23 : Enable or disable channel 23 */
  #define DPPIC_CHEN_CH23_Pos (23UL)                 /*!< Position of CH23 field.                                              */
  #define DPPIC_CHEN_CH23_Msk (0x1UL << DPPIC_CHEN_CH23_Pos) /*!< Bit mask of CH23 field.                                      */
  #define DPPIC_CHEN_CH23_Min (0x0UL)                /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHEN_CH23_Max (0x1UL)                /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHEN_CH23_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH23_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH24 @Bit 24 : Enable or disable channel 24 */
  #define DPPIC_CHEN_CH24_Pos (24UL)                 /*!< Position of CH24 field.                                              */
  #define DPPIC_CHEN_CH24_Msk (0x1UL << DPPIC_CHEN_CH24_Pos) /*!< Bit mask of CH24 field.                                      */
  #define DPPIC_CHEN_CH24_Min (0x0UL)                /*!< Min enumerator value of CH24 field.                                  */
  #define DPPIC_CHEN_CH24_Max (0x1UL)                /*!< Max enumerator value of CH24 field.                                  */
  #define DPPIC_CHEN_CH24_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH24_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH25 @Bit 25 : Enable or disable channel 25 */
  #define DPPIC_CHEN_CH25_Pos (25UL)                 /*!< Position of CH25 field.                                              */
  #define DPPIC_CHEN_CH25_Msk (0x1UL << DPPIC_CHEN_CH25_Pos) /*!< Bit mask of CH25 field.                                      */
  #define DPPIC_CHEN_CH25_Min (0x0UL)                /*!< Min enumerator value of CH25 field.                                  */
  #define DPPIC_CHEN_CH25_Max (0x1UL)                /*!< Max enumerator value of CH25 field.                                  */
  #define DPPIC_CHEN_CH25_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH25_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH26 @Bit 26 : Enable or disable channel 26 */
  #define DPPIC_CHEN_CH26_Pos (26UL)                 /*!< Position of CH26 field.                                              */
  #define DPPIC_CHEN_CH26_Msk (0x1UL << DPPIC_CHEN_CH26_Pos) /*!< Bit mask of CH26 field.                                      */
  #define DPPIC_CHEN_CH26_Min (0x0UL)                /*!< Min enumerator value of CH26 field.                                  */
  #define DPPIC_CHEN_CH26_Max (0x1UL)                /*!< Max enumerator value of CH26 field.                                  */
  #define DPPIC_CHEN_CH26_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH26_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH27 @Bit 27 : Enable or disable channel 27 */
  #define DPPIC_CHEN_CH27_Pos (27UL)                 /*!< Position of CH27 field.                                              */
  #define DPPIC_CHEN_CH27_Msk (0x1UL << DPPIC_CHEN_CH27_Pos) /*!< Bit mask of CH27 field.                                      */
  #define DPPIC_CHEN_CH27_Min (0x0UL)                /*!< Min enumerator value of CH27 field.                                  */
  #define DPPIC_CHEN_CH27_Max (0x1UL)                /*!< Max enumerator value of CH27 field.                                  */
  #define DPPIC_CHEN_CH27_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH27_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH28 @Bit 28 : Enable or disable channel 28 */
  #define DPPIC_CHEN_CH28_Pos (28UL)                 /*!< Position of CH28 field.                                              */
  #define DPPIC_CHEN_CH28_Msk (0x1UL << DPPIC_CHEN_CH28_Pos) /*!< Bit mask of CH28 field.                                      */
  #define DPPIC_CHEN_CH28_Min (0x0UL)                /*!< Min enumerator value of CH28 field.                                  */
  #define DPPIC_CHEN_CH28_Max (0x1UL)                /*!< Max enumerator value of CH28 field.                                  */
  #define DPPIC_CHEN_CH28_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH28_Enabled (0x1UL)            /*!< Enable channel                                                       */

