NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CH20 @Bit 20 : Channel 20 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH20_Pos (20UL)              /*!< Position of CH20 field.                                              */
  #define DPPIC_CHENSET_CH20_Msk (0x1UL << DPPIC_CHENSET_CH20_Pos) /*!< Bit mask of CH20 field.                                */
  #define DPPIC_CHENSET_CH20_Min (0x0UL)             /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHENSET_CH20_Max (0x1UL)             /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHENSET_CH20_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH20_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH20_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH21 @Bit 21 : Channel 21 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH21_Pos (21UL)              /*!< Position of CH21 field.                                              */
  #define DPPIC_CHENSET_CH21_Msk (0x1UL << DPPIC_CHENSET_CH21_Pos) /*!< Bit mask of CH21 field.                                */
  #define DPPIC_CHENSET_CH21_Min (0x0UL)             /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHENSET_CH21_Max (0x1UL)             /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHENSET_CH21_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH21_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH21_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH22 @Bit 22 : Channel 22 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH22_Pos (22UL)              /*!< Position of CH22 field.                                              */
  #define DPPIC_CHENSET_CH22_Msk (0x1UL << DPPIC_CHENSET_CH22_Pos) /*!< Bit mask of CH22 field.                                */
  #define DPPIC_CHENSET_CH22_Min (0x0UL)             /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHENSET_CH22_Max (0x1UL)             /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHENSET_CH22_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH22_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH22_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH23 @Bit 23 : Channel 23 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH23_Pos (23UL)              /*!< Position of CH23 field.                                              */
  #define DPPIC_CHENSET_CH23_Msk (0x1UL << DPPIC_CHENSET_CH23_Pos) /*!< Bit mask of CH23 field.                                */
  #define DPPIC_CHENSET_CH23_Min (0x0UL)             /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHENSET_CH23_Max (0x1UL)             /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHENSET_CH23_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH23_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH23_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH24 @Bit 24 : Channel 24 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH24_Pos (24UL)              /*!< Position of CH24 field.                                              */
  #define DPPIC_CHENSET_CH24_Msk (0x1UL << DPPIC_CHENSET_CH24_Pos) /*!< Bit mask of CH24 field.                                */
  #define DPPIC_CHENSET_CH24_Min (0x0UL)             /*!< Min enumerator value of CH24 field.                                  */
  #define DPPIC_CHENSET_CH24_Max (0x1UL)             /*!< Max enumerator value of CH24 field.                                  */
  #define DPPIC_CHENSET_CH24_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH24_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH24_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH25 @Bit 25 : Channel 25 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH25_Pos (25UL)              /*!< Position of CH25 field.                                              */
  #define DPPIC_CHENSET_CH25_Msk (0x1UL << DPPIC_CHENSET_CH25_Pos) /*!< Bit mask of CH25 field.                                */
  #define DPPIC_CHENSET_CH25_Min (0x0UL)             /*!< Min enumerator value of CH25 field.                                  */
  #define DPPIC_CHENSET_CH25_Max (0x1UL)             /*!< Max enumerator value of CH25 field.                                  */
  #define DPPIC_CHENSET_CH25_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH25_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH25_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH26 @Bit 26 : Channel 26 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH26_Pos (26UL)              /*!< Position of CH26 field.                                              */
  #define DPPIC_CHENSET_CH26_Msk (0x1UL << DPPIC_CHENSET_CH26_Pos) /*!< Bit mask of CH26 field.                                */
  #define DPPIC_CHENSET_CH26_Min (0x0UL)             /*!< Min enumerator value of CH26 field.                                  */
  #define DPPIC_CHENSET_CH26_Max (0x1UL)             /*!< Max enumerator value of CH26 field.                                  */
  #define DPPIC_CHENSET_CH26_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH26_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH26_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH27 @Bit 27 : Channel 27 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH27_Pos (27UL)              /*!< Position of CH27 field.                                              */
  #define DPPIC_CHENSET_CH27_Msk (0x1UL << DPPIC_CHENSET_CH27_Pos) /*!< Bit mask of CH27 field.                                */
  #define DPPIC_CHENSET_CH27_Min (0x0UL)             /*!< Min enumerator value of CH27 field.                                  */
  #define DPPIC_CHENSET_CH27_Max (0x1UL)             /*!< Max enumerator value of CH27 field.                                  */
  #define DPPIC_CHENSET_CH27_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH27_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH27_Set (0x1UL)             /*!< Write: Enable channel                                                */

