NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CH18 @Bit 18 : Channel 18 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH18_Pos (18UL)              /*!< Position of CH18 field.                                              */
  #define DPPIC_CHENCLR_CH18_Msk (0x1UL << DPPIC_CHENCLR_CH18_Pos) /*!< Bit mask of CH18 field.                                */
  #define DPPIC_CHENCLR_CH18_Min (0x0UL)             /*!< Min enumerator value of CH18 field.                                  */
  #define DPPIC_CHENCLR_CH18_Max (0x1UL)             /*!< Max enumerator value of CH18 field.                                  */
  #define DPPIC_CHENCLR_CH18_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH18_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH18_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH19 @Bit 19 : Channel 19 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH19_Pos (19UL)              /*!< Position of CH19 field.                                              */
  #define DPPIC_CHENCLR_CH19_Msk (0x1UL << DPPIC_CHENCLR_CH19_Pos) /*!< Bit mask of CH19 field.                                */
  #define DPPIC_CHENCLR_CH19_Min (0x0UL)             /*!< Min enumerator value of CH19 field.                                  */
  #define DPPIC_CHENCLR_CH19_Max (0x1UL)             /*!< Max enumerator value of CH19 field.                                  */
  #define DPPIC_CHENCLR_CH19_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH19_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH19_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH20 @Bit 20 : Channel 20 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH20_Pos (20UL)              /*!< Position of CH20 field.                                              */
  #define DPPIC_CHENCLR_CH20_Msk (0x1UL << DPPIC_CHENCLR_CH20_Pos) /*!< Bit mask of CH20 field.                                */
  #define DPPIC_CHENCLR_CH20_Min (0x0UL)             /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHENCLR_CH20_Max (0x1UL)             /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHENCLR_CH20_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH20_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH20_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH21 @Bit 21 : Channel 21 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH21_Pos (21UL)              /*!< Position of CH21 field.                                              */
  #define DPPIC_CHENCLR_CH21_Msk (0x1UL << DPPIC_CHENCLR_CH21_Pos) /*!< Bit mask of CH21 field.                                */
  #define DPPIC_CHENCLR_CH21_Min (0x0UL)             /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHENCLR_CH21_Max (0x1UL)             /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHENCLR_CH21_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH21_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH21_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH22 @Bit 22 : Channel 22 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH22_Pos (22UL)              /*!< Position of CH22 field.                                              */
  #define DPPIC_CHENCLR_CH22_Msk (0x1UL << DPPIC_CHENCLR_CH22_Pos) /*!< Bit mask of CH22 field.                                */
  #define DPPIC_CHENCLR_CH22_Min (0x0UL)             /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHENCLR_CH22_Max (0x1UL)             /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHENCLR_CH22_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH22_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH22_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH23 @Bit 23 : Channel 23 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH23_Pos (23UL)              /*!< Position of CH23 field.                                              */
  #define DPPIC_CHENCLR_CH23_Msk (0x1UL << DPPIC_CHENCLR_CH23_Pos) /*!< Bit mask of CH23 field.                                */
  #define DPPIC_CHENCLR_CH23_Min (0x0UL)             /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHENCLR_CH23_Max (0x1UL)             /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHENCLR_CH23_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH23_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH23_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH24 @Bit 24 : Channel 24 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH24_Pos (24UL)              /*!< Position of CH24 field.                                              */
  #define DPPIC_CHENCLR_CH24_Msk (0x1UL << DPPIC_CHENCLR_CH24_Pos) /*!< Bit mask of CH24 field.                                */
  #define DPPIC_CHENCLR_CH24_Min (0x0UL)             /*!< Min enumerator value of CH24 field.                                  */
  #define DPPIC_CHENCLR_CH24_Max (0x1UL)             /*!< Max enumerator value of CH24 field.                                  */
  #define DPPIC_CHENCLR_CH24_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH24_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH24_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH25 @Bit 25 : Channel 25 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH25_Pos (25UL)              /*!< Position of CH25 field.                                              */
  #define DPPIC_CHENCLR_CH25_Msk (0x1UL << DPPIC_CHENCLR_CH25_Pos) /*!< Bit mask of CH25 field.                                */
  #define DPPIC_CHENCLR_CH25_Min (0x0UL)             /*!< Min enumerator value of CH25 field.                                  */
  #define DPPIC_CHENCLR_CH25_Max (0x1UL)             /*!< Max enumerator value of CH25 field.                                  */
  #define DPPIC_CHENCLR_CH25_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH25_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH25_Clear (0x1UL)           /*!< Write: Disable channel                                               */

