NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CH26 @Bit 26 : Channel 26 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH26_Pos (26UL)              /*!< Position of CH26 field.                                              */
  #define DPPIC_CHENCLR_CH26_Msk (0x1UL << DPPIC_CHENCLR_CH26_Pos) /*!< Bit mask of CH26 field.                                */
  #define DPPIC_CHENCLR_CH26_Min (0x0UL)             /*!< Min enumerator value of CH26 field.                                  */
  #define DPPIC_CHENCLR_CH26_Max (0x1UL)             /*!< Max enumerator value of CH26 field.                                  */
  #define DPPIC_CHENCLR_CH26_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH26_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH26_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH27 @Bit 27 : Channel 27 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH27_Pos (27UL)              /*!< Position of CH27 field.                                              */
  #define DPPIC_CHENCLR_CH27_Msk (0x1UL << DPPIC_CHENCLR_CH27_Pos) /*!< Bit mask of CH27 field.                                */
  #define DPPIC_CHENCLR_CH27_Min (0x0UL)             /*!< Min enumerator value of CH27 field.                                  */
  #define DPPIC_CHENCLR_CH27_Max (0x1UL)             /*!< Max enumerator value of CH27 field.                                  */
  #define DPPIC_CHENCLR_CH27_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH27_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH27_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH28 @Bit 28 : Channel 28 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH28_Pos (28UL)              /*!< Position of CH28 field.                                              */
  #define DPPIC_CHENCLR_CH28_Msk (0x1UL << DPPIC_CHENCLR_CH28_Pos) /*!< Bit mask of CH28 field.                                */
  #define DPPIC_CHENCLR_CH28_Min (0x0UL)             /*!< Min enumerator value of CH28 field.                                  */
  #define DPPIC_CHENCLR_CH28_Max (0x1UL)             /*!< Max enumerator value of CH28 field.                                  */
  #define DPPIC_CHENCLR_CH28_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH28_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH28_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH29 @Bit 29 : Channel 29 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH29_Pos (29UL)              /*!< Position of CH29 field.                                              */
  #define DPPIC_CHENCLR_CH29_Msk (0x1UL << DPPIC_CHENCLR_CH29_Pos) /*!< Bit mask of CH29 field.                                */
  #define DPPIC_CHENCLR_CH29_Min (0x0UL)             /*!< Min enumerator value of CH29 field.                                  */
  #define DPPIC_CHENCLR_CH29_Max (0x1UL)             /*!< Max enumerator value of CH29 field.                                  */
  #define DPPIC_CHENCLR_CH29_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH29_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH29_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH30 @Bit 30 : Channel 30 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH30_Pos (30UL)              /*!< Position of CH30 field.                                              */
  #define DPPIC_CHENCLR_CH30_Msk (0x1UL << DPPIC_CHENCLR_CH30_Pos) /*!< Bit mask of CH30 field.                                */
  #define DPPIC_CHENCLR_CH30_Min (0x0UL)             /*!< Min enumerator value of CH30 field.                                  */
  #define DPPIC_CHENCLR_CH30_Max (0x1UL)             /*!< Max enumerator value of CH30 field.                                  */
  #define DPPIC_CHENCLR_CH30_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH30_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH30_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH31 @Bit 31 : Channel 31 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH31_Pos (31UL)              /*!< Position of CH31 field.                                              */
  #define DPPIC_CHENCLR_CH31_Msk (0x1UL << DPPIC_CHENCLR_CH31_Pos) /*!< Bit mask of CH31 field.                                */
  #define DPPIC_CHENCLR_CH31_Min (0x0UL)             /*!< Min enumerator value of CH31 field.                                  */
  #define DPPIC_CHENCLR_CH31_Max (0x1UL)             /*!< Max enumerator value of CH31 field.                                  */
  #define DPPIC_CHENCLR_CH31_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH31_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH31_Clear (0x1UL)           /*!< Write: Disable channel                                               */


/* DPPIC_CHG: Channel group n Note: Writes to this register are ignored if either SUBSCRIBE_CHG[n].EN or SUBSCRIBE_CHG[n].DIS is
               enabled */

  #define DPPIC_CHG_MaxCount (4UL)                   /*!< Max size of CHG[4] array.                                            */
  #define DPPIC_CHG_MaxIndex (3UL)                   /*!< Max index of CHG[4] array.                                           */
  #define DPPIC_CHG_MinIndex (0UL)                   /*!< Min index of CHG[4] array.                                           */
  #define DPPIC_CHG_ResetValue (0x00000000UL)        /*!< Reset value of CHG[4] register.                                      */

/* CH0 @Bit 0 : Include or exclude channel 0 */
  #define DPPIC_CHG_CH0_Pos (0UL)                    /*!< Position of CH0 field.                                               */
  #define DPPIC_CHG_CH0_Msk (0x1UL << DPPIC_CHG_CH0_Pos) /*!< Bit mask of CH0 field.                                           */
  #define DPPIC_CHG_CH0_Min (0x0UL)                  /*!< Min enumerator value of CH0 field.                                   */
  #define DPPIC_CHG_CH0_Max (0x1UL)                  /*!< Max enumerator value of CH0 field.                                   */
  #define DPPIC_CHG_CH0_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH0_Included (0x1UL)             /*!< Include                                                              */

/* CH1 @Bit 1 : Include or exclude channel 1 */
  #define DPPIC_CHG_CH1_Pos (1UL)                    /*!< Position of CH1 field.                                               */
  #define DPPIC_CHG_CH1_Msk (0x1UL << DPPIC_CHG_CH1_Pos) /*!< Bit mask of CH1 field.                                           */
  #define DPPIC_CHG_CH1_Min (0x0UL)                  /*!< Min enumerator value of CH1 field.                                   */
  #define DPPIC_CHG_CH1_Max (0x1UL)                  /*!< Max enumerator value of CH1 field.                                   */
  #define DPPIC_CHG_CH1_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH1_Included (0x1UL)             /*!< Include                                                              */

/* CH2 @Bit 2 : Include or exclude channel 2 */
  #define DPPIC_CHG_CH2_Pos (2UL)                    /*!< Position of CH2 field.                                               */
  #define DPPIC_CHG_CH2_Msk (0x1UL << DPPIC_CHG_CH2_Pos) /*!< Bit mask of CH2 field.                                           */
  #define DPPIC_CHG_CH2_Min (0x0UL)                  /*!< Min enumerator value of CH2 field.                                   */
  #define DPPIC_CHG_CH2_Max (0x1UL)                  /*!< Max enumerator value of CH2 field.                                   */
  #define DPPIC_CHG_CH2_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH2_Included (0x1UL)             /*!< Include                                                              */

/* CH3 @Bit 3 : Include or exclude channel 3 */
  #define DPPIC_CHG_CH3_Pos (3UL)                    /*!< Position of CH3 field.                                               */
  #define DPPIC_CHG_CH3_Msk (0x1UL << DPPIC_CHG_CH3_Pos) /*!< Bit mask of CH3 field.                                           */
  #define DPPIC_CHG_CH3_Min (0x0UL)                  /*!< Min enumerator value of CH3 field.                                   */
  #define DPPIC_CHG_CH3_Max (0x1UL)                  /*!< Max enumerator value of CH3 field.                                   */
  #define DPPIC_CHG_CH3_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH3_Included (0x1UL)             /*!< Include                                                              */

