NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CH20 @Bit 20 : Include or exclude channel 20 */
  #define DPPIC_CHG_CH20_Pos (20UL)                  /*!< Position of CH20 field.                                              */
  #define DPPIC_CHG_CH20_Msk (0x1UL << DPPIC_CHG_CH20_Pos) /*!< Bit mask of CH20 field.                                        */
  #define DPPIC_CHG_CH20_Min (0x0UL)                 /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHG_CH20_Max (0x1UL)                 /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHG_CH20_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH20_Included (0x1UL)            /*!< Include                                                              */

/* CH21 @Bit 21 : Include or exclude channel 21 */
  #define DPPIC_CHG_CH21_Pos (21UL)                  /*!< Position of CH21 field.                                              */
  #define DPPIC_CHG_CH21_Msk (0x1UL << DPPIC_CHG_CH21_Pos) /*!< Bit mask of CH21 field.                                        */
  #define DPPIC_CHG_CH21_Min (0x0UL)                 /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHG_CH21_Max (0x1UL)                 /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHG_CH21_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH21_Included (0x1UL)            /*!< Include                                                              */

/* CH22 @Bit 22 : Include or exclude channel 22 */
  #define DPPIC_CHG_CH22_Pos (22UL)                  /*!< Position of CH22 field.                                              */
  #define DPPIC_CHG_CH22_Msk (0x1UL << DPPIC_CHG_CH22_Pos) /*!< Bit mask of CH22 field.                                        */
  #define DPPIC_CHG_CH22_Min (0x0UL)                 /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHG_CH22_Max (0x1UL)                 /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHG_CH22_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH22_Included (0x1UL)            /*!< Include                                                              */

/* CH23 @Bit 23 : Include or exclude channel 23 */
  #define DPPIC_CHG_CH23_Pos (23UL)                  /*!< Position of CH23 field.                                              */
  #define DPPIC_CHG_CH23_Msk (0x1UL << DPPIC_CHG_CH23_Pos) /*!< Bit mask of CH23 field.                                        */
  #define DPPIC_CHG_CH23_Min (0x0UL)                 /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHG_CH23_Max (0x1UL)                 /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHG_CH23_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH23_Included (0x1UL)            /*!< Include                                                              */

/* CH24 @Bit 24 : Include or exclude channel 24 */
  #define DPPIC_CHG_CH24_Pos (24UL)                  /*!< Position of CH24 field.                                              */
  #define DPPIC_CHG_CH24_Msk (0x1UL << DPPIC_CHG_CH24_Pos) /*!< Bit mask of CH24 field.                                        */
  #define DPPIC_CHG_CH24_Min (0x0UL)                 /*!< Min enumerator value of CH24 field.                                  */
  #define DPPIC_CHG_CH24_Max (0x1UL)                 /*!< Max enumerator value of CH24 field.                                  */
  #define DPPIC_CHG_CH24_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH24_Included (0x1UL)            /*!< Include                                                              */

/* CH25 @Bit 25 : Include or exclude channel 25 */
  #define DPPIC_CHG_CH25_Pos (25UL)                  /*!< Position of CH25 field.                                              */
  #define DPPIC_CHG_CH25_Msk (0x1UL << DPPIC_CHG_CH25_Pos) /*!< Bit mask of CH25 field.                                        */
  #define DPPIC_CHG_CH25_Min (0x0UL)                 /*!< Min enumerator value of CH25 field.                                  */
  #define DPPIC_CHG_CH25_Max (0x1UL)                 /*!< Max enumerator value of CH25 field.                                  */
  #define DPPIC_CHG_CH25_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH25_Included (0x1UL)            /*!< Include                                                              */

/* CH26 @Bit 26 : Include or exclude channel 26 */
  #define DPPIC_CHG_CH26_Pos (26UL)                  /*!< Position of CH26 field.                                              */
  #define DPPIC_CHG_CH26_Msk (0x1UL << DPPIC_CHG_CH26_Pos) /*!< Bit mask of CH26 field.                                        */
  #define DPPIC_CHG_CH26_Min (0x0UL)                 /*!< Min enumerator value of CH26 field.                                  */
  #define DPPIC_CHG_CH26_Max (0x1UL)                 /*!< Max enumerator value of CH26 field.                                  */
  #define DPPIC_CHG_CH26_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH26_Included (0x1UL)            /*!< Include                                                              */

/* CH27 @Bit 27 : Include or exclude channel 27 */
  #define DPPIC_CHG_CH27_Pos (27UL)                  /*!< Position of CH27 field.                                              */
  #define DPPIC_CHG_CH27_Msk (0x1UL << DPPIC_CHG_CH27_Pos) /*!< Bit mask of CH27 field.                                        */
  #define DPPIC_CHG_CH27_Min (0x0UL)                 /*!< Min enumerator value of CH27 field.                                  */
  #define DPPIC_CHG_CH27_Max (0x1UL)                 /*!< Max enumerator value of CH27 field.                                  */
  #define DPPIC_CHG_CH27_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH27_Included (0x1UL)            /*!< Include                                                              */

