NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CH28 @Bit 28 : Include or exclude channel 28 */
  #define DPPIC_CHG_CH28_Pos (28UL)                  /*!< Position of CH28 field.                                              */
  #define DPPIC_CHG_CH28_Msk (0x1UL << DPPIC_CHG_CH28_Pos) /*!< Bit mask of CH28 field.                                        */
  #define DPPIC_CHG_CH28_Min (0x0UL)                 /*!< Min enumerator value of CH28 field.                                  */
  #define DPPIC_CHG_CH28_Max (0x1UL)                 /*!< Max enumerator value of CH28 field.                                  */
  #define DPPIC_CHG_CH28_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH28_Included (0x1UL)            /*!< Include                                                              */

/* CH29 @Bit 29 : Include or exclude channel 29 */
  #define DPPIC_CHG_CH29_Pos (29UL)                  /*!< Position of CH29 field.                                              */
  #define DPPIC_CHG_CH29_Msk (0x1UL << DPPIC_CHG_CH29_Pos) /*!< Bit mask of CH29 field.                                        */
  #define DPPIC_CHG_CH29_Min (0x0UL)                 /*!< Min enumerator value of CH29 field.                                  */
  #define DPPIC_CHG_CH29_Max (0x1UL)                 /*!< Max enumerator value of CH29 field.                                  */
  #define DPPIC_CHG_CH29_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH29_Included (0x1UL)            /*!< Include                                                              */

/* CH30 @Bit 30 : Include or exclude channel 30 */
  #define DPPIC_CHG_CH30_Pos (30UL)                  /*!< Position of CH30 field.                                              */
  #define DPPIC_CHG_CH30_Msk (0x1UL << DPPIC_CHG_CH30_Pos) /*!< Bit mask of CH30 field.                                        */
  #define DPPIC_CHG_CH30_Min (0x0UL)                 /*!< Min enumerator value of CH30 field.                                  */
  #define DPPIC_CHG_CH30_Max (0x1UL)                 /*!< Max enumerator value of CH30 field.                                  */
  #define DPPIC_CHG_CH30_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH30_Included (0x1UL)            /*!< Include                                                              */

/* CH31 @Bit 31 : Include or exclude channel 31 */
  #define DPPIC_CHG_CH31_Pos (31UL)                  /*!< Position of CH31 field.                                              */
  #define DPPIC_CHG_CH31_Msk (0x1UL << DPPIC_CHG_CH31_Pos) /*!< Bit mask of CH31 field.                                        */
  #define DPPIC_CHG_CH31_Min (0x0UL)                 /*!< Min enumerator value of CH31 field.                                  */
  #define DPPIC_CHG_CH31_Max (0x1UL)                 /*!< Max enumerator value of CH31 field.                                  */
  #define DPPIC_CHG_CH31_Excluded (0x0UL)            /*!< Exclude                                                              */
  #define DPPIC_CHG_CH31_Included (0x1UL)            /*!< Include                                                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ECB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct ECB_KEY ====================================================== */
/**
  * @brief KEY [ECB_KEY] (unspecified)
  */
typedef struct {
  __OM  uint32_t  VALUE[4];                          /*!< (@ 0x00000000) 128-bit AES key                                       */
} NRF_ECB_KEY_Type;                                  /*!< Size = 16 (0x010)                                                    */

/* ECB_KEY_VALUE: 128-bit AES key */
  #define ECB_KEY_VALUE_MaxCount (4UL)               /*!< Max size of VALUE[4] array.                                          */
  #define ECB_KEY_VALUE_MaxIndex (3UL)               /*!< Max index of VALUE[4] array.                                         */
  #define ECB_KEY_VALUE_MinIndex (0UL)               /*!< Min index of VALUE[4] array.                                         */
  #define ECB_KEY_VALUE_ResetValue (0x00000000UL)    /*!< Reset value of VALUE[4] register.                                    */

/* VALUE @Bits 0..31 : AES 128-bit key value, bits (32*(n+1))-1 : (32*n) */
  #define ECB_KEY_VALUE_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define ECB_KEY_VALUE_VALUE_Msk (0xFFFFFFFFUL << ECB_KEY_VALUE_VALUE_Pos) /*!< Bit mask of VALUE field.                      */



/* ====================================================== Struct ECB_IN ====================================================== */
/**
  * @brief IN [ECB_IN] IN EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Input pointer                                         */
} NRF_ECB_IN_Type;                                   /*!< Size = 4 (0x004)                                                     */

/* ECB_IN_PTR: Input pointer */
  #define ECB_IN_PTR_ResetValue (0x00000000UL)       /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : Points to a job list containing unencrypted ECB data structure */
  #define ECB_IN_PTR_PTR_Pos (0UL)                   /*!< Position of PTR field.                                               */
  #define ECB_IN_PTR_PTR_Msk (0xFFFFFFFFUL << ECB_IN_PTR_PTR_Pos) /*!< Bit mask of PTR field.                                  */



