NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ECB_INTENSET: Enable interrupt */
  #define ECB_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* END @Bit 0 : Write '1' to enable interrupt for event END */
  #define ECB_INTENSET_END_Pos (0UL)                 /*!< Position of END field.                                               */
  #define ECB_INTENSET_END_Msk (0x1UL << ECB_INTENSET_END_Pos) /*!< Bit mask of END field.                                     */
  #define ECB_INTENSET_END_Min (0x0UL)               /*!< Min enumerator value of END field.                                   */
  #define ECB_INTENSET_END_Max (0x1UL)               /*!< Max enumerator value of END field.                                   */
  #define ECB_INTENSET_END_Set (0x1UL)               /*!< Enable                                                               */
  #define ECB_INTENSET_END_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define ECB_INTENSET_END_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* ERROR @Bit 1 : Write '1' to enable interrupt for event ERROR */
  #define ECB_INTENSET_ERROR_Pos (1UL)               /*!< Position of ERROR field.                                             */
  #define ECB_INTENSET_ERROR_Msk (0x1UL << ECB_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                               */
  #define ECB_INTENSET_ERROR_Min (0x0UL)             /*!< Min enumerator value of ERROR field.                                 */
  #define ECB_INTENSET_ERROR_Max (0x1UL)             /*!< Max enumerator value of ERROR field.                                 */
  #define ECB_INTENSET_ERROR_Set (0x1UL)             /*!< Enable                                                               */
  #define ECB_INTENSET_ERROR_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define ECB_INTENSET_ERROR_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* ECB_INTENCLR: Disable interrupt */
  #define ECB_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* END @Bit 0 : Write '1' to disable interrupt for event END */
  #define ECB_INTENCLR_END_Pos (0UL)                 /*!< Position of END field.                                               */
  #define ECB_INTENCLR_END_Msk (0x1UL << ECB_INTENCLR_END_Pos) /*!< Bit mask of END field.                                     */
  #define ECB_INTENCLR_END_Min (0x0UL)               /*!< Min enumerator value of END field.                                   */
  #define ECB_INTENCLR_END_Max (0x1UL)               /*!< Max enumerator value of END field.                                   */
  #define ECB_INTENCLR_END_Clear (0x1UL)             /*!< Disable                                                              */
  #define ECB_INTENCLR_END_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define ECB_INTENCLR_END_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* ERROR @Bit 1 : Write '1' to disable interrupt for event ERROR */
  #define ECB_INTENCLR_ERROR_Pos (1UL)               /*!< Position of ERROR field.                                             */
  #define ECB_INTENCLR_ERROR_Msk (0x1UL << ECB_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                               */
  #define ECB_INTENCLR_ERROR_Min (0x0UL)             /*!< Min enumerator value of ERROR field.                                 */
  #define ECB_INTENCLR_ERROR_Max (0x1UL)             /*!< Max enumerator value of ERROR field.                                 */
  #define ECB_INTENCLR_ERROR_Clear (0x1UL)           /*!< Disable                                                              */
  #define ECB_INTENCLR_ERROR_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define ECB_INTENCLR_ERROR_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            EGU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct EGU ======================================================== */
/**
  * @brief Event generator unit
  */
  typedef struct {                                   /*!< EGU Structure                                                        */
    __OM uint32_t TASKS_TRIGGER[16];                 /*!< (@ 0x00000000) Trigger n for triggering the corresponding TRIGGERED[n]
                                                                         event*/
    __IM uint32_t RESERVED[16];
    __IOM uint32_t SUBSCRIBE_TRIGGER[16];            /*!< (@ 0x00000080) Subscribe configuration for task TRIGGER[n]           */
    __IM uint32_t RESERVED1[16];
    __IOM uint32_t EVENTS_TRIGGERED[16];             /*!< (@ 0x00000100) Event number n generated by triggering the
                                                                         corresponding TRIGGER[n] task*/
    __IM uint32_t RESERVED2[16];
    __IOM uint32_t PUBLISH_TRIGGERED[16];            /*!< (@ 0x00000180) Publish configuration for event TRIGGERED[n]          */
    __IM uint32_t RESERVED3[80];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
  } NRF_EGU_Type;                                    /*!< Size = 784 (0x310)                                                   */

/* EGU_TASKS_TRIGGER: Trigger n for triggering the corresponding TRIGGERED[n] event */
  #define EGU_TASKS_TRIGGER_MaxCount (16UL)          /*!< Max size of TASKS_TRIGGER[16] array.                                 */
  #define EGU_TASKS_TRIGGER_MaxIndex (15UL)          /*!< Max index of TASKS_TRIGGER[16] array.                                */
  #define EGU_TASKS_TRIGGER_MinIndex (0UL)           /*!< Min index of TASKS_TRIGGER[16] array.                                */
  #define EGU_TASKS_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGGER[16] register.                          */

