NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ETB_RRP: ETB RAM Read Pointer Register */
  #define ETB_RRP_ResetValue (0x00000000UL)          /*!< Reset value of RRP register.                                         */

/* RAM_READ_POINTER @Bits 0..9 : Sets the read pointer used to read entries from the Trace RAM over the APB interface. */
  #define ETB_RRP_RAM_READ_POINTER_Pos (0UL)         /*!< Position of RAM_READ_POINTER field.                                  */
  #define ETB_RRP_RAM_READ_POINTER_Msk (0x3FFUL << ETB_RRP_RAM_READ_POINTER_Pos) /*!< Bit mask of RAM_READ_POINTER field.      */


/* ETB_RWP: ETB RAM Write Pointer Register */
  #define ETB_RWP_ResetValue (0x00000000UL)          /*!< Reset value of RWP register.                                         */

/* RAM_WRITE_POINTER @Bits 0..9 : Sets the write pointer used to write entries from the CoreSight bus into the Trace RAM. */
  #define ETB_RWP_RAM_WRITE_POINTER_Pos (0UL)        /*!< Position of RAM_WRITE_POINTER field.                                 */
  #define ETB_RWP_RAM_WRITE_POINTER_Msk (0x3FFUL << ETB_RWP_RAM_WRITE_POINTER_Pos) /*!< Bit mask of RAM_WRITE_POINTER field.   */


/* ETB_TRG: ETB Trigger Counter Register */
  #define ETB_TRG_ResetValue (0x00000000UL)          /*!< Reset value of TRG register.                                         */

/* TRIGGER_COUNTER @Bits 0..9 : The counter is used as follows:Trace after - The counter is set to a large value, slightly less
                                than the number of entries in the RAM. Trace before - The counter is set to a small value. Trace
                                about - The counter is set to half the depth of the Trace RAM. This register must not be written
                                to when trace capture is enabled (FtStopped=0, TraceCaptEn=1). If a write is attempted, the
                                register is not updated. A read access is permitted with trace capture enabled. */

  #define ETB_TRG_TRIGGER_COUNTER_Pos (0UL)          /*!< Position of TRIGGER_COUNTER field.                                   */
  #define ETB_TRG_TRIGGER_COUNTER_Msk (0x3FFUL << ETB_TRG_TRIGGER_COUNTER_Pos) /*!< Bit mask of TRIGGER_COUNTER field.         */


/* ETB_CTL: ETB Control Register */
  #define ETB_CTL_ResetValue (0x00000000UL)          /*!< Reset value of CTL register.                                         */

/* TRACECAPTEN @Bit 0 : ETB Trace Capture Enable. This is the master enable bit forcing FtStopped HIGH when TraceCaptEn is LOW.
                        When capture is disabled, any remaining data in the ATB formatter is stored to RAM. When all data is
                        stored the formatter outputs FtStopped. Capture is fully disabled, or complete, when FtStopped goes
                        HIGH. See ETB Formatter and Flush Status Register, FFSR, 0x300. */

  #define ETB_CTL_TRACECAPTEN_Pos (0UL)              /*!< Position of TRACECAPTEN field.                                       */
  #define ETB_CTL_TRACECAPTEN_Msk (0x1UL << ETB_CTL_TRACECAPTEN_Pos) /*!< Bit mask of TRACECAPTEN field.                       */


/* ETB_RWD: ETB RAM Write Data Register */
  #define ETB_RWD_ResetValue (0x00000000UL)          /*!< Reset value of RWD register.                                         */

/* RAM_WRITE_DATA @Bits 0..31 : Data written to the ETB Trace RAM. When trace capture is disabled, the contents of this register
                                are placed into the ETB Trace RAM when this register is written to. Writing to this register
                                increments the RAM Write Pointer Register. If trace capture is enabled, and this register is
                                accessed, then a read from this register outputs 0xFFFFFFFF. Reads of this register never
                                increment the RAM Write Pointer Register. A constant stream of 1s being output corresponds to a
                                synchronization output from the ETB. If a write access is attempted, the data is not written
                                into Trace RAM. */

  #define ETB_RWD_RAM_WRITE_DATA_Pos (0UL)           /*!< Position of RAM_WRITE_DATA field.                                    */
  #define ETB_RWD_RAM_WRITE_DATA_Msk (0xFFFFFFFFUL << ETB_RWD_RAM_WRITE_DATA_Pos) /*!< Bit mask of RAM_WRITE_DATA field.       */


/* ETB_FFSR: ETB Formatter and Flush Status Register */
  #define ETB_FFSR_ResetValue (0x00000002UL)         /*!< Reset value of FFSR register.                                        */

/* FLINPROG @Bit 0 : Flush In Progress. This is an indication of the current state of afvalids. */
  #define ETB_FFSR_FLINPROG_Pos (0UL)                /*!< Position of FLINPROG field.                                          */
  #define ETB_FFSR_FLINPROG_Msk (0x1UL << ETB_FFSR_FLINPROG_Pos) /*!< Bit mask of FLINPROG field.                              */

/* FTSTOPPED @Bit 1 : Formatter stopped. The formatter has received a stop request signal and all trace data and post-amble has
                      been output. Any more trace data on the ATB interface is ignored and atreadys goes HIGH. */

  #define ETB_FFSR_FTSTOPPED_Pos (1UL)               /*!< Position of FTSTOPPED field.                                         */
  #define ETB_FFSR_FTSTOPPED_Msk (0x1UL << ETB_FFSR_FTSTOPPED_Pos) /*!< Bit mask of FTSTOPPED field.                           */


/* ETB_FFCR: ETB Formatter and Flush Control Register */
  #define ETB_FFCR_ResetValue (0x00000000UL)         /*!< Reset value of FFCR register.                                        */

/* ENFTC @Bit 0 : Do not embed Triggers into the formatted stream. Trace disable cycles and triggers are indicated by TRACECTL,
                  where fitted. Can only be changed when FtStopped is HIGH. This bit is clear on reset. */

  #define ETB_FFCR_ENFTC_Pos (0UL)                   /*!< Position of ENFTC field.                                             */
  #define ETB_FFCR_ENFTC_Msk (0x1UL << ETB_FFCR_ENFTC_Pos) /*!< Bit mask of ENFTC field.                                       */

