NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ETM_TRCVDSACCTLR: ViewData include / exclude control. Might ignore writes when the trace unit is enabled or not idle. This
                      register must be programmed when one or more address comparators are implemented. */

  #define ETM_TRCVDSACCTLR_ResetValue (0x00000000UL) /*!< Reset value of TRCVDSACCTLR register.                                */

/* INCLUDE0 @Bit 0 : Selects which single address comparators are in use with ViewData include control. */
  #define ETM_TRCVDSACCTLR_INCLUDE0_Pos (0UL)        /*!< Position of INCLUDE0 field.                                          */
  #define ETM_TRCVDSACCTLR_INCLUDE0_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE0_Pos) /*!< Bit mask of INCLUDE0 field.              */
  #define ETM_TRCVDSACCTLR_INCLUDE0_Min (0x0UL)      /*!< Min enumerator value of INCLUDE0 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE0_Max (0x1UL)      /*!< Max enumerator value of INCLUDE0 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE0_Disabled (0x0UL) /*!< The single address comparator 0, is not selected for ViewData include
                                                          control.*/
  #define ETM_TRCVDSACCTLR_INCLUDE0_Enabled (0x1UL)  /*!< The single address comparator 0, is selected for ViewData include
                                                          control.*/

/* INCLUDE1 @Bit 1 : Selects which single address comparators are in use with ViewData include control. */
  #define ETM_TRCVDSACCTLR_INCLUDE1_Pos (1UL)        /*!< Position of INCLUDE1 field.                                          */
  #define ETM_TRCVDSACCTLR_INCLUDE1_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE1_Pos) /*!< Bit mask of INCLUDE1 field.              */
  #define ETM_TRCVDSACCTLR_INCLUDE1_Min (0x0UL)      /*!< Min enumerator value of INCLUDE1 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE1_Max (0x1UL)      /*!< Max enumerator value of INCLUDE1 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE1_Disabled (0x0UL) /*!< The single address comparator 1, is not selected for ViewData include
                                                          control.*/
  #define ETM_TRCVDSACCTLR_INCLUDE1_Enabled (0x1UL)  /*!< The single address comparator 1, is selected for ViewData include
                                                          control.*/

/* INCLUDE2 @Bit 2 : Selects which single address comparators are in use with ViewData include control. */
  #define ETM_TRCVDSACCTLR_INCLUDE2_Pos (2UL)        /*!< Position of INCLUDE2 field.                                          */
  #define ETM_TRCVDSACCTLR_INCLUDE2_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE2_Pos) /*!< Bit mask of INCLUDE2 field.              */
  #define ETM_TRCVDSACCTLR_INCLUDE2_Min (0x0UL)      /*!< Min enumerator value of INCLUDE2 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE2_Max (0x1UL)      /*!< Max enumerator value of INCLUDE2 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE2_Disabled (0x0UL) /*!< The single address comparator 2, is not selected for ViewData include
                                                          control.*/
  #define ETM_TRCVDSACCTLR_INCLUDE2_Enabled (0x1UL)  /*!< The single address comparator 2, is selected for ViewData include
                                                          control.*/

/* INCLUDE3 @Bit 3 : Selects which single address comparators are in use with ViewData include control. */
  #define ETM_TRCVDSACCTLR_INCLUDE3_Pos (3UL)        /*!< Position of INCLUDE3 field.                                          */
  #define ETM_TRCVDSACCTLR_INCLUDE3_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE3_Pos) /*!< Bit mask of INCLUDE3 field.              */
  #define ETM_TRCVDSACCTLR_INCLUDE3_Min (0x0UL)      /*!< Min enumerator value of INCLUDE3 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE3_Max (0x1UL)      /*!< Max enumerator value of INCLUDE3 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE3_Disabled (0x0UL) /*!< The single address comparator 3, is not selected for ViewData include
                                                          control.*/
  #define ETM_TRCVDSACCTLR_INCLUDE3_Enabled (0x1UL)  /*!< The single address comparator 3, is selected for ViewData include
                                                          control.*/

/* INCLUDE4 @Bit 4 : Selects which single address comparators are in use with ViewData include control. */
  #define ETM_TRCVDSACCTLR_INCLUDE4_Pos (4UL)        /*!< Position of INCLUDE4 field.                                          */
  #define ETM_TRCVDSACCTLR_INCLUDE4_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE4_Pos) /*!< Bit mask of INCLUDE4 field.              */
  #define ETM_TRCVDSACCTLR_INCLUDE4_Min (0x0UL)      /*!< Min enumerator value of INCLUDE4 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE4_Max (0x1UL)      /*!< Max enumerator value of INCLUDE4 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE4_Disabled (0x0UL) /*!< The single address comparator 4, is not selected for ViewData include
                                                          control.*/
  #define ETM_TRCVDSACCTLR_INCLUDE4_Enabled (0x1UL)  /*!< The single address comparator 4, is selected for ViewData include
                                                          control.*/

/* INCLUDE5 @Bit 5 : Selects which single address comparators are in use with ViewData include control. */
  #define ETM_TRCVDSACCTLR_INCLUDE5_Pos (5UL)        /*!< Position of INCLUDE5 field.                                          */
  #define ETM_TRCVDSACCTLR_INCLUDE5_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE5_Pos) /*!< Bit mask of INCLUDE5 field.              */
  #define ETM_TRCVDSACCTLR_INCLUDE5_Min (0x0UL)      /*!< Min enumerator value of INCLUDE5 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE5_Max (0x1UL)      /*!< Max enumerator value of INCLUDE5 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE5_Disabled (0x0UL) /*!< The single address comparator 5, is not selected for ViewData include
                                                          control.*/
  #define ETM_TRCVDSACCTLR_INCLUDE5_Enabled (0x1UL)  /*!< The single address comparator 5, is selected for ViewData include
                                                          control.*/

/* INCLUDE6 @Bit 6 : Selects which single address comparators are in use with ViewData include control. */
  #define ETM_TRCVDSACCTLR_INCLUDE6_Pos (6UL)        /*!< Position of INCLUDE6 field.                                          */
  #define ETM_TRCVDSACCTLR_INCLUDE6_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE6_Pos) /*!< Bit mask of INCLUDE6 field.              */
  #define ETM_TRCVDSACCTLR_INCLUDE6_Min (0x0UL)      /*!< Min enumerator value of INCLUDE6 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE6_Max (0x1UL)      /*!< Max enumerator value of INCLUDE6 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE6_Disabled (0x0UL) /*!< The single address comparator 6, is not selected for ViewData include
                                                          control.*/
  #define ETM_TRCVDSACCTLR_INCLUDE6_Enabled (0x1UL)  /*!< The single address comparator 6, is selected for ViewData include
                                                          control.*/

/* INCLUDE7 @Bit 7 : Selects which single address comparators are in use with ViewData include control. */
  #define ETM_TRCVDSACCTLR_INCLUDE7_Pos (7UL)        /*!< Position of INCLUDE7 field.                                          */
  #define ETM_TRCVDSACCTLR_INCLUDE7_Msk (0x1UL << ETM_TRCVDSACCTLR_INCLUDE7_Pos) /*!< Bit mask of INCLUDE7 field.              */
  #define ETM_TRCVDSACCTLR_INCLUDE7_Min (0x0UL)      /*!< Min enumerator value of INCLUDE7 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE7_Max (0x1UL)      /*!< Max enumerator value of INCLUDE7 field.                              */
  #define ETM_TRCVDSACCTLR_INCLUDE7_Disabled (0x0UL) /*!< The single address comparator 7, is not selected for ViewData include
                                                          control.*/
  #define ETM_TRCVDSACCTLR_INCLUDE7_Enabled (0x1UL)  /*!< The single address comparator 7, is selected for ViewData include
                                                          control.*/

/* EXCLUDE0 @Bit 16 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE0_Pos (16UL)       /*!< Position of EXCLUDE0 field.                                          */
  #define ETM_TRCVDSACCTLR_EXCLUDE0_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE0_Pos) /*!< Bit mask of EXCLUDE0 field.              */
  #define ETM_TRCVDSACCTLR_EXCLUDE0_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE0 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE0_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE0 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE0_Disabled (0x0UL) /*!< The single address comparator 0, is not selected for ViewData exclude
                                                          control.*/
  #define ETM_TRCVDSACCTLR_EXCLUDE0_Enabled (0x1UL)  /*!< The single address comparator 0, s selected for ViewData exclude
                                                          control.*/

/* EXCLUDE1 @Bit 17 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE1_Pos (17UL)       /*!< Position of EXCLUDE1 field.                                          */
  #define ETM_TRCVDSACCTLR_EXCLUDE1_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE1_Pos) /*!< Bit mask of EXCLUDE1 field.              */
  #define ETM_TRCVDSACCTLR_EXCLUDE1_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE1 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE1_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE1 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE1_Disabled (0x0UL) /*!< The single address comparator 1, is not selected for ViewData exclude
                                                          control.*/
  #define ETM_TRCVDSACCTLR_EXCLUDE1_Enabled (0x1UL)  /*!< The single address comparator 1, s selected for ViewData exclude
                                                          control.*/

/* EXCLUDE2 @Bit 18 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE2_Pos (18UL)       /*!< Position of EXCLUDE2 field.                                          */
  #define ETM_TRCVDSACCTLR_EXCLUDE2_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE2_Pos) /*!< Bit mask of EXCLUDE2 field.              */
  #define ETM_TRCVDSACCTLR_EXCLUDE2_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE2 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE2_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE2 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE2_Disabled (0x0UL) /*!< The single address comparator 2, is not selected for ViewData exclude
                                                          control.*/
  #define ETM_TRCVDSACCTLR_EXCLUDE2_Enabled (0x1UL)  /*!< The single address comparator 2, s selected for ViewData exclude
                                                          control.*/

/* EXCLUDE3 @Bit 19 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE3_Pos (19UL)       /*!< Position of EXCLUDE3 field.                                          */
  #define ETM_TRCVDSACCTLR_EXCLUDE3_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE3_Pos) /*!< Bit mask of EXCLUDE3 field.              */
  #define ETM_TRCVDSACCTLR_EXCLUDE3_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE3 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE3_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE3 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE3_Disabled (0x0UL) /*!< The single address comparator 3, is not selected for ViewData exclude
                                                          control.*/
  #define ETM_TRCVDSACCTLR_EXCLUDE3_Enabled (0x1UL)  /*!< The single address comparator 3, s selected for ViewData exclude
                                                          control.*/

/* EXCLUDE4 @Bit 20 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE4_Pos (20UL)       /*!< Position of EXCLUDE4 field.                                          */
  #define ETM_TRCVDSACCTLR_EXCLUDE4_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE4_Pos) /*!< Bit mask of EXCLUDE4 field.              */
  #define ETM_TRCVDSACCTLR_EXCLUDE4_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE4 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE4_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE4 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE4_Disabled (0x0UL) /*!< The single address comparator 4, is not selected for ViewData exclude
                                                          control.*/
  #define ETM_TRCVDSACCTLR_EXCLUDE4_Enabled (0x1UL)  /*!< The single address comparator 4, s selected for ViewData exclude
                                                          control.*/

/* EXCLUDE5 @Bit 21 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE5_Pos (21UL)       /*!< Position of EXCLUDE5 field.                                          */
  #define ETM_TRCVDSACCTLR_EXCLUDE5_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE5_Pos) /*!< Bit mask of EXCLUDE5 field.              */
  #define ETM_TRCVDSACCTLR_EXCLUDE5_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE5 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE5_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE5 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE5_Disabled (0x0UL) /*!< The single address comparator 5, is not selected for ViewData exclude
                                                          control.*/
  #define ETM_TRCVDSACCTLR_EXCLUDE5_Enabled (0x1UL)  /*!< The single address comparator 5, s selected for ViewData exclude
                                                          control.*/

/* EXCLUDE6 @Bit 22 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE6_Pos (22UL)       /*!< Position of EXCLUDE6 field.                                          */
  #define ETM_TRCVDSACCTLR_EXCLUDE6_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE6_Pos) /*!< Bit mask of EXCLUDE6 field.              */
  #define ETM_TRCVDSACCTLR_EXCLUDE6_Min (0x0UL)      /*!< Min enumerator value of EXCLUDE6 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE6_Max (0x1UL)      /*!< Max enumerator value of EXCLUDE6 field.                              */
  #define ETM_TRCVDSACCTLR_EXCLUDE6_Disabled (0x0UL) /*!< The single address comparator 6, is not selected for ViewData exclude
                                                          control.*/
  #define ETM_TRCVDSACCTLR_EXCLUDE6_Enabled (0x1UL)  /*!< The single address comparator 6, s selected for ViewData exclude
                                                          control.*/

