NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ETR_DBALO: Data Buffer Address Low Register */
  #define ETR_DBALO_ResetValue (0x00000000UL)        /*!< Reset value of DBALO register.                                       */

/* BUFADDRLO @Bits 0..31 : Holds the lower 32 bits of the 40-bit address used to locate the trace buffer in system memory */
  #define ETR_DBALO_BUFADDRLO_Pos (0UL)              /*!< Position of BUFADDRLO field.                                         */
  #define ETR_DBALO_BUFADDRLO_Msk (0xFFFFFFFFUL << ETR_DBALO_BUFADDRLO_Pos) /*!< Bit mask of BUFADDRLO field.                  */


/* ETR_DBAHI: Data Buffer Address High Register */
  #define ETR_DBAHI_ResetValue (0x00000000UL)        /*!< Reset value of DBAHI register.                                       */

/* BUFADDRHI @Bits 0..7 : Holds the upper 8 bits of the 40-bit address used to locate the trace buffer in system memory */
  #define ETR_DBAHI_BUFADDRHI_Pos (0UL)              /*!< Position of BUFADDRHI field.                                         */
  #define ETR_DBAHI_BUFADDRHI_Msk (0xFFUL << ETR_DBAHI_BUFADDRHI_Pos) /*!< Bit mask of BUFADDRHI field.                        */


/* ETR_FFSR: Formatter and Flush Status Register */
  #define ETR_FFSR_ResetValue (0x00000002UL)         /*!< Reset value of FFSR register.                                        */

/* FLINPROG @Bit 0 : This bit indicates whether the TMC is currently processing a flush on the ATB slave port. This bit reflects
                     the status of the AFVALIDS output. The flush initiation is controlled by the flush-control bits in the FFCR
                     register. */

  #define ETR_FFSR_FLINPROG_Pos (0UL)                /*!< Position of FLINPROG field.                                          */
  #define ETR_FFSR_FLINPROG_Msk (0x1UL << ETR_FFSR_FLINPROG_Pos) /*!< Bit mask of FLINPROG field.                              */

/* FTSTOPPED @Bit 1 : This bit behaves the same way as the FtEmpty bit in the STS register, 0x00C. */
  #define ETR_FFSR_FTSTOPPED_Pos (1UL)               /*!< Position of FTSTOPPED field.                                         */
  #define ETR_FFSR_FTSTOPPED_Msk (0x1UL << ETR_FFSR_FTSTOPPED_Pos) /*!< Bit mask of FTSTOPPED field.                           */


/* ETR_FFCR: Formatter and Flush Control Register */
  #define ETR_FFCR_ResetValue (0x00000000UL)         /*!< Reset value of FFCR register.                                        */

/* ENFT @Bit 0 : If this bit is set, formatting is enabled. */
  #define ETR_FFCR_ENFT_Pos (0UL)                    /*!< Position of ENFT field.                                              */
  #define ETR_FFCR_ENFT_Msk (0x1UL << ETR_FFCR_ENFT_Pos) /*!< Bit mask of ENFT field.                                          */

/* ENTI @Bit 1 : Setting this bit enables the insertion of triggers in the formatted trace stream. */
  #define ETR_FFCR_ENTI_Pos (1UL)                    /*!< Position of ENTI field.                                              */
  #define ETR_FFCR_ENTI_Msk (0x1UL << ETR_FFCR_ENTI_Pos) /*!< Bit mask of ENTI field.                                          */

/* FONFLIN @Bit 4 : Setting this bit enables the detection of transitions on the FLUSHIN input by the TMC. */
  #define ETR_FFCR_FONFLIN_Pos (4UL)                 /*!< Position of FONFLIN field.                                           */
  #define ETR_FFCR_FONFLIN_Msk (0x1UL << ETR_FFCR_FONFLIN_Pos) /*!< Bit mask of FONFLIN field.                                 */

/* FONTRIGEVT @Bit 5 : Setting this bit generates a flush when a Trigger event occurs. */
  #define ETR_FFCR_FONTRIGEVT_Pos (5UL)              /*!< Position of FONTRIGEVT field.                                        */
  #define ETR_FFCR_FONTRIGEVT_Msk (0x1UL << ETR_FFCR_FONTRIGEVT_Pos) /*!< Bit mask of FONTRIGEVT field.                        */

/* FLUSHMAN @Bit 6 : Manually generate a flush of the system. */
  #define ETR_FFCR_FLUSHMAN_Pos (6UL)                /*!< Position of FLUSHMAN field.                                          */
  #define ETR_FFCR_FLUSHMAN_Msk (0x1UL << ETR_FFCR_FLUSHMAN_Pos) /*!< Bit mask of FLUSHMAN field.                              */

/* TRIGONTRIGIN @Bit 8 : If this bit is set, a trigger is indicated on the trace stream when a rising edge is detected on the
                         TRIGIN input. */

  #define ETR_FFCR_TRIGONTRIGIN_Pos (8UL)            /*!< Position of TRIGONTRIGIN field.                                      */
  #define ETR_FFCR_TRIGONTRIGIN_Msk (0x1UL << ETR_FFCR_TRIGONTRIGIN_Pos) /*!< Bit mask of TRIGONTRIGIN field.                  */

/* TRIGONTRIGEVT @Bit 9 : If this bit is set, a trigger is indicated on the output trace stream when a Trigger Event occurs. */
  #define ETR_FFCR_TRIGONTRIGEVT_Pos (9UL)           /*!< Position of TRIGONTRIGEVT field.                                     */
  #define ETR_FFCR_TRIGONTRIGEVT_Msk (0x1UL << ETR_FFCR_TRIGONTRIGEVT_Pos) /*!< Bit mask of TRIGONTRIGEVT field.               */

/* TRIGONFL @Bit 10 : If this bit is set, a trigger is indicated on the trace stream on AFREADYS being returned. */
  #define ETR_FFCR_TRIGONFL_Pos (10UL)               /*!< Position of TRIGONFL field.                                          */
  #define ETR_FFCR_TRIGONFL_Msk (0x1UL << ETR_FFCR_TRIGONFL_Pos) /*!< Bit mask of TRIGONFL field.                              */

/* STOPONFL @Bit 12 : If this bit is set, the formatter is stopped on completion of a flush operation. */
  #define ETR_FFCR_STOPONFL_Pos (12UL)               /*!< Position of STOPONFL field.                                          */
  #define ETR_FFCR_STOPONFL_Msk (0x1UL << ETR_FFCR_STOPONFL_Pos) /*!< Bit mask of STOPONFL field.                              */

/* STOPONTRIGEVT @Bit 13 : If this bit is set, the formatter is stopped when a Trigger Event has been observed. */
  #define ETR_FFCR_STOPONTRIGEVT_Pos (13UL)          /*!< Position of STOPONTRIGEVT field.                                     */
  #define ETR_FFCR_STOPONTRIGEVT_Msk (0x1UL << ETR_FFCR_STOPONTRIGEVT_Pos) /*!< Bit mask of STOPONTRIGEVT field.               */

/* DRAINBUFFER @Bit 14 : This bit is used to enable draining of the trace data through the ATB Master interface after the
                         formatter has stopped. */

  #define ETR_FFCR_DRAINBUFFER_Pos (14UL)            /*!< Position of DRAINBUFFER field.                                       */
  #define ETR_FFCR_DRAINBUFFER_Msk (0x1UL << ETR_FFCR_DRAINBUFFER_Pos) /*!< Bit mask of DRAINBUFFER field.                     */


/* ETR_PSCR: Periodic Synchronization Counter Register */
  #define ETR_PSCR_ResetValue (0x00000000UL)         /*!< Reset value of PSCR register.                                        */

