NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PSCOUNT @Bits 0..4 : The reload value of the Synchronization Counter */
  #define ETR_PSCR_PSCOUNT_Pos (0UL)                 /*!< Position of PSCOUNT field.                                           */
  #define ETR_PSCR_PSCOUNT_Msk (0x1FUL << ETR_PSCR_PSCOUNT_Pos) /*!< Bit mask of PSCOUNT field.                                */


/* ETR_ITATBMCTR0: Integration Test ATB Master Interface Control 0 Register */
  #define ETR_ITATBMCTR0_ResetValue (0x00000000UL)   /*!< Reset value of ITATBMCTR0 register.                                  */

/* ATVALIDM @Bit 0 : Set the value of ATVALIDM output */
  #define ETR_ITATBMCTR0_ATVALIDM_Pos (0UL)          /*!< Position of ATVALIDM field.                                          */
  #define ETR_ITATBMCTR0_ATVALIDM_Msk (0x1UL << ETR_ITATBMCTR0_ATVALIDM_Pos) /*!< Bit mask of ATVALIDM field.                  */

/* AFREADYM @Bit 1 : Set the value of AFREADYM output */
  #define ETR_ITATBMCTR0_AFREADYM_Pos (1UL)          /*!< Position of AFREADYM field.                                          */
  #define ETR_ITATBMCTR0_AFREADYM_Msk (0x1UL << ETR_ITATBMCTR0_AFREADYM_Pos) /*!< Bit mask of AFREADYM field.                  */

/* ATBYTESM @Bits 8..9 : Control the value of ATBYTESM output from TMC. The value written to this field is driven on the
                         ATBYTESM output of the TMC. */

  #define ETR_ITATBMCTR0_ATBYTESM_Pos (8UL)          /*!< Position of ATBYTESM field.                                          */
  #define ETR_ITATBMCTR0_ATBYTESM_Msk (0x3UL << ETR_ITATBMCTR0_ATBYTESM_Pos) /*!< Bit mask of ATBYTESM field.                  */


/* ETR_ITMISCOP0: Integration Test Miscellaneous Output Register 0 */
  #define ETR_ITMISCOP0_ResetValue (0x00000000UL)    /*!< Reset value of ITMISCOP0 register.                                   */

/* ACQCOMP @Bit 0 : Set the value of the ACQCOMP output. */
  #define ETR_ITMISCOP0_ACQCOMP_Pos (0UL)            /*!< Position of ACQCOMP field.                                           */
  #define ETR_ITMISCOP0_ACQCOMP_Msk (0x1UL << ETR_ITMISCOP0_ACQCOMP_Pos) /*!< Bit mask of ACQCOMP field.                       */

/* FULL @Bit 1 : Set the value of the FULL output. */
  #define ETR_ITMISCOP0_FULL_Pos (1UL)               /*!< Position of FULL field.                                              */
  #define ETR_ITMISCOP0_FULL_Msk (0x1UL << ETR_ITMISCOP0_FULL_Pos) /*!< Bit mask of FULL field.                                */


/* ETR_ITTRFLIN: Integration Test Trigger In and Flush In Register */
  #define ETR_ITTRFLIN_ResetValue (0x00000000UL)     /*!< Reset value of ITTRFLIN register.                                    */

/* TRIGIN @Bit 0 : Read the value of the TRIGIN input. */
  #define ETR_ITTRFLIN_TRIGIN_Pos (0UL)              /*!< Position of TRIGIN field.                                            */
  #define ETR_ITTRFLIN_TRIGIN_Msk (0x1UL << ETR_ITTRFLIN_TRIGIN_Pos) /*!< Bit mask of TRIGIN field.                            */

/* FLUSHIN @Bit 1 : Read the value of the FLUSHIN input. */
  #define ETR_ITTRFLIN_FLUSHIN_Pos (1UL)             /*!< Position of FLUSHIN field.                                           */
  #define ETR_ITTRFLIN_FLUSHIN_Msk (0x1UL << ETR_ITTRFLIN_FLUSHIN_Pos) /*!< Bit mask of FLUSHIN field.                         */


/* ETR_ITATBDATA0: Integration Test ATB Data Register 0 */
  #define ETR_ITATBDATA0_ResetValue (0x00000000UL)   /*!< Reset value of ITATBDATA0 register.                                  */

/* ATDATASBIT0 @Bit 0 : Read the value of ATDATAS[0] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT0_Pos (0UL)       /*!< Position of ATDATASBIT0 field.                                       */
  #define ETR_ITATBDATA0_ATDATASBIT0_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT0_Pos) /*!< Bit mask of ATDATASBIT0 field.         */

/* ATDATASBIT7 @Bit 1 : Read the value of ATDATAS[7] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT7_Pos (1UL)       /*!< Position of ATDATASBIT7 field.                                       */
  #define ETR_ITATBDATA0_ATDATASBIT7_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT7_Pos) /*!< Bit mask of ATDATASBIT7 field.         */

/* ATDATASBIT15 @Bit 2 : Read the value of ATDATAS[15] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT15_Pos (2UL)      /*!< Position of ATDATASBIT15 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT15_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT15_Pos) /*!< Bit mask of ATDATASBIT15 field.      */

/* ATDATASBIT23 @Bit 3 : Read the value of ATDATAS[23] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT23_Pos (3UL)      /*!< Position of ATDATASBIT23 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT23_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT23_Pos) /*!< Bit mask of ATDATASBIT23 field.      */

/* ATDATASBIT31 @Bit 4 : Read the value of ATDATAS[31] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT31_Pos (4UL)      /*!< Position of ATDATASBIT31 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT31_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT31_Pos) /*!< Bit mask of ATDATASBIT31 field.      */

/* ATDATASBIT39 @Bit 5 : Read the value of ATDATAS[39] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT39_Pos (5UL)      /*!< Position of ATDATASBIT39 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT39_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT39_Pos) /*!< Bit mask of ATDATASBIT39 field.      */

/* ATDATASBIT47 @Bit 6 : Read the value of ATDATAS[47] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT47_Pos (6UL)      /*!< Position of ATDATASBIT47 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT47_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT47_Pos) /*!< Bit mask of ATDATASBIT47 field.      */

/* ATDATASBIT55 @Bit 7 : Read the value of ATDATAS[55] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT55_Pos (7UL)      /*!< Position of ATDATASBIT55 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT55_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT55_Pos) /*!< Bit mask of ATDATASBIT55 field.      */

/* ATDATASBIT63 @Bit 8 : Read the value of ATDATAS[63] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT63_Pos (8UL)      /*!< Position of ATDATASBIT63 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT63_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT63_Pos) /*!< Bit mask of ATDATASBIT63 field.      */

/* ATDATASBIT71 @Bit 9 : Read the value of ATDATAS[71] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT71_Pos (9UL)      /*!< Position of ATDATASBIT71 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT71_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT71_Pos) /*!< Bit mask of ATDATASBIT71 field.      */

/* ATDATASBIT79 @Bit 10 : Read the value of ATDATAS[79] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT79_Pos (10UL)     /*!< Position of ATDATASBIT79 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT79_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT79_Pos) /*!< Bit mask of ATDATASBIT79 field.      */

/* ATDATASBIT87 @Bit 11 : Read the value of ATDATAS[87] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT87_Pos (11UL)     /*!< Position of ATDATASBIT87 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT87_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT87_Pos) /*!< Bit mask of ATDATASBIT87 field.      */

/* ATDATASBIT95 @Bit 12 : Read the value of ATDATAS[95] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT95_Pos (12UL)     /*!< Position of ATDATASBIT95 field.                                      */
  #define ETR_ITATBDATA0_ATDATASBIT95_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT95_Pos) /*!< Bit mask of ATDATASBIT95 field.      */

/* ATDATASBIT103 @Bit 13 : Read the value of ATDATAS[103] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT103_Pos (13UL)    /*!< Position of ATDATASBIT103 field.                                     */
  #define ETR_ITATBDATA0_ATDATASBIT103_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT103_Pos) /*!< Bit mask of ATDATASBIT103 field.   */

/* ATDATASBIT111 @Bit 14 : Read the value of ATDATAS[111] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT111_Pos (14UL)    /*!< Position of ATDATASBIT111 field.                                     */
  #define ETR_ITATBDATA0_ATDATASBIT111_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT111_Pos) /*!< Bit mask of ATDATASBIT111 field.   */

/* ATDATASBIT119 @Bit 15 : Read the value of ATDATAS[119] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT119_Pos (15UL)    /*!< Position of ATDATASBIT119 field.                                     */
  #define ETR_ITATBDATA0_ATDATASBIT119_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT119_Pos) /*!< Bit mask of ATDATASBIT119 field.   */

