NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
  #define ETR_PERIPHID4_FOURKB_COUNT_Pos (4UL)       /*!< Position of FOURKB_COUNT field.                                      */
  #define ETR_PERIPHID4_FOURKB_COUNT_Msk (0xFUL << ETR_PERIPHID4_FOURKB_COUNT_Pos) /*!< Bit mask of FOURKB_COUNT field.        */


/* ETR_PERIPHID0: Peripheral ID0 Register */
  #define ETR_PERIPHID0_ResetValue (0x00000061UL)    /*!< Reset value of PERIPHID0 register.                                   */

/* PART_NUMBER_BITS7TO0 @Bits 0..7 : Bits [7:0] of the component's part number. This is selected by the designer of the
                                     component. */

  #define ETR_PERIPHID0_PART_NUMBER_BITS7TO0_Pos (0UL) /*!< Position of PART_NUMBER_BITS7TO0 field.                            */
  #define ETR_PERIPHID0_PART_NUMBER_BITS7TO0_Msk (0xFFUL << ETR_PERIPHID0_PART_NUMBER_BITS7TO0_Pos) /*!< Bit mask of
                                                                            PART_NUMBER_BITS7TO0 field.*/


/* ETR_PERIPHID1: Peripheral ID1 Register */
  #define ETR_PERIPHID1_ResetValue (0x000000B9UL)    /*!< Reset value of PERIPHID1 register.                                   */

/* PART_NUMBER_BITS11TO8 @Bits 0..3 : Bits [11:8] of the component's part number. This is selected by the designer of the
                                      component. */

  #define ETR_PERIPHID1_PART_NUMBER_BITS11TO8_Pos (0UL) /*!< Position of PART_NUMBER_BITS11TO8 field.                          */
  #define ETR_PERIPHID1_PART_NUMBER_BITS11TO8_Msk (0xFUL << ETR_PERIPHID1_PART_NUMBER_BITS11TO8_Pos) /*!< Bit mask of
                                                                            PART_NUMBER_BITS11TO8 field.*/

/* JEP106_BITS3TO0 @Bits 4..7 : Bits 3:0 of the JEDEC identity code indicating the designer of the component (along with the
                                continuation code) */

  #define ETR_PERIPHID1_JEP106_BITS3TO0_Pos (4UL)    /*!< Position of JEP106_BITS3TO0 field.                                   */
  #define ETR_PERIPHID1_JEP106_BITS3TO0_Msk (0xFUL << ETR_PERIPHID1_JEP106_BITS3TO0_Pos) /*!< Bit mask of JEP106_BITS3TO0
                                                                            field.*/


/* ETR_PERIPHID2: Peripheral ID2 Register */
  #define ETR_PERIPHID2_ResetValue (0x0000001BUL)    /*!< Reset value of PERIPHID2 register.                                   */

/* JEP106_BITS6TO4 @Bits 0..2 : Bits 6:4 of the JEDEC identity code indicating the designer of the component (along with the
                                continuation code) */

  #define ETR_PERIPHID2_JEP106_BITS6TO4_Pos (0UL)    /*!< Position of JEP106_BITS6TO4 field.                                   */
  #define ETR_PERIPHID2_JEP106_BITS6TO4_Msk (0x7UL << ETR_PERIPHID2_JEP106_BITS6TO4_Pos) /*!< Bit mask of JEP106_BITS6TO4
                                                                            field.*/

/* JEDEC @Bit 3 : Always set. Indicates that a JEDEC assigned value is used */
  #define ETR_PERIPHID2_JEDEC_Pos (3UL)              /*!< Position of JEDEC field.                                             */
  #define ETR_PERIPHID2_JEDEC_Msk (0x1UL << ETR_PERIPHID2_JEDEC_Pos) /*!< Bit mask of JEDEC field.                             */

/* REVISION @Bits 4..7 : The Revision field is an incremental value starting at 0x0 for the first design of this component. This
                         only increases by 1 for both major and minor revisions and is simply used as a look-up to establish the
                         exact major/minor revision. */

  #define ETR_PERIPHID2_REVISION_Pos (4UL)           /*!< Position of REVISION field.                                          */
  #define ETR_PERIPHID2_REVISION_Msk (0xFUL << ETR_PERIPHID2_REVISION_Pos) /*!< Bit mask of REVISION field.                    */


/* ETR_PERIPHID3: Peripheral ID3 Register */
  #define ETR_PERIPHID3_ResetValue (0x00000000UL)    /*!< Reset value of PERIPHID3 register.                                   */

/* CUSTOMER_MODIFIED @Bits 0..3 : Where the component is reusable IP, this value indicates if the customer has modified the
                                  behavior of the component. In most cases this field is zero. */

  #define ETR_PERIPHID3_CUSTOMER_MODIFIED_Pos (0UL)  /*!< Position of CUSTOMER_MODIFIED field.                                 */
  #define ETR_PERIPHID3_CUSTOMER_MODIFIED_Msk (0xFUL << ETR_PERIPHID3_CUSTOMER_MODIFIED_Pos) /*!< Bit mask of CUSTOMER_MODIFIED
                                                                            field.*/

/* REVAND @Bits 4..7 : This field indicates minor errata fixes specific to this design, for example metal fixes after
                       implementation. In most cases this field is zero. It is recommended that component designers ensure this
                       field can be changed by a metal fix if required, for example by driving it from registers that reset to
                       zero. */

  #define ETR_PERIPHID3_REVAND_Pos (4UL)             /*!< Position of REVAND field.                                            */
  #define ETR_PERIPHID3_REVAND_Msk (0xFUL << ETR_PERIPHID3_REVAND_Pos) /*!< Bit mask of REVAND field.                          */


/* ETR_COMPID0: Component ID0 Register */
  #define ETR_COMPID0_ResetValue (0x0000000DUL)      /*!< Reset value of COMPID0 register.                                     */

/* PREAMBLE @Bits 0..7 : Contains bits [7:0] of the component identification */
  #define ETR_COMPID0_PREAMBLE_Pos (0UL)             /*!< Position of PREAMBLE field.                                          */
  #define ETR_COMPID0_PREAMBLE_Msk (0xFFUL << ETR_COMPID0_PREAMBLE_Pos) /*!< Bit mask of PREAMBLE field.                       */


/* ETR_COMPID1: Component ID1 Register */
  #define ETR_COMPID1_ResetValue (0x00000090UL)      /*!< Reset value of COMPID1 register.                                     */

/* PREAMBLE @Bits 0..3 : Contains bits [11:8] of the component identification */
  #define ETR_COMPID1_PREAMBLE_Pos (0UL)             /*!< Position of PREAMBLE field.                                          */
  #define ETR_COMPID1_PREAMBLE_Msk (0xFUL << ETR_COMPID1_PREAMBLE_Pos) /*!< Bit mask of PREAMBLE field.                        */

/* CLASS @Bits 4..7 : Class of the component. E.g. ROM table, CoreSight component etc. Constitutes bits [15:12] of the component
                      identification. */

