NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
  #define ETR_COMPID1_CLASS_Pos (4UL)                /*!< Position of CLASS field.                                             */
  #define ETR_COMPID1_CLASS_Msk (0xFUL << ETR_COMPID1_CLASS_Pos) /*!< Bit mask of CLASS field.                                 */


/* ETR_COMPID2: Component ID2 Register */
  #define ETR_COMPID2_ResetValue (0x00000005UL)      /*!< Reset value of COMPID2 register.                                     */

/* PREAMBLE @Bits 0..7 : Contains bits [23:16] of the component identification */
  #define ETR_COMPID2_PREAMBLE_Pos (0UL)             /*!< Position of PREAMBLE field.                                          */
  #define ETR_COMPID2_PREAMBLE_Msk (0xFFUL << ETR_COMPID2_PREAMBLE_Pos) /*!< Bit mask of PREAMBLE field.                       */


/* ETR_COMPID3: Component ID3 Register */
  #define ETR_COMPID3_ResetValue (0x000000B1UL)      /*!< Reset value of COMPID3 register.                                     */

/* PREAMBLE @Bits 0..7 : Contains bits [31:24] of the component identification */
  #define ETR_COMPID3_PREAMBLE_Pos (0UL)             /*!< Position of PREAMBLE field.                                          */
  #define ETR_COMPID3_PREAMBLE_Msk (0xFFUL << ETR_COMPID3_PREAMBLE_Pos) /*!< Bit mask of PREAMBLE field.                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           EXMIF                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct EXMIF_EXTCONF1 ================================================== */
/**
  * @brief EXTCONF1 [EXMIF_EXTCONF1] Configuration for external memory device 1.
  */
typedef struct {
  __IOM uint32_t  OFFSET;                            /*!< (@ 0x00000000) Address offset for external memory device 1.          */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Upper address range for external memory device 1.     */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000010) Enable or disable external memory access.             */
} NRF_EXMIF_EXTCONF1_Type;                           /*!< Size = 20 (0x014)                                                    */

/* EXMIF_EXTCONF1_OFFSET: Address offset for external memory device 1. */
  #define EXMIF_EXTCONF1_OFFSET_ResetValue (0x00000000UL) /*!< Reset value of OFFSET register.                                 */

/* OFFSET @Bits 0..31 : External memory Offset. */
  #define EXMIF_EXTCONF1_OFFSET_OFFSET_Pos (0UL)     /*!< Position of OFFSET field.                                            */
  #define EXMIF_EXTCONF1_OFFSET_OFFSET_Msk (0xFFFFFFFFUL << EXMIF_EXTCONF1_OFFSET_OFFSET_Pos) /*!< Bit mask of OFFSET field.   */
  #define EXMIF_EXTCONF1_OFFSET_OFFSET_Min (0x00000000UL) /*!< Min value of OFFSET field.                                      */
  #define EXMIF_EXTCONF1_OFFSET_OFFSET_Max (0xFFFFFFFFUL) /*!< Max size of OFFSET field.                                       */


/* EXMIF_EXTCONF1_SIZE: Upper address range for external memory device 1. */
  #define EXMIF_EXTCONF1_SIZE_ResetValue (0x0FFFFFFFUL) /*!< Reset value of SIZE register.                                     */

/* SIZE @Bits 0..31 : Upper limit address. */
  #define EXMIF_EXTCONF1_SIZE_SIZE_Pos (0UL)         /*!< Position of SIZE field.                                              */
  #define EXMIF_EXTCONF1_SIZE_SIZE_Msk (0xFFFFFFFFUL << EXMIF_EXTCONF1_SIZE_SIZE_Pos) /*!< Bit mask of SIZE field.             */
  #define EXMIF_EXTCONF1_SIZE_SIZE_Min (0x00000000UL) /*!< Min value of SIZE field.                                            */
  #define EXMIF_EXTCONF1_SIZE_SIZE_Max (0xFFFFFFFFUL) /*!< Max size of SIZE field.                                             */


/* EXMIF_EXTCONF1_ENABLE: Enable or disable external memory access. */
  #define EXMIF_EXTCONF1_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                 */

/* ENABLE @Bit 0 : Enable or disable external memory access from AXI interface. */
  #define EXMIF_EXTCONF1_ENABLE_ENABLE_Pos (0UL)     /*!< Position of ENABLE field.                                            */
  #define EXMIF_EXTCONF1_ENABLE_ENABLE_Msk (0x1UL << EXMIF_EXTCONF1_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.          */
  #define EXMIF_EXTCONF1_ENABLE_ENABLE_Min (0x0UL)   /*!< Min enumerator value of ENABLE field.                                */
  #define EXMIF_EXTCONF1_ENABLE_ENABLE_Max (0x1UL)   /*!< Max enumerator value of ENABLE field.                                */
  #define EXMIF_EXTCONF1_ENABLE_ENABLE_Disabled (0x0UL) /*!< Disable external memory.                                          */
  #define EXMIF_EXTCONF1_ENABLE_ENABLE_Enabled (0x1UL) /*!< Enable external memory.                                            */



/* ================================================== Struct EXMIF_EXTCONF2 ================================================== */
/**
  * @brief EXTCONF2 [EXMIF_EXTCONF2] Configuration for external memory device 2.
  */
typedef struct {
  __IOM uint32_t  OFFSET;                            /*!< (@ 0x00000000) Address offset for external memory device 2.          */
  __IOM uint32_t  SIZE;                              /*!< (@ 0x00000004) Upper address range for external memory device 2.     */
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000018) Enable or disable external memory access.             */
} NRF_EXMIF_EXTCONF2_Type;                           /*!< Size = 28 (0x01C)                                                    */

/* EXMIF_EXTCONF2_OFFSET: Address offset for external memory device 2. */
  #define EXMIF_EXTCONF2_OFFSET_ResetValue (0x00000000UL) /*!< Reset value of OFFSET register.                                 */

