NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MHS @Bit 2 : Microwire Handshaking. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Pos (2UL)  /*!< Position of MHS field.                                               */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MHS_Pos) /*!< Bit mask of MHS field.       */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Min (0x0UL) /*!< Min enumerator value of MHS field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Max (0x1UL) /*!< Max enumerator value of MHS field.                                  */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_DISABLE (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_ENABLED (0x1UL) /*!< (unspecified)                                                   */


/* EXMIF_CORE_SSICADDRESS_SER: This register is valid only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_SER_ResetValue (0x00000000UL) /*!< Reset value of SER register.                               */

/* SER @Bits 0..1 : Slave Select Enable Flag. */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Pos (0UL)   /*!< Position of SER field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SER_SER_Pos) /*!< Bit mask of SER field.         */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Min (0x0UL) /*!< Min enumerator value of SER field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Max (0x1UL) /*!< Max enumerator value of SER field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_NOTSELECTED (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_SELECTED (0x1UL) /*!< (unspecified)                                                   */


/* EXMIF_CORE_SSICADDRESS_BAUDR: This register is valid only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_ResetValue (0x00000000UL) /*!< Reset value of BAUDR register.                           */

/* SCKDV @Bits 1..15 : SSI Clock Divider. */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Pos (1UL) /*!< Position of SCKDV field.                                           */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Msk (0x7FFFUL << EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Pos) /*!< Bit mask of SCKDV
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_TXFTLR: This register controls the threshold value for the transmit FIFO memory.. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_ResetValue (0x00000000UL) /*!< Reset value of TXFTLR register.                         */

/* TFT @Bits 0..4 : Transmit FIFO Threshold. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Pos (0UL) /*!< Position of TFT field.                                              */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Pos) /*!< Bit mask of TFT field.  */

/* TXFTHR @Bits 16..20 : Transfer start FIFO level. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Pos (16UL) /*!< Position of TXFTHR field.                                       */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Pos) /*!< Bit mask of TXFTHR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_RXFTLR: This register controls the threshold value for the receive FIFO memory.. */
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_ResetValue (0x00000000UL) /*!< Reset value of RXFTLR register.                         */

/* RFT @Bits 0..4 : Receive FIFO Threshold. */
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Pos (0UL) /*!< Position of RFT field.                                              */
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Pos) /*!< Bit mask of RFT field.  */


/* EXMIF_CORE_SSICADDRESS_TXFLR: This register contains the number of valid data entries in the transmit FIFO memory. */
  #define EXMIF_CORE_SSICADDRESS_TXFLR_ResetValue (0x00000000UL) /*!< Reset value of TXFLR register.                           */

/* TXTFL @Bits 0..5 : Transmit FIFO Level. */
  #define EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Pos (0UL) /*!< Position of TXTFL field.                                           */
  #define EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Msk (0x3FUL << EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Pos) /*!< Bit mask of TXTFL
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_RXFLR: This register contains the number of valid data entries in the receive FIFO memory. */
  #define EXMIF_CORE_SSICADDRESS_RXFLR_ResetValue (0x00000000UL) /*!< Reset value of RXFLR register.                           */

/* RXTFL @Bits 0..5 : Receive FIFO Level. */
  #define EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Pos (0UL) /*!< Position of RXTFL field.                                           */
  #define EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Msk (0x3FUL << EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Pos) /*!< Bit mask of RXTFL
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_SR: This is a read-only register used to indicate the current transfer status, FIFO status, and any
                               transmission/reception errors that may have occurred. */

  #define EXMIF_CORE_SSICADDRESS_SR_ResetValue (0x00000006UL) /*!< Reset value of SR register.                                 */

/* BUSY @Bit 0 : SSI Busy Flag. */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Pos (0UL)   /*!< Position of BUSY field.                                              */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_BUSY_Pos) /*!< Bit mask of BUSY field.        */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_INACTIVE (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_ACTIVE (0x1UL) /*!< (unspecified)                                                     */

/* TFNF @Bit 1 : Transmit FIFO Not Full. */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Pos (1UL)   /*!< Position of TFNF field.                                              */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TFNF_Pos) /*!< Bit mask of TFNF field.        */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Min (0x0UL) /*!< Min enumerator value of TFNF field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Max (0x1UL) /*!< Max enumerator value of TFNF field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_FULL (0x0UL) /*!< (unspecified)                                                       */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_NOT_FULL (0x1UL) /*!< (unspecified)                                                   */

