NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TFE @Bit 2 : Transmit FIFO Empty. */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Pos (2UL)    /*!< Position of TFE field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TFE_Pos) /*!< Bit mask of TFE field.           */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Min (0x0UL)  /*!< Min enumerator value of TFE field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Max (0x1UL)  /*!< Max enumerator value of TFE field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_NOT_EMPTY (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_EMPTY (0x1UL) /*!< (unspecified)                                                       */

/* RFNE @Bit 3 : Receive FIFO Not Empty. */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Pos (3UL)   /*!< Position of RFNE field.                                              */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_RFNE_Pos) /*!< Bit mask of RFNE field.        */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Min (0x0UL) /*!< Min enumerator value of RFNE field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Max (0x1UL) /*!< Max enumerator value of RFNE field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_EMPTY (0x0UL) /*!< (unspecified)                                                      */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_NOT_EMPTY (0x1UL) /*!< (unspecified)                                                  */

/* RFF @Bit 4 : Receive FIFO Full. */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Pos (4UL)    /*!< Position of RFF field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_RFF_Pos) /*!< Bit mask of RFF field.           */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Min (0x0UL)  /*!< Min enumerator value of RFF field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Max (0x1UL)  /*!< Max enumerator value of RFF field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_NOT_FULL (0x0UL) /*!< (unspecified)                                                    */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_FULL (0x1UL) /*!< (unspecified)                                                        */

/* TXE @Bit 5 : Transmission Error. */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Pos (5UL)    /*!< Position of TXE field.                                               */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TXE_Pos) /*!< Bit mask of TXE field.           */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Min (0x0UL)  /*!< Min enumerator value of TXE field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Max (0x1UL)  /*!< Max enumerator value of TXE field.                                   */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_NO_ERROR (0x0UL) /*!< (unspecified)                                                    */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_TX_ERROR (0x1UL) /*!< (unspecified)                                                    */

/* DCOL @Bit 6 : Data Collision Error. */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Pos (6UL)   /*!< Position of DCOL field.                                              */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_DCOL_Pos) /*!< Bit mask of DCOL field.        */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Min (0x0UL) /*!< Min enumerator value of DCOL field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Max (0x1UL) /*!< Max enumerator value of DCOL field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_NO_ERROR_CONDITION (0x0UL) /*!< (unspecified)                                         */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_TX_COLLISION_ERROR (0x1UL) /*!< (unspecified)                                         */


/* EXMIF_CORE_SSICADDRESS_IMR: This read/write register masks or enables all interrupts generated by the DWC_ssi. */
  #define EXMIF_CORE_SSICADDRESS_IMR_ResetValue (0x000000FFUL) /*!< Reset value of IMR register.                               */

/* TXEIM @Bit 0 : Transmit FIFO Empty Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Pos (0UL) /*!< Position of TXEIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Pos) /*!< Bit mask of TXEIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Min (0x0UL) /*!< Min enumerator value of TXEIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Max (0x1UL) /*!< Max enumerator value of TXEIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* TXOIM @Bit 1 : Transmit FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Pos (1UL) /*!< Position of TXOIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Pos) /*!< Bit mask of TXOIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Min (0x0UL) /*!< Min enumerator value of TXOIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Max (0x1UL) /*!< Max enumerator value of TXOIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* RXUIM @Bit 2 : Receive FIFO Underflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Pos (2UL) /*!< Position of RXUIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Pos) /*!< Bit mask of RXUIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Min (0x0UL) /*!< Min enumerator value of RXUIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Max (0x1UL) /*!< Max enumerator value of RXUIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* RXOIM @Bit 3 : Receive FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Pos (3UL) /*!< Position of RXOIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Pos) /*!< Bit mask of RXOIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Min (0x0UL) /*!< Min enumerator value of RXOIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Max (0x1UL) /*!< Max enumerator value of RXOIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* RXFIM @Bit 4 : Receive FIFO Full Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Pos (4UL) /*!< Position of RXFIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Pos) /*!< Bit mask of RXFIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Min (0x0UL) /*!< Min enumerator value of RXFIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Max (0x1UL) /*!< Max enumerator value of RXFIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_MASKED (0x0UL) /*!< ssi_rxf_intr interrupt is masked                                */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_UNMASKED (0x1UL) /*!< ssi_rxf_intr interrupt is not masked                          */

