NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MSTIM @Bit 5 : Multi-Master Contention Interrupt Mask. */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Pos (5UL) /*!< Position of MSTIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Pos) /*!< Bit mask of MSTIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Min (0x0UL) /*!< Min enumerator value of MSTIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Max (0x1UL) /*!< Max enumerator value of MSTIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* XRXOIM @Bit 6 : XIP Receive FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Pos (6UL) /*!< Position of XRXOIM field.                                           */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Pos) /*!< Bit mask of XRXOIM field.*/
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Min (0x0UL) /*!< Min enumerator value of XRXOIM field.                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Max (0x1UL) /*!< Max enumerator value of XRXOIM field.                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_MASKED (0x0UL) /*!< (unspecified)                                                  */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_UNMASKED (0x1UL) /*!< (unspecified)                                                */

/* TXUIM @Bit 7 : Transmit FIFO Underflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Pos (7UL) /*!< Position of TXUIM field.                                             */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Pos) /*!< Bit mask of TXUIM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Min (0x0UL) /*!< Min enumerator value of TXUIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Max (0x1UL) /*!< Max enumerator value of TXUIM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */

/* DONEM @Bit 11 : SSI Done Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Pos (11UL) /*!< Position of DONEM field.                                            */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_DONEM_Pos) /*!< Bit mask of DONEM field.   */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Min (0x0UL) /*!< Min enumerator value of DONEM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Max (0x1UL) /*!< Max enumerator value of DONEM field.                               */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_MASKED (0x0UL) /*!< (unspecified)                                                   */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_UNMASKED (0x1UL) /*!< (unspecified)                                                 */


/* EXMIF_CORE_SSICADDRESS_ISR: This register reports the status of the DWC_ssi interrupts after they have been masked. */
  #define EXMIF_CORE_SSICADDRESS_ISR_ResetValue (0x00000000UL) /*!< Reset value of ISR register.                               */

/* TXEIS @Bit 0 : Transmit FIFO Empty Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Pos (0UL) /*!< Position of TXEIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Pos) /*!< Bit mask of TXEIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Min (0x0UL) /*!< Min enumerator value of TXEIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Max (0x1UL) /*!< Max enumerator value of TXEIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* TXOIS @Bit 1 : Transmit FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Pos (1UL) /*!< Position of TXOIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Pos) /*!< Bit mask of TXOIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Min (0x0UL) /*!< Min enumerator value of TXOIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Max (0x1UL) /*!< Max enumerator value of TXOIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* RXUIS @Bit 2 : Receive FIFO Underflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Pos (2UL) /*!< Position of RXUIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Pos) /*!< Bit mask of RXUIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Min (0x0UL) /*!< Min enumerator value of RXUIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Max (0x1UL) /*!< Max enumerator value of RXUIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

