NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RXOIS @Bit 3 : Receive FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Pos (3UL) /*!< Position of RXOIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Pos) /*!< Bit mask of RXOIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Min (0x0UL) /*!< Min enumerator value of RXOIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Max (0x1UL) /*!< Max enumerator value of RXOIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* RXFIS @Bit 4 : Receive FIFO Full Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Pos (4UL) /*!< Position of RXFIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Pos) /*!< Bit mask of RXFIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Min (0x0UL) /*!< Min enumerator value of RXFIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Max (0x1UL) /*!< Max enumerator value of RXFIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* MSTIS @Bit 5 : Multi-Master Contention Interrupt Status. */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Pos (5UL) /*!< Position of MSTIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Pos) /*!< Bit mask of MSTIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Min (0x0UL) /*!< Min enumerator value of MSTIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Max (0x1UL) /*!< Max enumerator value of MSTIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* XRXOIS @Bit 6 : XIP Receive FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Pos (6UL) /*!< Position of XRXOIS field.                                           */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Pos) /*!< Bit mask of XRXOIS field.*/
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Min (0x0UL) /*!< Min enumerator value of XRXOIS field.                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Max (0x1UL) /*!< Max enumerator value of XRXOIS field.                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* TXUIS @Bit 7 : Transmit FIFO Underflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Pos (7UL) /*!< Position of TXUIS field.                                             */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Pos) /*!< Bit mask of TXUIS field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Min (0x0UL) /*!< Min enumerator value of TXUIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Max (0x1UL) /*!< Max enumerator value of TXUIS field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_ACTIVE (0x1UL) /*!< (unspecified)                                                   */

/* DONES @Bit 11 : SSI Done Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Pos (11UL) /*!< Position of DONES field.                                            */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_DONES_Pos) /*!< Bit mask of DONES field.   */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Min (0x0UL) /*!< Min enumerator value of DONES field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Max (0x1UL) /*!< Max enumerator value of DONES field.                               */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_INACTIVE (0x0UL) /*!< (unspecified)                                                 */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_ACTIVE (0x1UL) /*!< (unspecified)                                                   */


/* EXMIF_CORE_SSICADDRESS_RISR: Raw Interrupt Status Register */
  #define EXMIF_CORE_SSICADDRESS_RISR_ResetValue (0x00000000UL) /*!< Reset value of RISR register.                             */

/* TXEIR @Bit 0 : Transmit FIFO Empty Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Pos (0UL) /*!< Position of TXEIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Pos) /*!< Bit mask of TXEIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Min (0x0UL) /*!< Min enumerator value of TXEIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Max (0x1UL) /*!< Max enumerator value of TXEIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* TXOIR @Bit 1 : Transmit FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Pos (1UL) /*!< Position of TXOIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Pos) /*!< Bit mask of TXOIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Min (0x0UL) /*!< Min enumerator value of TXOIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Max (0x1UL) /*!< Max enumerator value of TXOIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* RXUIR @Bit 2 : Receive FIFO Underflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Pos (2UL) /*!< Position of RXUIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Pos) /*!< Bit mask of RXUIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Min (0x0UL) /*!< Min enumerator value of RXUIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Max (0x1UL) /*!< Max enumerator value of RXUIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* RXOIR @Bit 3 : Receive FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Pos (3UL) /*!< Position of RXOIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Pos) /*!< Bit mask of RXOIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Min (0x0UL) /*!< Min enumerator value of RXOIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Max (0x1UL) /*!< Max enumerator value of RXOIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* RXFIR @Bit 4 : Receive FIFO Full Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Pos (4UL) /*!< Position of RXFIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Pos) /*!< Bit mask of RXFIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Min (0x0UL) /*!< Min enumerator value of RXFIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Max (0x1UL) /*!< Max enumerator value of RXFIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

