NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MSTIR @Bit 5 : Multi-Master Contention Raw Interrupt Status. */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Pos (5UL) /*!< Position of MSTIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Pos) /*!< Bit mask of MSTIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Min (0x0UL) /*!< Min enumerator value of MSTIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Max (0x1UL) /*!< Max enumerator value of MSTIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* XRXOIR @Bit 6 : XIP Receive FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Pos (6UL) /*!< Position of XRXOIR field.                                          */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Pos) /*!< Bit mask of XRXOIR
                                                                            field.*/
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Min (0x0UL) /*!< Min enumerator value of XRXOIR field.                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Max (0x1UL) /*!< Max enumerator value of XRXOIR field.                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_INACTIVE (0x0UL) /*!< (unspecified)                                               */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_ACTIVE (0x1UL) /*!< (unspecified)                                                 */

/* TXUIR @Bit 7 : Transmit FIFO Underflow Interrupt Raw Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Pos (7UL) /*!< Position of TXUIR field.                                            */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Pos) /*!< Bit mask of TXUIR field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Min (0x0UL) /*!< Min enumerator value of TXUIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Max (0x1UL) /*!< Max enumerator value of TXUIR field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_ACTIVE (0x1UL) /*!< (unspecified)                                                  */

/* DONER @Bit 11 : SSI Done Interrupt Raw Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_Pos (11UL) /*!< Position of DONER field.                                           */
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_DONER_Pos) /*!< Bit mask of DONER field. */
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_Min (0x0UL) /*!< Min enumerator value of DONER field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_Max (0x1UL) /*!< Max enumerator value of DONER field.                              */
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_INACTIVE (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_ACTIVE (0x1UL) /*!< (unspecified)                                                  */


/* EXMIF_CORE_SSICADDRESS_TXEICR: Transmit FIFO Error Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_TXEICR_ResetValue (0x00000000UL) /*!< Reset value of TXEICR register.                         */

/* TXEICR @Bit 0 : Clear Transmit FIFO Overflow/Underflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Pos (0UL) /*!< Position of TXEICR field.                                        */
  #define EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Pos) /*!< Bit mask of TXEICR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_RXOICR: Receive FIFO Overflow Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_RXOICR_ResetValue (0x00000000UL) /*!< Reset value of RXOICR register.                         */

/* RXOICR @Bit 0 : Clear Receive FIFO Overflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Pos (0UL) /*!< Position of RXOICR field.                                        */
  #define EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Pos) /*!< Bit mask of RXOICR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_RXUICR: Receive FIFO Underflow Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_RXUICR_ResetValue (0x00000000UL) /*!< Reset value of RXUICR register.                         */

/* RXUICR @Bit 0 : Clear Receive FIFO Underflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Pos (0UL) /*!< Position of RXUICR field.                                        */
  #define EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Pos) /*!< Bit mask of RXUICR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_MSTICR: Multi-Master Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_ResetValue (0x00000000UL) /*!< Reset value of MSTICR register.                         */

/* MSTICR @Bit 0 : Clear Multi-Master Contention Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Pos (0UL) /*!< Position of MSTICR field.                                        */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Pos) /*!< Bit mask of MSTICR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_ICR: Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_ICR_ResetValue (0x00000000UL) /*!< Reset value of ICR register.                               */

/* ICR @Bit 0 : Clear Interrupts. */
  #define EXMIF_CORE_SSICADDRESS_ICR_ICR_Pos (0UL)   /*!< Position of ICR field.                                               */
  #define EXMIF_CORE_SSICADDRESS_ICR_ICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ICR_ICR_Pos) /*!< Bit mask of ICR field.         */


