NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* XIPMDBITEN @Bit 7 : Mode bits enable in XIP mode. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Pos (7UL) /*!< Position of XIPMDBITEN field.                             */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Pos) /*!< Bit
                                                                            mask of XIPMDBITEN field.*/

/* INSTL @Bits 8..9 : Dual/Quad/Octal mode instruction length in bits. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Pos (8UL) /*!< Position of INSTL field.                                       */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Pos) /*!< Bit mask of
                                                                            INSTL field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Min (0x0UL) /*!< Min enumerator value of INSTL field.                         */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Max (0x3UL) /*!< Max enumerator value of INSTL field.                         */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L0 (0x0UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L4 (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L8 (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L16 (0x3UL) /*!< (unspecified)                                           */

/* WAITCYCLES @Bits 11..15 : Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Pos (11UL) /*!< Position of WAITCYCLES field.                            */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Pos) /*!< Bit
                                                                            mask of WAITCYCLES field.*/

/* SPIDDREN @Bit 16 : SPI DDR Enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Pos (16UL) /*!< Position of SPIDDREN field.                                */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Pos) /*!< Bit mask
                                                                            of SPIDDREN field.*/

/* INSTDDREN @Bit 17 : Instruction DDR Enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Pos (17UL) /*!< Position of INSTDDREN field.                              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Pos) /*!< Bit mask
                                                                            of INSTDDREN field.*/

/* SPIRXDSEN @Bit 18 : Read data strobe enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Pos (18UL) /*!< Position of SPIRXDSEN field.                              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Pos) /*!< Bit mask
                                                                            of SPIRXDSEN field.*/

/* XIPDFSHC @Bit 19 : Fix DFS for XIP transfers. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Pos (19UL) /*!< Position of XIPDFSHC field.                                */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Pos) /*!< Bit mask
                                                                            of XIPDFSHC field.*/

/* XIPINSTEN @Bit 20 : XIP instruction enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPINSTEN_Pos (20UL) /*!< Position of XIPINSTEN field.                              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPINSTEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPINSTEN_Pos) /*!< Bit mask
                                                                            of XIPINSTEN field.*/

/* SSICXIPCONTXFEREN @Bit 21 : Enable continuous transfer in XIP mode. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SSICXIPCONTXFEREN_Pos (21UL) /*!< Position of SSICXIPCONTXFEREN field.              */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SSICXIPCONTXFEREN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SSICXIPCONTXFEREN_Pos)
                                                                            /*!< Bit mask of SSICXIPCONTXFEREN field.*/

/* SPIDMEN @Bit 24 : SPI data mask enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDMEN_Pos (24UL) /*!< Position of SPIDMEN field.                                  */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDMEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDMEN_Pos) /*!< Bit mask of
                                                                            SPIDMEN field.*/

/* SPIRXDSSIGEN @Bit 25 : Enable rxds signaling during address and command phase of Hyperbus transfer. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSSIGEN_Pos (25UL) /*!< Position of SPIRXDSSIGEN field.                        */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSSIGEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSSIGEN_Pos) /*!<
                                                                            Bit mask of SPIRXDSSIGEN field.*/

/* XIPMBL @Bits 26..27 : XIP Mode bits length. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Pos (26UL) /*!< Position of XIPMBL field.                                    */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Pos) /*!< Bit mask of
                                                                            XIPMBL field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Min (0x0UL) /*!< Min enumerator value of XIPMBL field.                       */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_Max (0x3UL) /*!< Max enumerator value of XIPMBL field.                       */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_MBL_2 (0x0UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_MBL_4 (0x1UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_MBL_8 (0x2UL) /*!< (unspecified)                                             */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMBL_MBL_16 (0x3UL) /*!< (unspecified)                                            */

/* XIPPREFETCHEN @Bit 29 : Enables XIP pre-fetch functionality in DWC_ssi. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPPREFETCHEN_Pos (29UL) /*!< Position of XIPPREFETCHEN field.                      */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPPREFETCHEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPPREFETCHEN_Pos) /*!<
                                                                            Bit mask of XIPPREFETCHEN field.*/

/* CLKSTRETCHEN @Bit 30 : Enables clock stretching capability in SPI transfers. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_CLKSTRETCHEN_Pos (30UL) /*!< Position of CLKSTRETCHEN field.                        */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_CLKSTRETCHEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_CLKSTRETCHEN_Pos) /*!<
                                                                            Bit mask of CLKSTRETCHEN field.*/


/* EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE: This Register is valid only when SSIC_HAS_DDR is equal to 1. */
  #define EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_ResetValue (0x00000000UL) /*!< Reset value of DDRDRIVEEDGE register.             */

/* TDE @Bits 0..7 : TXD Drive edge register which decided the driving edge of transmit data. */
  #define EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_TDE_Pos (0UL) /*!< Position of TDE field.                                        */
  #define EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_TDE_Msk (0xFFUL << EXMIF_CORE_SSICADDRESS_DDRDRIVEEDGE_TDE_Pos) /*!< Bit mask of
                                                                            TDE field.*/


/* EXMIF_CORE_SSICADDRESS_XIPMODEBITS: This register carries the mode bits which are sent in the XIP mode of operation after
                                        address phase. */

  #define EXMIF_CORE_SSICADDRESS_XIPMODEBITS_ResetValue (0x00000000UL) /*!< Reset value of XIPMODEBITS register.               */

/* XIPMDBITS @Bits 0..15 : XIP mode bits to be sent after address phase of XIP transfer. */
  #define EXMIF_CORE_SSICADDRESS_XIPMODEBITS_XIPMDBITS_Pos (0UL) /*!< Position of XIPMDBITS field.                             */
  #define EXMIF_CORE_SSICADDRESS_XIPMODEBITS_XIPMDBITS_Msk (0xFFFFUL << EXMIF_CORE_SSICADDRESS_XIPMODEBITS_XIPMDBITS_Pos) /*!<
                                                                            Bit mask of XIPMDBITS field.*/



/* ============================================ Struct EXMIF_CORE_SSICXIPADDRESS ============================================= */
/**
  * @brief SSICXIPADDRESS [EXMIF_CORE_SSICXIPADDRESS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  XIPINCRINST;                       /*!< (@ 0x00000000) This Register is valid only when SSIC_XIP_EN is equal
                                                                         to 1.*/
  __IOM uint32_t  XIPWRAPINST;                       /*!< (@ 0x00000004) This Register is valid only when SSIC_XIP_EN is equal
                                                                         to 1.*/
  __IOM uint32_t  XIPCTRL;                           /*!< (@ 0x00000008) This Register is valid only when SSIC_CONCURRENT_XIP_EN
                                                                         is equal to 1.*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  XRXOICR;                           /*!< (@ 0x00000010) XIP Receive FIFO Overflow Interrupt Clear Register    */
  __IM  uint32_t  RESERVED1[11];
  __IOM uint32_t  XIPWRITEINCRINST;                  /*!< (@ 0x00000040) This Register is valid only when both
                                                                         SSIC_XIP_WRITE_REG_EN is set to 1.*/
  __IOM uint32_t  XIPWRITEWRAPINST;                  /*!< (@ 0x00000044) This Register is valid only when both
                                                                         SSIC_XIP_WRITE_REG_EN is set to 1.*/
  __IOM uint32_t  XIPWRITECTRL;                      /*!< (@ 0x00000048) This Register is valid only when SSIC_XIP_WRITE_REG_EN
                                                                         is equal to 1.*/
} NRF_EXMIF_CORE_SSICXIPADDRESS_Type;                /*!< Size = 76 (0x04C)                                                    */

/* EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST: This Register is valid only when SSIC_XIP_EN is equal to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_ResetValue (0x00000000UL) /*!< Reset value of XIPINCRINST register.            */

/* INCRINST @Bits 0..15 : XIP INCR transfer opcode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_INCRINST_Pos (0UL) /*!< Position of INCRINST field.                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_INCRINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPINCRINST_INCRINST_Pos)
                                                                            /*!< Bit mask of INCRINST field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST: This Register is valid only when SSIC_XIP_EN is equal to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_ResetValue (0x00000000UL) /*!< Reset value of XIPWRAPINST register.            */

/* WRAPINST @Bits 0..15 : XIP WRAP transfer opcode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_WRAPINST_Pos (0UL) /*!< Position of WRAPINST field.                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_WRAPINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRAPINST_WRAPINST_Pos)
                                                                            /*!< Bit mask of WRAPINST field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPCTRL: This Register is valid only when SSIC_CONCURRENT_XIP_EN is equal to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ResetValue (0x08000401UL) /*!< Reset value of XIPCTRL register.                    */

/* FRF @Bits 0..1 : SPI Frame Format */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Pos (0UL) /*!< Position of FRF field.                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Pos) /*!< Bit mask of FRF
                                                                            field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Min (0x0UL) /*!< Min enumerator value of FRF field.                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_Max (0x3UL) /*!< Max enumerator value of FRF field.                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_RSVD (0x0UL) /*!< (unspecified)                                                */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_SPI_DUAL (0x1UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_SPI_QUAD (0x2UL) /*!< (unspecified)                                            */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_FRF_SPI_OCTAL (0x3UL) /*!< (unspecified)                                           */

/* TRANSTYPE @Bits 2..3 : Address and instruction transfer format. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Pos (2UL) /*!< Position of TRANSTYPE field.                              */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Pos) /*!< Bit
                                                                            mask of TRANSTYPE field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Min (0x0UL) /*!< Min enumerator value of TRANSTYPE field.                */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_Max (0x3UL) /*!< Max enumerator value of TRANSTYPE field.                */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_TT0 (0x0UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_TT1 (0x1UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_TT2 (0x2UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_TRANSTYPE_TT3 (0x3UL) /*!< (unspecified)                                           */

/* ADDRL @Bits 4..7 : This bit defines Length of Address to be transmitted. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Pos (4UL) /*!< Position of ADDRL field.                                      */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Msk (0xFUL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Pos) /*!< Bit mask of
                                                                            ADDRL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Min (0x0UL) /*!< Min enumerator value of ADDRL field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_Max (0xFUL) /*!< Max enumerator value of ADDRL field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L0 (0x0UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L4 (0x1UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L8 (0x2UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L12 (0x3UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L16 (0x4UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L20 (0x5UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L24 (0x6UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L28 (0x7UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L32 (0x8UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L36 (0x9UL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L40 (0xAUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L44 (0xBUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L48 (0xCUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L52 (0xDUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L56 (0xEUL) /*!< (unspecified)                                          */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_ADDRL_ADDR_L60 (0xFUL) /*!< (unspecified)                                          */

/* INSTL @Bits 9..10 : Dual/Quad/Octal mode instruction length in bits. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Pos (9UL) /*!< Position of INSTL field.                                      */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Pos) /*!< Bit mask of
                                                                            INSTL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Min (0x0UL) /*!< Min enumerator value of INSTL field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_Max (0x3UL) /*!< Max enumerator value of INSTL field.                        */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_INST_L0 (0x0UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_INST_L4 (0x1UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_INST_L8 (0x2UL) /*!< (unspecified)                                           */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTL_INST_L16 (0x3UL) /*!< (unspecified)                                          */

