NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RSVDWRAPINST16TO31 @Bits 16..31 : Reserved bits - Read Only */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_RSVDWRAPINST16TO31_Pos (16UL) /*!< Position of RSVDWRAPINST16TO31 field.  */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_RSVDWRAPINST16TO31_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_RSVDWRAPINST16TO31_Pos)
                                                                            /*!< Bit mask of RSVDWRAPINST16TO31 field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL: This Register is valid only when SSIC_XIP_WRITE_REG_EN is equal to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_ResetValue (0x00000002UL) /*!< Reset value of XIPWRITECTRL register.          */

/* WRFRF @Bits 0..1 : SPI Frame Format */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Pos (0UL) /*!< Position of WRFRF field.                                 */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Pos) /*!< Bit
                                                                            mask of WRFRF field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Min (0x0UL) /*!< Min enumerator value of WRFRF field.                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Max (0x3UL) /*!< Max enumerator value of WRFRF field.                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_RSVD (0x0UL) /*!< (unspecified)                                         */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_SPI_DUAL (0x1UL) /*!< (unspecified)                                     */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_SPI_QUAD (0x2UL) /*!< (unspecified)                                     */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_SPI_OCTAL (0x3UL) /*!< (unspecified)                                    */

/* WRTRANSTYPE @Bits 2..3 : Address and instruction transfer format. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Pos (2UL) /*!< Position of WRTRANSTYPE field.                     */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Pos)
                                                                            /*!< Bit mask of WRTRANSTYPE field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Min (0x0UL) /*!< Min enumerator value of WRTRANSTYPE field.       */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Max (0x3UL) /*!< Max enumerator value of WRTRANSTYPE field.       */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_TT0 (0x0UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_TT1 (0x1UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_TT2 (0x2UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_TT3 (0x3UL) /*!< (unspecified)                                    */

/* WRADDRL @Bits 4..7 : This bit defines Length of Address to be transmitted. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Pos (4UL) /*!< Position of WRADDRL field.                             */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Msk (0xFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Pos) /*!<
                                                                            Bit mask of WRADDRL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Min (0x0UL) /*!< Min enumerator value of WRADDRL field.               */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Max (0x8UL) /*!< Max enumerator value of WRADDRL field.               */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L0 (0x0UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L4 (0x1UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L8 (0x2UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L12 (0x3UL) /*!< (unspecified)                                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L16 (0x4UL) /*!< (unspecified)                                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L20 (0x5UL) /*!< (unspecified)                                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L24 (0x6UL) /*!< (unspecified)                                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L28 (0x7UL) /*!< (unspecified)                                   */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L32 (0x8UL) /*!< (unspecified)                                   */

/* WRINSTL @Bits 8..9 : Dual/Quad/Octal mode instruction length in bits. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Pos (8UL) /*!< Position of WRINSTL field.                             */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Pos) /*!<
                                                                            Bit mask of WRINSTL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Min (0x0UL) /*!< Min enumerator value of WRINSTL field.               */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Max (0x3UL) /*!< Max enumerator value of WRINSTL field.               */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_INST_L0 (0x0UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_INST_L4 (0x1UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_INST_L8 (0x2UL) /*!< (unspecified)                                    */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_INST_L16 (0x3UL) /*!< (unspecified)                                   */

