NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TASKS_START @Bit 0 : Start operation. */
  #define EXMIF_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define EXMIF_TASKS_START_TASKS_START_Msk (0x1UL << EXMIF_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define EXMIF_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define EXMIF_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define EXMIF_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* EXMIF_TASKS_STOP: Stop operation. */
  #define EXMIF_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop operation. */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Msk (0x1UL << EXMIF_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* EXMIF_EVENTS_CORE: Event indicating that interrupt triggered at EXMIF core */
  #define EXMIF_EVENTS_CORE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CORE register.                                */

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at EXMIF core */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Pos (0UL)    /*!< Position of EVENTS_CORE field.                                       */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << EXMIF_EVENTS_CORE_EVENTS_CORE_Pos) /*!< Bit mask of EVENTS_CORE field.   */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)  /*!< Min enumerator value of EVENTS_CORE field.                           */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)  /*!< Max enumerator value of EVENTS_CORE field.                           */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL) /*!< Event generated                                                 */


/* EXMIF_EVENTS_STARTED: Event indicating that the START task is completed and the EXMIF has started. */
  #define EXMIF_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                          */

/* EVENTS_STARTED @Bit 0 : Event indicating that the START task is completed and the EXMIF has started. */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                 */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << EXMIF_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                   */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                   */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                           */


/* EXMIF_INTEN: Enable or disable interrupt */
  #define EXMIF_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define EXMIF_INTEN_CORE_Pos (0UL)                 /*!< Position of CORE field.                                              */
  #define EXMIF_INTEN_CORE_Msk (0x1UL << EXMIF_INTEN_CORE_Pos) /*!< Bit mask of CORE field.                                    */
  #define EXMIF_INTEN_CORE_Min (0x0UL)               /*!< Min enumerator value of CORE field.                                  */
  #define EXMIF_INTEN_CORE_Max (0x1UL)               /*!< Max enumerator value of CORE field.                                  */
  #define EXMIF_INTEN_CORE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define EXMIF_INTEN_CORE_Enabled (0x1UL)           /*!< Enable                                                               */

/* STARTED @Bit 1 : Enable or disable interrupt for event STARTED */
  #define EXMIF_INTEN_STARTED_Pos (1UL)              /*!< Position of STARTED field.                                           */
  #define EXMIF_INTEN_STARTED_Msk (0x1UL << EXMIF_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                           */
  #define EXMIF_INTEN_STARTED_Min (0x0UL)            /*!< Min enumerator value of STARTED field.                               */
  #define EXMIF_INTEN_STARTED_Max (0x1UL)            /*!< Max enumerator value of STARTED field.                               */
  #define EXMIF_INTEN_STARTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define EXMIF_INTEN_STARTED_Enabled (0x1UL)        /*!< Enable                                                               */


/* EXMIF_INTENSET: Enable interrupt */
  #define EXMIF_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define EXMIF_INTENSET_CORE_Pos (0UL)              /*!< Position of CORE field.                                              */
  #define EXMIF_INTENSET_CORE_Msk (0x1UL << EXMIF_INTENSET_CORE_Pos) /*!< Bit mask of CORE field.                              */
  #define EXMIF_INTENSET_CORE_Min (0x0UL)            /*!< Min enumerator value of CORE field.                                  */
  #define EXMIF_INTENSET_CORE_Max (0x1UL)            /*!< Max enumerator value of CORE field.                                  */
  #define EXMIF_INTENSET_CORE_Set (0x1UL)            /*!< Enable                                                               */
  #define EXMIF_INTENSET_CORE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define EXMIF_INTENSET_CORE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

