NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* STARTED @Bit 1 : Write '1' to enable interrupt for event STARTED */
  #define EXMIF_INTENSET_STARTED_Pos (1UL)           /*!< Position of STARTED field.                                           */
  #define EXMIF_INTENSET_STARTED_Msk (0x1UL << EXMIF_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define EXMIF_INTENSET_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define EXMIF_INTENSET_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define EXMIF_INTENSET_STARTED_Set (0x1UL)         /*!< Enable                                                               */
  #define EXMIF_INTENSET_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define EXMIF_INTENSET_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* EXMIF_INTENCLR: Disable interrupt */
  #define EXMIF_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define EXMIF_INTENCLR_CORE_Pos (0UL)              /*!< Position of CORE field.                                              */
  #define EXMIF_INTENCLR_CORE_Msk (0x1UL << EXMIF_INTENCLR_CORE_Pos) /*!< Bit mask of CORE field.                              */
  #define EXMIF_INTENCLR_CORE_Min (0x0UL)            /*!< Min enumerator value of CORE field.                                  */
  #define EXMIF_INTENCLR_CORE_Max (0x1UL)            /*!< Max enumerator value of CORE field.                                  */
  #define EXMIF_INTENCLR_CORE_Clear (0x1UL)          /*!< Disable                                                              */
  #define EXMIF_INTENCLR_CORE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define EXMIF_INTENCLR_CORE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* STARTED @Bit 1 : Write '1' to disable interrupt for event STARTED */
  #define EXMIF_INTENCLR_STARTED_Pos (1UL)           /*!< Position of STARTED field.                                           */
  #define EXMIF_INTENCLR_STARTED_Msk (0x1UL << EXMIF_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define EXMIF_INTENCLR_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define EXMIF_INTENCLR_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define EXMIF_INTENCLR_STARTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define EXMIF_INTENCLR_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define EXMIF_INTENCLR_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* EXMIF_INTPEND: Pending interrupts */
  #define EXMIF_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define EXMIF_INTPEND_CORE_Pos (0UL)               /*!< Position of CORE field.                                              */
  #define EXMIF_INTPEND_CORE_Msk (0x1UL << EXMIF_INTPEND_CORE_Pos) /*!< Bit mask of CORE field.                                */
  #define EXMIF_INTPEND_CORE_Min (0x0UL)             /*!< Min enumerator value of CORE field.                                  */
  #define EXMIF_INTPEND_CORE_Max (0x1UL)             /*!< Max enumerator value of CORE field.                                  */
  #define EXMIF_INTPEND_CORE_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define EXMIF_INTPEND_CORE_Pending (0x1UL)         /*!< Read: Pending                                                        */

/* STARTED @Bit 1 : Read pending status of interrupt for event STARTED */
  #define EXMIF_INTPEND_STARTED_Pos (1UL)            /*!< Position of STARTED field.                                           */
  #define EXMIF_INTPEND_STARTED_Msk (0x1UL << EXMIF_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                       */
  #define EXMIF_INTPEND_STARTED_Min (0x0UL)          /*!< Min enumerator value of STARTED field.                               */
  #define EXMIF_INTPEND_STARTED_Max (0x1UL)          /*!< Max enumerator value of STARTED field.                               */
  #define EXMIF_INTPEND_STARTED_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define EXMIF_INTPEND_STARTED_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* EXMIF_LOCKEDACCESS: Enable or disable locked APB access to serial memory controller. */
  #define EXMIF_LOCKEDACCESS_ResetValue (0x00000000UL) /*!< Reset value of LOCKEDACCESS register.                              */

/* ENABLE @Bit 0 : Enable or disable locked APB access to SSI. */
  #define EXMIF_LOCKEDACCESS_ENABLE_Pos (0UL)        /*!< Position of ENABLE field.                                            */
  #define EXMIF_LOCKEDACCESS_ENABLE_Msk (0x1UL << EXMIF_LOCKEDACCESS_ENABLE_Pos) /*!< Bit mask of ENABLE field.                */
  #define EXMIF_LOCKEDACCESS_ENABLE_Min (0x0UL)      /*!< Min enumerator value of ENABLE field.                                */
  #define EXMIF_LOCKEDACCESS_ENABLE_Max (0x1UL)      /*!< Max enumerator value of ENABLE field.                                */
  #define EXMIF_LOCKEDACCESS_ENABLE_Disabled (0x0UL) /*!< Disable locked APB access.                                           */
  #define EXMIF_LOCKEDACCESS_ENABLE_Enabled (0x1UL)  /*!< Enable locked APB access.                                            */


/* EXMIF_RESET: Reset the external memory. */
  #define EXMIF_RESET_ResetValue (0x00000000UL)      /*!< Reset value of RESET register.                                       */

/* RESET @Bit 0 : (unspecified) */
  #define EXMIF_RESET_RESET_Pos (0UL)                /*!< Position of RESET field.                                             */
  #define EXMIF_RESET_RESET_Msk (0x1UL << EXMIF_RESET_RESET_Pos) /*!< Bit mask of RESET field.                                 */
  #define EXMIF_RESET_RESET_Min (0x0UL)              /*!< Min enumerator value of RESET field.                                 */
  #define EXMIF_RESET_RESET_Max (0x1UL)              /*!< Max enumerator value of RESET field.                                 */
  #define EXMIF_RESET_RESET_Clear (0x0UL)            /*!< Reset is cleared.                                                    */
  #define EXMIF_RESET_RESET_Set (0x1UL)              /*!< Reset is set.                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           FICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct FICR_BLE ===================================================== */
/**
  * @brief BLE [FICR_BLE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDRTYPE;                          /*!< (@ 0x00000000) Device address type.                                  */
  __IM  uint32_t  ADDR[2];                           /*!< (@ 0x00000004) 48 bit device address.                                */
  __IM  uint32_t  ER[4];                             /*!< (@ 0x0000000C) Encryption Root.                                      */
  __IM  uint32_t  IR[4];                             /*!< (@ 0x0000001C) Identity Root.                                        */
} NRF_FICR_BLE_Type;                                 /*!< Size = 44 (0x02C)                                                    */

/* FICR_BLE_ADDRTYPE: Device address type. */
  #define FICR_BLE_ADDRTYPE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDRTYPE register.                                   */

/* TYPE @Bit 0 : Device address type. */
  #define FICR_BLE_ADDRTYPE_TYPE_Pos (0UL)           /*!< Position of TYPE field.                                              */
  #define FICR_BLE_ADDRTYPE_TYPE_Msk (0x1UL << FICR_BLE_ADDRTYPE_TYPE_Pos) /*!< Bit mask of TYPE field.                        */
  #define FICR_BLE_ADDRTYPE_TYPE_Min (0x0UL)         /*!< Min enumerator value of TYPE field.                                  */
  #define FICR_BLE_ADDRTYPE_TYPE_Max (0x1UL)         /*!< Max enumerator value of TYPE field.                                  */
  #define FICR_BLE_ADDRTYPE_TYPE_Public (0x0UL)      /*!< Public address.                                                      */
  #define FICR_BLE_ADDRTYPE_TYPE_Random (0x1UL)      /*!< Random address.                                                      */


