NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* VARIANT @Bits 0..31 : Part Variant, Hardware version and Production configuration, encoded as ASCII */
  #define FICR_INFO_VARIANT_VARIANT_Pos (0UL)        /*!< Position of VARIANT field.                                           */
  #define FICR_INFO_VARIANT_VARIANT_Msk (0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos) /*!< Bit mask of VARIANT field.        */
  #define FICR_INFO_VARIANT_VARIANT_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VARIANT field.                             */
  #define FICR_INFO_VARIANT_VARIANT_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VARIANT field.                             */
  #define FICR_INFO_VARIANT_VARIANT_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                */


/* FICR_INFO_PACKAGE: Package option */
  #define FICR_INFO_PACKAGE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PACKAGE register.                                    */

/* PACKAGE @Bits 0..31 : Package option */
  #define FICR_INFO_PACKAGE_PACKAGE_Pos (0UL)        /*!< Position of PACKAGE field.                                           */
  #define FICR_INFO_PACKAGE_PACKAGE_Msk (0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos) /*!< Bit mask of PACKAGE field.        */
  #define FICR_INFO_PACKAGE_PACKAGE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PACKAGE field.                             */
  #define FICR_INFO_PACKAGE_PACKAGE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PACKAGE field.                             */
  #define FICR_INFO_PACKAGE_PACKAGE_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                */


/* FICR_INFO_RAM: RAM variant */
  #define FICR_INFO_RAM_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of RAM register.                                         */

/* RAM @Bits 0..31 : RAM variant */
  #define FICR_INFO_RAM_RAM_Pos (0UL)                /*!< Position of RAM field.                                               */
  #define FICR_INFO_RAM_RAM_Msk (0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos) /*!< Bit mask of RAM field.                            */
  #define FICR_INFO_RAM_RAM_Min (0xFFFFFFFFUL)       /*!< Min enumerator value of RAM field.                                   */
  #define FICR_INFO_RAM_RAM_Max (0xFFFFFFFFUL)       /*!< Max enumerator value of RAM field.                                   */
  #define FICR_INFO_RAM_RAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                        */


/* FICR_INFO_MRAM: MRAM variant */
  #define FICR_INFO_MRAM_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of MRAM register.                                        */

/* MRAM @Bits 0..31 : MRAM variant */
  #define FICR_INFO_MRAM_MRAM_Pos (0UL)              /*!< Position of MRAM field.                                              */
  #define FICR_INFO_MRAM_MRAM_Msk (0xFFFFFFFFUL << FICR_INFO_MRAM_MRAM_Pos) /*!< Bit mask of MRAM field.                       */
  #define FICR_INFO_MRAM_MRAM_Min (0xFFFFFFFFUL)     /*!< Min enumerator value of MRAM field.                                  */
  #define FICR_INFO_MRAM_MRAM_Max (0xFFFFFFFFUL)     /*!< Max enumerator value of MRAM field.                                  */
  #define FICR_INFO_MRAM_MRAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                      */


/* FICR_INFO_CODEPAGESIZE: Code memory page size in bytes */
  #define FICR_INFO_CODEPAGESIZE_ResetValue (0x00001000UL) /*!< Reset value of CODEPAGESIZE register.                          */

/* CODEPAGESIZE @Bits 0..31 : Code memory page size in bytes */
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Pos (0UL) /*!< Position of CODEPAGESIZE field.                                   */
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Msk (0xFFFFFFFFUL << FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Pos) /*!< Bit mask of
                                                                            CODEPAGESIZE field.*/
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of CODEPAGESIZE field.              */
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of CODEPAGESIZE field.              */
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                      */


/* FICR_INFO_CODESIZE: Code memory size */
  #define FICR_INFO_CODESIZE_ResetValue (0x00000100UL) /*!< Reset value of CODESIZE register.                                  */

/* CODESIZE @Bits 0..31 : Code memory size in number of pages */
  #define FICR_INFO_CODESIZE_CODESIZE_Pos (0UL)      /*!< Position of CODESIZE field.                                          */
  #define FICR_INFO_CODESIZE_CODESIZE_Msk (0xFFFFFFFFUL << FICR_INFO_CODESIZE_CODESIZE_Pos) /*!< Bit mask of CODESIZE field.   */
  #define FICR_INFO_CODESIZE_CODESIZE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of CODESIZE field.                          */
  #define FICR_INFO_CODESIZE_CODESIZE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of CODESIZE field.                          */
  #define FICR_INFO_CODESIZE_CODESIZE_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                              */


/* FICR_INFO_DEVICETYPE: Device type */
  #define FICR_INFO_DEVICETYPE_ResetValue (0x00000000UL) /*!< Reset value of DEVICETYPE register.                              */

/* DEVICETYPE @Bits 0..31 : Device type */
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Pos (0UL)  /*!< Position of DEVICETYPE field.                                        */
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Msk (0xFFFFFFFFUL << FICR_INFO_DEVICETYPE_DEVICETYPE_Pos) /*!< Bit mask of DEVICETYPE
                                                                            field.*/
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Min (0x0UL) /*!< Min enumerator value of DEVICETYPE field.                           */
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of DEVICETYPE field.                    */
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Die (0x00000000UL) /*!< Device is an physical DIE                                    */
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_FPGA (0xFFFFFFFFUL) /*!< Device is an FPGA                                           */



/* ============================================== Struct FICR_TRIM_GLOBAL_SAADC ============================================== */
/**
  * @brief SAADC [FICR_TRIM_GLOBAL_SAADC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CAL[3];                            /*!< (@ 0x00000000) Trim value for GLOBAL.SAADC.CAL                       */
  __IM  uint32_t  CALREF;                            /*!< (@ 0x0000000C) Trim value for GLOBAL.SAADC.CALREF                    */
  __IM  uint32_t  LINCALCOEFF[6];                    /*!< (@ 0x00000010) Trim value for GLOBAL.SAADC.TRIM.LINCALCOEFF          */
} NRF_FICR_TRIM_GLOBAL_SAADC_Type;                   /*!< Size = 40 (0x028)                                                    */

/* FICR_TRIM_GLOBAL_SAADC_CAL: Trim value for GLOBAL.SAADC.CAL */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_MaxCount (3UL)  /*!< Max size of CAL[3] array.                                            */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_MaxIndex (2UL)  /*!< Max index of CAL[3] array.                                           */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_MinIndex (0UL)  /*!< Min index of CAL[3] array.                                           */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CAL[3] register.                            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                             */
  #define FICR_TRIM_GLOBAL_SAADC_CAL_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CAL_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* FICR_TRIM_GLOBAL_SAADC_CALREF: Trim value for GLOBAL.SAADC.CALREF */
  #define FICR_TRIM_GLOBAL_SAADC_CALREF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CALREF register.                         */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALREF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_GLOBAL_SAADC_CALREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALREF_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF: Trim value for GLOBAL.SAADC.TRIM.LINCALCOEFF */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxCount (6UL) /*!< Max size of LINCALCOEFF[6] array.                             */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxIndex (5UL) /*!< Max index of LINCALCOEFF[6] array.                            */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MinIndex (0UL) /*!< Min index of LINCALCOEFF[6] array.                            */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LINCALCOEFF[6] register.            */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================== Struct FICR_TRIM_GLOBAL_NFCT =============================================== */
/**
  * @brief NFCT [FICR_TRIM_GLOBAL_NFCT] (unspecified)
  */
typedef struct {
  __IM  uint32_t  BIASCFG;                           /*!< (@ 0x00000000) Trim value for NFCT.BIASCFG                           */
} NRF_FICR_TRIM_GLOBAL_NFCT_Type;                    /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_NFCT_BIASCFG: Trim value for NFCT.BIASCFG */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of BIASCFG register.                        */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Pos (0UL) /*!< Position of VALUE field.                                          */
  #define FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_NFCT_BIASCFG_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* =========================================== Struct FICR_TRIM_GLOBAL_CANPLL_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_GLOBAL_CANPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;                             /*!< (@ 0x00000000) Trim value for GLOBAL.CANPLL.TRIM.CTUNE               */
} NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type;             /*!< Size = 4 (0x004)                                                     */

/* FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE: Trim value for GLOBAL.CANPLL.TRIM.CTUNE */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CTUNE register.                     */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos (0UL) /*!< Position of VALUE field.                                     */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_GLOBAL_CANPLL ============================================== */
/**
  * @brief CANPLL [FICR_TRIM_GLOBAL_CANPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type TRIM;  /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_FICR_TRIM_GLOBAL_CANPLL_Type;                  /*!< Size = 4 (0x004)                                                     */


