NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ====================================== Struct FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE ======================================= */
/**
  * @brief BLOCKTYPE [FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim value for RADIOCORE.MEMCONF.BLOCKTYPE[n].TRIM    */
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type;    /*!< Size = 4 (0x004)                                                     */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MaxCount (4UL) /*!< Size of BLOCKTYPE[4] array.                                */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MaxIndex (3UL) /*!< Max index of BLOCKTYPE[4] array.                           */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MinIndex (0UL) /*!< Min index of BLOCKTYPE[4] array.                           */

/* FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM: Trim value for RADIOCORE.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL) /*!< Reset value of TRIM register.              */

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL) /*!< Position of VALUE field.                             */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_RADIOCORE_MEMCONF ============================================ */
/**
  * @brief MEMCONF [FICR_TRIM_RADIOCORE_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[4]; /*!< (@ 0x00000000) (unspecified)                         */
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type;              /*!< Size = 16 (0x010)                                                    */


/* =============================================== Struct FICR_TRIM_RADIOCORE ================================================ */
/**
  * @brief RADIOCORE [FICR_TRIM_RADIOCORE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_HSFLL_Type HSFLL;    /*!< (@ 0x00000000) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type MEMCONF; /*!< (@ 0x00000038) (unspecified)                                        */
} NRF_FICR_TRIM_RADIOCORE_Type;                      /*!< Size = 72 (0x048)                                                    */


/* ==================================================== Struct FICR_TRIM ===================================================== */
/**
  * @brief TRIM [FICR_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[162];
  __IOM NRF_FICR_TRIM_GLOBAL_Type GLOBAL;            /*!< (@ 0x00000288) (unspecified)                                         */
  __IM  uint32_t  RESERVED1;
  __IOM NRF_FICR_TRIM_APPLICATION_Type APPLICATION;  /*!< (@ 0x000002C8) (unspecified)                                         */
  __IOM NRF_FICR_TRIM_RADIOCORE_Type RADIOCORE;      /*!< (@ 0x00000310) (unspecified)                                         */
} NRF_FICR_TRIM_Type;                                /*!< Size = 856 (0x358)                                                   */

/* ======================================================= Struct FICR ======================================================= */
/**
  * @brief Factory Information Configuration Registers
  */
  typedef struct {                                   /*!< FICR Structure                                                       */
    __IM uint32_t RESERVED[3];
    __IOM NRF_FICR_BLE_Type BLE;                     /*!< (@ 0x0000000C) (unspecified)                                         */
    __IM uint32_t RESERVED1[2];
    __IOM NRF_FICR_NFC_Type NFC;                     /*!< (@ 0x00000040) (unspecified)                                         */
    __IOM NRF_FICR_INFO_Type INFO;                   /*!< (@ 0x00000050) Device info                                           */
    __IM uint32_t RESERVED2[35];
    __IOM NRF_FICR_TRIM_Type TRIM;                   /*!< (@ 0x00000100) (unspecified)                                         */
  } NRF_FICR_Type;                                   /*!< Size = 1112 (0x458)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           GPIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct GPIO_PORTCNF =================================================== */
/**
  * @brief PORTCNF [GPIO_PORTCNF] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DRIVECTRL;                         /*!< (@ 0x00000000) Drive control for impedance matching of the pins in
                                                                         this port*/
} NRF_GPIO_PORTCNF_Type;                             /*!< Size = 4 (0x004)                                                     */

/* GPIO_PORTCNF_DRIVECTRL: Drive control for impedance matching of the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_ResetValue (0x00000000UL) /*!< Reset value of DRIVECTRL register.                             */

/* IMPEDANCE50 @Bit 0 : Enable 50 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Pos (0UL) /*!< Position of IMPEDANCE50 field.                                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Pos) /*!< Bit mask of IMPEDANCE50
                                                                            field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE50 field.                       */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE50 field.                       */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Disable (0x0UL) /*!< Disabled                                                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Enable (0x1UL) /*!< Enable                                                        */

/* IMPEDANCE100 @Bit 1 : Enable 100 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Pos (1UL) /*!< Position of IMPEDANCE100 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Pos) /*!< Bit mask of
                                                                            IMPEDANCE100 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE100 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE100 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE200 @Bit 2 : Enable 200 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Pos (2UL) /*!< Position of IMPEDANCE200 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Pos) /*!< Bit mask of
                                                                            IMPEDANCE200 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE200 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE200 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Enable (0x1UL) /*!< Enable                                                       */

/* IMPEDANCE400 @Bit 3 : Enable 400 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Pos (3UL) /*!< Position of IMPEDANCE400 field.                                   */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Pos) /*!< Bit mask of
                                                                            IMPEDANCE400 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Min (0x0UL) /*!< Min enumerator value of IMPEDANCE400 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Max (0x1UL) /*!< Max enumerator value of IMPEDANCE400 field.                     */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Disable (0x0UL) /*!< Disabled                                                    */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Enable (0x1UL) /*!< Enable                                                       */

