NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN7 @Bit 7 : Set as input pin 7 */
  #define GPIO_DIRCLR_PIN7_Pos (7UL)                 /*!< Position of PIN7 field.                                              */
  #define GPIO_DIRCLR_PIN7_Msk (0x1UL << GPIO_DIRCLR_PIN7_Pos) /*!< Bit mask of PIN7 field.                                    */
  #define GPIO_DIRCLR_PIN7_Min (0x0UL)               /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_DIRCLR_PIN7_Max (0x1UL)               /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_DIRCLR_PIN7_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN7_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN7_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN8 @Bit 8 : Set as input pin 8 */
  #define GPIO_DIRCLR_PIN8_Pos (8UL)                 /*!< Position of PIN8 field.                                              */
  #define GPIO_DIRCLR_PIN8_Msk (0x1UL << GPIO_DIRCLR_PIN8_Pos) /*!< Bit mask of PIN8 field.                                    */
  #define GPIO_DIRCLR_PIN8_Min (0x0UL)               /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_DIRCLR_PIN8_Max (0x1UL)               /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_DIRCLR_PIN8_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN8_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN8_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN9 @Bit 9 : Set as input pin 9 */
  #define GPIO_DIRCLR_PIN9_Pos (9UL)                 /*!< Position of PIN9 field.                                              */
  #define GPIO_DIRCLR_PIN9_Msk (0x1UL << GPIO_DIRCLR_PIN9_Pos) /*!< Bit mask of PIN9 field.                                    */
  #define GPIO_DIRCLR_PIN9_Min (0x0UL)               /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_DIRCLR_PIN9_Max (0x1UL)               /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_DIRCLR_PIN9_Input (0x0UL)             /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN9_Output (0x1UL)            /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN9_Clear (0x1UL)             /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN10 @Bit 10 : Set as input pin 10 */
  #define GPIO_DIRCLR_PIN10_Pos (10UL)               /*!< Position of PIN10 field.                                             */
  #define GPIO_DIRCLR_PIN10_Msk (0x1UL << GPIO_DIRCLR_PIN10_Pos) /*!< Bit mask of PIN10 field.                                 */
  #define GPIO_DIRCLR_PIN10_Min (0x0UL)              /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_DIRCLR_PIN10_Max (0x1UL)              /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_DIRCLR_PIN10_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN10_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN10_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN11 @Bit 11 : Set as input pin 11 */
  #define GPIO_DIRCLR_PIN11_Pos (11UL)               /*!< Position of PIN11 field.                                             */
  #define GPIO_DIRCLR_PIN11_Msk (0x1UL << GPIO_DIRCLR_PIN11_Pos) /*!< Bit mask of PIN11 field.                                 */
  #define GPIO_DIRCLR_PIN11_Min (0x0UL)              /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_DIRCLR_PIN11_Max (0x1UL)              /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_DIRCLR_PIN11_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN11_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN11_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN12 @Bit 12 : Set as input pin 12 */
  #define GPIO_DIRCLR_PIN12_Pos (12UL)               /*!< Position of PIN12 field.                                             */
  #define GPIO_DIRCLR_PIN12_Msk (0x1UL << GPIO_DIRCLR_PIN12_Pos) /*!< Bit mask of PIN12 field.                                 */
  #define GPIO_DIRCLR_PIN12_Min (0x0UL)              /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_DIRCLR_PIN12_Max (0x1UL)              /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_DIRCLR_PIN12_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN12_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN12_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN13 @Bit 13 : Set as input pin 13 */
  #define GPIO_DIRCLR_PIN13_Pos (13UL)               /*!< Position of PIN13 field.                                             */
  #define GPIO_DIRCLR_PIN13_Msk (0x1UL << GPIO_DIRCLR_PIN13_Pos) /*!< Bit mask of PIN13 field.                                 */
  #define GPIO_DIRCLR_PIN13_Min (0x0UL)              /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_DIRCLR_PIN13_Max (0x1UL)              /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_DIRCLR_PIN13_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN13_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN13_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN14 @Bit 14 : Set as input pin 14 */
  #define GPIO_DIRCLR_PIN14_Pos (14UL)               /*!< Position of PIN14 field.                                             */
  #define GPIO_DIRCLR_PIN14_Msk (0x1UL << GPIO_DIRCLR_PIN14_Pos) /*!< Bit mask of PIN14 field.                                 */
  #define GPIO_DIRCLR_PIN14_Min (0x0UL)              /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_DIRCLR_PIN14_Max (0x1UL)              /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_DIRCLR_PIN14_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN14_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN14_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN15 @Bit 15 : Set as input pin 15 */
  #define GPIO_DIRCLR_PIN15_Pos (15UL)               /*!< Position of PIN15 field.                                             */
  #define GPIO_DIRCLR_PIN15_Msk (0x1UL << GPIO_DIRCLR_PIN15_Pos) /*!< Bit mask of PIN15 field.                                 */
  #define GPIO_DIRCLR_PIN15_Min (0x0UL)              /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_DIRCLR_PIN15_Max (0x1UL)              /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_DIRCLR_PIN15_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN15_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN15_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN16 @Bit 16 : Set as input pin 16 */
  #define GPIO_DIRCLR_PIN16_Pos (16UL)               /*!< Position of PIN16 field.                                             */
  #define GPIO_DIRCLR_PIN16_Msk (0x1UL << GPIO_DIRCLR_PIN16_Pos) /*!< Bit mask of PIN16 field.                                 */
  #define GPIO_DIRCLR_PIN16_Min (0x0UL)              /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_DIRCLR_PIN16_Max (0x1UL)              /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_DIRCLR_PIN16_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN16_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN16_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN17 @Bit 17 : Set as input pin 17 */
  #define GPIO_DIRCLR_PIN17_Pos (17UL)               /*!< Position of PIN17 field.                                             */
  #define GPIO_DIRCLR_PIN17_Msk (0x1UL << GPIO_DIRCLR_PIN17_Pos) /*!< Bit mask of PIN17 field.                                 */
  #define GPIO_DIRCLR_PIN17_Min (0x0UL)              /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_DIRCLR_PIN17_Max (0x1UL)              /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_DIRCLR_PIN17_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN17_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN17_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN18 @Bit 18 : Set as input pin 18 */
  #define GPIO_DIRCLR_PIN18_Pos (18UL)               /*!< Position of PIN18 field.                                             */
  #define GPIO_DIRCLR_PIN18_Msk (0x1UL << GPIO_DIRCLR_PIN18_Pos) /*!< Bit mask of PIN18 field.                                 */
  #define GPIO_DIRCLR_PIN18_Min (0x0UL)              /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_DIRCLR_PIN18_Max (0x1UL)              /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_DIRCLR_PIN18_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN18_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN18_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN19 @Bit 19 : Set as input pin 19 */
  #define GPIO_DIRCLR_PIN19_Pos (19UL)               /*!< Position of PIN19 field.                                             */
  #define GPIO_DIRCLR_PIN19_Msk (0x1UL << GPIO_DIRCLR_PIN19_Pos) /*!< Bit mask of PIN19 field.                                 */
  #define GPIO_DIRCLR_PIN19_Min (0x0UL)              /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_DIRCLR_PIN19_Max (0x1UL)              /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_DIRCLR_PIN19_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN19_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN19_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN20 @Bit 20 : Set as input pin 20 */
  #define GPIO_DIRCLR_PIN20_Pos (20UL)               /*!< Position of PIN20 field.                                             */
  #define GPIO_DIRCLR_PIN20_Msk (0x1UL << GPIO_DIRCLR_PIN20_Pos) /*!< Bit mask of PIN20 field.                                 */
  #define GPIO_DIRCLR_PIN20_Min (0x0UL)              /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_DIRCLR_PIN20_Max (0x1UL)              /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_DIRCLR_PIN20_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN20_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN20_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN21 @Bit 21 : Set as input pin 21 */
  #define GPIO_DIRCLR_PIN21_Pos (21UL)               /*!< Position of PIN21 field.                                             */
  #define GPIO_DIRCLR_PIN21_Msk (0x1UL << GPIO_DIRCLR_PIN21_Pos) /*!< Bit mask of PIN21 field.                                 */
  #define GPIO_DIRCLR_PIN21_Min (0x0UL)              /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_DIRCLR_PIN21_Max (0x1UL)              /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_DIRCLR_PIN21_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN21_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN21_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN22 @Bit 22 : Set as input pin 22 */
  #define GPIO_DIRCLR_PIN22_Pos (22UL)               /*!< Position of PIN22 field.                                             */
  #define GPIO_DIRCLR_PIN22_Msk (0x1UL << GPIO_DIRCLR_PIN22_Pos) /*!< Bit mask of PIN22 field.                                 */
  #define GPIO_DIRCLR_PIN22_Min (0x0UL)              /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_DIRCLR_PIN22_Max (0x1UL)              /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_DIRCLR_PIN22_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN22_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN22_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN23 @Bit 23 : Set as input pin 23 */
  #define GPIO_DIRCLR_PIN23_Pos (23UL)               /*!< Position of PIN23 field.                                             */
  #define GPIO_DIRCLR_PIN23_Msk (0x1UL << GPIO_DIRCLR_PIN23_Pos) /*!< Bit mask of PIN23 field.                                 */
  #define GPIO_DIRCLR_PIN23_Min (0x0UL)              /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_DIRCLR_PIN23_Max (0x1UL)              /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_DIRCLR_PIN23_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN23_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN23_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN24 @Bit 24 : Set as input pin 24 */
  #define GPIO_DIRCLR_PIN24_Pos (24UL)               /*!< Position of PIN24 field.                                             */
  #define GPIO_DIRCLR_PIN24_Msk (0x1UL << GPIO_DIRCLR_PIN24_Pos) /*!< Bit mask of PIN24 field.                                 */
  #define GPIO_DIRCLR_PIN24_Min (0x0UL)              /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_DIRCLR_PIN24_Max (0x1UL)              /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_DIRCLR_PIN24_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN24_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN24_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN25 @Bit 25 : Set as input pin 25 */
  #define GPIO_DIRCLR_PIN25_Pos (25UL)               /*!< Position of PIN25 field.                                             */
  #define GPIO_DIRCLR_PIN25_Msk (0x1UL << GPIO_DIRCLR_PIN25_Pos) /*!< Bit mask of PIN25 field.                                 */
  #define GPIO_DIRCLR_PIN25_Min (0x0UL)              /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_DIRCLR_PIN25_Max (0x1UL)              /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_DIRCLR_PIN25_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN25_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN25_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN26 @Bit 26 : Set as input pin 26 */
  #define GPIO_DIRCLR_PIN26_Pos (26UL)               /*!< Position of PIN26 field.                                             */
  #define GPIO_DIRCLR_PIN26_Msk (0x1UL << GPIO_DIRCLR_PIN26_Pos) /*!< Bit mask of PIN26 field.                                 */
  #define GPIO_DIRCLR_PIN26_Min (0x0UL)              /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_DIRCLR_PIN26_Max (0x1UL)              /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_DIRCLR_PIN26_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN26_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN26_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

/* PIN27 @Bit 27 : Set as input pin 27 */
  #define GPIO_DIRCLR_PIN27_Pos (27UL)               /*!< Position of PIN27 field.                                             */
  #define GPIO_DIRCLR_PIN27_Msk (0x1UL << GPIO_DIRCLR_PIN27_Pos) /*!< Bit mask of PIN27 field.                                 */
  #define GPIO_DIRCLR_PIN27_Min (0x0UL)              /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_DIRCLR_PIN27_Max (0x1UL)              /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_DIRCLR_PIN27_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRCLR_PIN27_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRCLR_PIN27_Clear (0x1UL)            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect  */

