NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN24 @Bit 24 : Status on whether PIN24 has met criteria set in PIN_CNF[24].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN24_Pos (24UL)                /*!< Position of PIN24 field.                                             */
  #define GPIO_LATCH_PIN24_Msk (0x1UL << GPIO_LATCH_PIN24_Pos) /*!< Bit mask of PIN24 field.                                   */
  #define GPIO_LATCH_PIN24_Min (0x0UL)               /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_LATCH_PIN24_Max (0x1UL)               /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_LATCH_PIN24_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN24_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN25 @Bit 25 : Status on whether PIN25 has met criteria set in PIN_CNF[25].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN25_Pos (25UL)                /*!< Position of PIN25 field.                                             */
  #define GPIO_LATCH_PIN25_Msk (0x1UL << GPIO_LATCH_PIN25_Pos) /*!< Bit mask of PIN25 field.                                   */
  #define GPIO_LATCH_PIN25_Min (0x0UL)               /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_LATCH_PIN25_Max (0x1UL)               /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_LATCH_PIN25_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN25_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN26 @Bit 26 : Status on whether PIN26 has met criteria set in PIN_CNF[26].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN26_Pos (26UL)                /*!< Position of PIN26 field.                                             */
  #define GPIO_LATCH_PIN26_Msk (0x1UL << GPIO_LATCH_PIN26_Pos) /*!< Bit mask of PIN26 field.                                   */
  #define GPIO_LATCH_PIN26_Min (0x0UL)               /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_LATCH_PIN26_Max (0x1UL)               /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_LATCH_PIN26_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN26_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN27 @Bit 27 : Status on whether PIN27 has met criteria set in PIN_CNF[27].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN27_Pos (27UL)                /*!< Position of PIN27 field.                                             */
  #define GPIO_LATCH_PIN27_Msk (0x1UL << GPIO_LATCH_PIN27_Pos) /*!< Bit mask of PIN27 field.                                   */
  #define GPIO_LATCH_PIN27_Min (0x0UL)               /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_LATCH_PIN27_Max (0x1UL)               /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_LATCH_PIN27_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN27_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN28 @Bit 28 : Status on whether PIN28 has met criteria set in PIN_CNF[28].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN28_Pos (28UL)                /*!< Position of PIN28 field.                                             */
  #define GPIO_LATCH_PIN28_Msk (0x1UL << GPIO_LATCH_PIN28_Pos) /*!< Bit mask of PIN28 field.                                   */
  #define GPIO_LATCH_PIN28_Min (0x0UL)               /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_LATCH_PIN28_Max (0x1UL)               /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_LATCH_PIN28_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN28_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN29 @Bit 29 : Status on whether PIN29 has met criteria set in PIN_CNF[29].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN29_Pos (29UL)                /*!< Position of PIN29 field.                                             */
  #define GPIO_LATCH_PIN29_Msk (0x1UL << GPIO_LATCH_PIN29_Pos) /*!< Bit mask of PIN29 field.                                   */
  #define GPIO_LATCH_PIN29_Min (0x0UL)               /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_LATCH_PIN29_Max (0x1UL)               /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_LATCH_PIN29_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN29_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN30 @Bit 30 : Status on whether PIN30 has met criteria set in PIN_CNF[30].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN30_Pos (30UL)                /*!< Position of PIN30 field.                                             */
  #define GPIO_LATCH_PIN30_Msk (0x1UL << GPIO_LATCH_PIN30_Pos) /*!< Bit mask of PIN30 field.                                   */
  #define GPIO_LATCH_PIN30_Min (0x0UL)               /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_LATCH_PIN30_Max (0x1UL)               /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_LATCH_PIN30_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN30_Latched (0x1UL)           /*!< Criteria has been met                                                */

