NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN31 @Bit 31 : Status on whether PIN31 has met criteria set in PIN_CNF[31].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN31_Pos (31UL)                /*!< Position of PIN31 field.                                             */
  #define GPIO_LATCH_PIN31_Msk (0x1UL << GPIO_LATCH_PIN31_Pos) /*!< Bit mask of PIN31 field.                                   */
  #define GPIO_LATCH_PIN31_Min (0x0UL)               /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_LATCH_PIN31_Max (0x1UL)               /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_LATCH_PIN31_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN31_Latched (0x1UL)           /*!< Criteria has been met                                                */


/* GPIO_DETECTMODE: Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_ResetValue (0x00000000UL)  /*!< Reset value of DETECTMODE register.                                  */

/* DETECTMODE @Bit 0 : Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_DETECTMODE_Pos (0UL)       /*!< Position of DETECTMODE field.                                        */
  #define GPIO_DETECTMODE_DETECTMODE_Msk (0x1UL << GPIO_DETECTMODE_DETECTMODE_Pos) /*!< Bit mask of DETECTMODE field.          */
  #define GPIO_DETECTMODE_DETECTMODE_Min (0x0UL)     /*!< Min enumerator value of DETECTMODE field.                            */
  #define GPIO_DETECTMODE_DETECTMODE_Max (0x1UL)     /*!< Max enumerator value of DETECTMODE field.                            */
  #define GPIO_DETECTMODE_DETECTMODE_Default (0x0UL) /*!< DETECT directly connected to PIN DETECT signals                      */
  #define GPIO_DETECTMODE_DETECTMODE_LDETECT (0x1UL) /*!< Use the latched LDETECT behavior                                     */


/* GPIO_RETAIN: RETAIN of each individual GPIO pin. Pins with their RETAIN bit set keep their state independent of changes of
                 the GPIO-configuration and peripheral changes. RETAIN must be cleared before the pin can be used. RETAIN is
                 typically used to isolate the pin state from internal device state changes. The pin will keep all its state
                 including the output value, DIR and PORTCNF settings. */

  #define GPIO_RETAIN_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of RETAIN register.                                      */

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_RETAIN_PIN0_Pos (0UL)                 /*!< Position of PIN0 field.                                              */
  #define GPIO_RETAIN_PIN0_Msk (0x1UL << GPIO_RETAIN_PIN0_Pos) /*!< Bit mask of PIN0 field.                                    */
  #define GPIO_RETAIN_PIN0_Min (0x0UL)               /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_RETAIN_PIN0_Max (0x1UL)               /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_RETAIN_PIN0_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN0_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_RETAIN_PIN1_Pos (1UL)                 /*!< Position of PIN1 field.                                              */
  #define GPIO_RETAIN_PIN1_Msk (0x1UL << GPIO_RETAIN_PIN1_Pos) /*!< Bit mask of PIN1 field.                                    */
  #define GPIO_RETAIN_PIN1_Min (0x0UL)               /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_RETAIN_PIN1_Max (0x1UL)               /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_RETAIN_PIN1_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN1_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_RETAIN_PIN2_Pos (2UL)                 /*!< Position of PIN2 field.                                              */
  #define GPIO_RETAIN_PIN2_Msk (0x1UL << GPIO_RETAIN_PIN2_Pos) /*!< Bit mask of PIN2 field.                                    */
  #define GPIO_RETAIN_PIN2_Min (0x0UL)               /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_RETAIN_PIN2_Max (0x1UL)               /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_RETAIN_PIN2_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN2_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_RETAIN_PIN3_Pos (3UL)                 /*!< Position of PIN3 field.                                              */
  #define GPIO_RETAIN_PIN3_Msk (0x1UL << GPIO_RETAIN_PIN3_Pos) /*!< Bit mask of PIN3 field.                                    */
  #define GPIO_RETAIN_PIN3_Min (0x0UL)               /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_RETAIN_PIN3_Max (0x1UL)               /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_RETAIN_PIN3_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN3_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN4 @Bit 4 : Pin 4 */
  #define GPIO_RETAIN_PIN4_Pos (4UL)                 /*!< Position of PIN4 field.                                              */
  #define GPIO_RETAIN_PIN4_Msk (0x1UL << GPIO_RETAIN_PIN4_Pos) /*!< Bit mask of PIN4 field.                                    */
  #define GPIO_RETAIN_PIN4_Min (0x0UL)               /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_RETAIN_PIN4_Max (0x1UL)               /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_RETAIN_PIN4_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN4_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN5 @Bit 5 : Pin 5 */
  #define GPIO_RETAIN_PIN5_Pos (5UL)                 /*!< Position of PIN5 field.                                              */
  #define GPIO_RETAIN_PIN5_Msk (0x1UL << GPIO_RETAIN_PIN5_Pos) /*!< Bit mask of PIN5 field.                                    */
  #define GPIO_RETAIN_PIN5_Min (0x0UL)               /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_RETAIN_PIN5_Max (0x1UL)               /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_RETAIN_PIN5_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN5_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN6 @Bit 6 : Pin 6 */
  #define GPIO_RETAIN_PIN6_Pos (6UL)                 /*!< Position of PIN6 field.                                              */
  #define GPIO_RETAIN_PIN6_Msk (0x1UL << GPIO_RETAIN_PIN6_Pos) /*!< Bit mask of PIN6 field.                                    */
  #define GPIO_RETAIN_PIN6_Min (0x0UL)               /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_RETAIN_PIN6_Max (0x1UL)               /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_RETAIN_PIN6_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN6_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN7 @Bit 7 : Pin 7 */
  #define GPIO_RETAIN_PIN7_Pos (7UL)                 /*!< Position of PIN7 field.                                              */
  #define GPIO_RETAIN_PIN7_Msk (0x1UL << GPIO_RETAIN_PIN7_Pos) /*!< Bit mask of PIN7 field.                                    */
  #define GPIO_RETAIN_PIN7_Min (0x0UL)               /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_RETAIN_PIN7_Max (0x1UL)               /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_RETAIN_PIN7_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN7_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN8 @Bit 8 : Pin 8 */
  #define GPIO_RETAIN_PIN8_Pos (8UL)                 /*!< Position of PIN8 field.                                              */
  #define GPIO_RETAIN_PIN8_Msk (0x1UL << GPIO_RETAIN_PIN8_Pos) /*!< Bit mask of PIN8 field.                                    */
  #define GPIO_RETAIN_PIN8_Min (0x0UL)               /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_RETAIN_PIN8_Max (0x1UL)               /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_RETAIN_PIN8_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN8_Retained (0x1UL)          /*!< Pin retained                                                         */

