NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN9 @Bit 9 : Pin 9 */
  #define GPIO_RETAIN_PIN9_Pos (9UL)                 /*!< Position of PIN9 field.                                              */
  #define GPIO_RETAIN_PIN9_Msk (0x1UL << GPIO_RETAIN_PIN9_Pos) /*!< Bit mask of PIN9 field.                                    */
  #define GPIO_RETAIN_PIN9_Min (0x0UL)               /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_RETAIN_PIN9_Max (0x1UL)               /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_RETAIN_PIN9_Unretained (0x0UL)        /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN9_Retained (0x1UL)          /*!< Pin retained                                                         */

/* PIN10 @Bit 10 : Pin 10 */
  #define GPIO_RETAIN_PIN10_Pos (10UL)               /*!< Position of PIN10 field.                                             */
  #define GPIO_RETAIN_PIN10_Msk (0x1UL << GPIO_RETAIN_PIN10_Pos) /*!< Bit mask of PIN10 field.                                 */
  #define GPIO_RETAIN_PIN10_Min (0x0UL)              /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_RETAIN_PIN10_Max (0x1UL)              /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_RETAIN_PIN10_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN10_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN11 @Bit 11 : Pin 11 */
  #define GPIO_RETAIN_PIN11_Pos (11UL)               /*!< Position of PIN11 field.                                             */
  #define GPIO_RETAIN_PIN11_Msk (0x1UL << GPIO_RETAIN_PIN11_Pos) /*!< Bit mask of PIN11 field.                                 */
  #define GPIO_RETAIN_PIN11_Min (0x0UL)              /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_RETAIN_PIN11_Max (0x1UL)              /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_RETAIN_PIN11_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN11_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN12 @Bit 12 : Pin 12 */
  #define GPIO_RETAIN_PIN12_Pos (12UL)               /*!< Position of PIN12 field.                                             */
  #define GPIO_RETAIN_PIN12_Msk (0x1UL << GPIO_RETAIN_PIN12_Pos) /*!< Bit mask of PIN12 field.                                 */
  #define GPIO_RETAIN_PIN12_Min (0x0UL)              /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_RETAIN_PIN12_Max (0x1UL)              /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_RETAIN_PIN12_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN12_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN13 @Bit 13 : Pin 13 */
  #define GPIO_RETAIN_PIN13_Pos (13UL)               /*!< Position of PIN13 field.                                             */
  #define GPIO_RETAIN_PIN13_Msk (0x1UL << GPIO_RETAIN_PIN13_Pos) /*!< Bit mask of PIN13 field.                                 */
  #define GPIO_RETAIN_PIN13_Min (0x0UL)              /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_RETAIN_PIN13_Max (0x1UL)              /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_RETAIN_PIN13_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN13_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN14 @Bit 14 : Pin 14 */
  #define GPIO_RETAIN_PIN14_Pos (14UL)               /*!< Position of PIN14 field.                                             */
  #define GPIO_RETAIN_PIN14_Msk (0x1UL << GPIO_RETAIN_PIN14_Pos) /*!< Bit mask of PIN14 field.                                 */
  #define GPIO_RETAIN_PIN14_Min (0x0UL)              /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_RETAIN_PIN14_Max (0x1UL)              /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_RETAIN_PIN14_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN14_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN15 @Bit 15 : Pin 15 */
  #define GPIO_RETAIN_PIN15_Pos (15UL)               /*!< Position of PIN15 field.                                             */
  #define GPIO_RETAIN_PIN15_Msk (0x1UL << GPIO_RETAIN_PIN15_Pos) /*!< Bit mask of PIN15 field.                                 */
  #define GPIO_RETAIN_PIN15_Min (0x0UL)              /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_RETAIN_PIN15_Max (0x1UL)              /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_RETAIN_PIN15_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN15_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN16 @Bit 16 : Pin 16 */
  #define GPIO_RETAIN_PIN16_Pos (16UL)               /*!< Position of PIN16 field.                                             */
  #define GPIO_RETAIN_PIN16_Msk (0x1UL << GPIO_RETAIN_PIN16_Pos) /*!< Bit mask of PIN16 field.                                 */
  #define GPIO_RETAIN_PIN16_Min (0x0UL)              /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_RETAIN_PIN16_Max (0x1UL)              /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_RETAIN_PIN16_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN16_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN17 @Bit 17 : Pin 17 */
  #define GPIO_RETAIN_PIN17_Pos (17UL)               /*!< Position of PIN17 field.                                             */
  #define GPIO_RETAIN_PIN17_Msk (0x1UL << GPIO_RETAIN_PIN17_Pos) /*!< Bit mask of PIN17 field.                                 */
  #define GPIO_RETAIN_PIN17_Min (0x0UL)              /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_RETAIN_PIN17_Max (0x1UL)              /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_RETAIN_PIN17_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN17_Retained (0x1UL)         /*!< Pin retained                                                         */

