NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_RETAIN_PIN26_Pos (26UL)               /*!< Position of PIN26 field.                                             */
  #define GPIO_RETAIN_PIN26_Msk (0x1UL << GPIO_RETAIN_PIN26_Pos) /*!< Bit mask of PIN26 field.                                 */
  #define GPIO_RETAIN_PIN26_Min (0x0UL)              /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_RETAIN_PIN26_Max (0x1UL)              /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_RETAIN_PIN26_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN26_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_RETAIN_PIN27_Pos (27UL)               /*!< Position of PIN27 field.                                             */
  #define GPIO_RETAIN_PIN27_Msk (0x1UL << GPIO_RETAIN_PIN27_Pos) /*!< Bit mask of PIN27 field.                                 */
  #define GPIO_RETAIN_PIN27_Min (0x0UL)              /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_RETAIN_PIN27_Max (0x1UL)              /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_RETAIN_PIN27_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN27_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_RETAIN_PIN28_Pos (28UL)               /*!< Position of PIN28 field.                                             */
  #define GPIO_RETAIN_PIN28_Msk (0x1UL << GPIO_RETAIN_PIN28_Pos) /*!< Bit mask of PIN28 field.                                 */
  #define GPIO_RETAIN_PIN28_Min (0x0UL)              /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_RETAIN_PIN28_Max (0x1UL)              /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_RETAIN_PIN28_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN28_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_RETAIN_PIN29_Pos (29UL)               /*!< Position of PIN29 field.                                             */
  #define GPIO_RETAIN_PIN29_Msk (0x1UL << GPIO_RETAIN_PIN29_Pos) /*!< Bit mask of PIN29 field.                                 */
  #define GPIO_RETAIN_PIN29_Min (0x0UL)              /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_RETAIN_PIN29_Max (0x1UL)              /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_RETAIN_PIN29_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN29_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_RETAIN_PIN30_Pos (30UL)               /*!< Position of PIN30 field.                                             */
  #define GPIO_RETAIN_PIN30_Msk (0x1UL << GPIO_RETAIN_PIN30_Pos) /*!< Bit mask of PIN30 field.                                 */
  #define GPIO_RETAIN_PIN30_Min (0x0UL)              /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_RETAIN_PIN30_Max (0x1UL)              /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_RETAIN_PIN30_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN30_Retained (0x1UL)         /*!< Pin retained                                                         */

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_RETAIN_PIN31_Pos (31UL)               /*!< Position of PIN31 field.                                             */
  #define GPIO_RETAIN_PIN31_Msk (0x1UL << GPIO_RETAIN_PIN31_Pos) /*!< Bit mask of PIN31 field.                                 */
  #define GPIO_RETAIN_PIN31_Min (0x0UL)              /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_RETAIN_PIN31_Max (0x1UL)              /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_RETAIN_PIN31_Unretained (0x0UL)       /*!< Pin not retained                                                     */
  #define GPIO_RETAIN_PIN31_Retained (0x1UL)         /*!< Pin retained                                                         */


/* GPIO_RETAINSET: Set RETAIN for individual GPIO pins */
  #define GPIO_RETAINSET_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of RETAINSET register.                                   */

/* PIN0 @Bit 0 : Set RETAIN for pin 0 */
  #define GPIO_RETAINSET_PIN0_Pos (0UL)              /*!< Position of PIN0 field.                                              */
  #define GPIO_RETAINSET_PIN0_Msk (0x1UL << GPIO_RETAINSET_PIN0_Pos) /*!< Bit mask of PIN0 field.                              */
  #define GPIO_RETAINSET_PIN0_Min (0x0UL)            /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_RETAINSET_PIN0_Max (0x1UL)            /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_RETAINSET_PIN0_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN0_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN0_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN1 @Bit 1 : Set RETAIN for pin 1 */
  #define GPIO_RETAINSET_PIN1_Pos (1UL)              /*!< Position of PIN1 field.                                              */
  #define GPIO_RETAINSET_PIN1_Msk (0x1UL << GPIO_RETAINSET_PIN1_Pos) /*!< Bit mask of PIN1 field.                              */
  #define GPIO_RETAINSET_PIN1_Min (0x0UL)            /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_RETAINSET_PIN1_Max (0x1UL)            /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_RETAINSET_PIN1_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN1_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN1_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN2 @Bit 2 : Set RETAIN for pin 2 */
  #define GPIO_RETAINSET_PIN2_Pos (2UL)              /*!< Position of PIN2 field.                                              */
  #define GPIO_RETAINSET_PIN2_Msk (0x1UL << GPIO_RETAINSET_PIN2_Pos) /*!< Bit mask of PIN2 field.                              */
  #define GPIO_RETAINSET_PIN2_Min (0x0UL)            /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_RETAINSET_PIN2_Max (0x1UL)            /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_RETAINSET_PIN2_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN2_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN2_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

