NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN3 @Bit 3 : Set RETAIN for pin 3 */
  #define GPIO_RETAINSET_PIN3_Pos (3UL)              /*!< Position of PIN3 field.                                              */
  #define GPIO_RETAINSET_PIN3_Msk (0x1UL << GPIO_RETAINSET_PIN3_Pos) /*!< Bit mask of PIN3 field.                              */
  #define GPIO_RETAINSET_PIN3_Min (0x0UL)            /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_RETAINSET_PIN3_Max (0x1UL)            /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_RETAINSET_PIN3_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN3_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN3_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN4 @Bit 4 : Set RETAIN for pin 4 */
  #define GPIO_RETAINSET_PIN4_Pos (4UL)              /*!< Position of PIN4 field.                                              */
  #define GPIO_RETAINSET_PIN4_Msk (0x1UL << GPIO_RETAINSET_PIN4_Pos) /*!< Bit mask of PIN4 field.                              */
  #define GPIO_RETAINSET_PIN4_Min (0x0UL)            /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_RETAINSET_PIN4_Max (0x1UL)            /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_RETAINSET_PIN4_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN4_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN4_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN5 @Bit 5 : Set RETAIN for pin 5 */
  #define GPIO_RETAINSET_PIN5_Pos (5UL)              /*!< Position of PIN5 field.                                              */
  #define GPIO_RETAINSET_PIN5_Msk (0x1UL << GPIO_RETAINSET_PIN5_Pos) /*!< Bit mask of PIN5 field.                              */
  #define GPIO_RETAINSET_PIN5_Min (0x0UL)            /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_RETAINSET_PIN5_Max (0x1UL)            /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_RETAINSET_PIN5_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN5_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN5_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN6 @Bit 6 : Set RETAIN for pin 6 */
  #define GPIO_RETAINSET_PIN6_Pos (6UL)              /*!< Position of PIN6 field.                                              */
  #define GPIO_RETAINSET_PIN6_Msk (0x1UL << GPIO_RETAINSET_PIN6_Pos) /*!< Bit mask of PIN6 field.                              */
  #define GPIO_RETAINSET_PIN6_Min (0x0UL)            /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_RETAINSET_PIN6_Max (0x1UL)            /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_RETAINSET_PIN6_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN6_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN6_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN7 @Bit 7 : Set RETAIN for pin 7 */
  #define GPIO_RETAINSET_PIN7_Pos (7UL)              /*!< Position of PIN7 field.                                              */
  #define GPIO_RETAINSET_PIN7_Msk (0x1UL << GPIO_RETAINSET_PIN7_Pos) /*!< Bit mask of PIN7 field.                              */
  #define GPIO_RETAINSET_PIN7_Min (0x0UL)            /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_RETAINSET_PIN7_Max (0x1UL)            /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_RETAINSET_PIN7_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN7_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN7_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN8 @Bit 8 : Set RETAIN for pin 8 */
  #define GPIO_RETAINSET_PIN8_Pos (8UL)              /*!< Position of PIN8 field.                                              */
  #define GPIO_RETAINSET_PIN8_Msk (0x1UL << GPIO_RETAINSET_PIN8_Pos) /*!< Bit mask of PIN8 field.                              */
  #define GPIO_RETAINSET_PIN8_Min (0x0UL)            /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_RETAINSET_PIN8_Max (0x1UL)            /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_RETAINSET_PIN8_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN8_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN8_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN9 @Bit 9 : Set RETAIN for pin 9 */
  #define GPIO_RETAINSET_PIN9_Pos (9UL)              /*!< Position of PIN9 field.                                              */
  #define GPIO_RETAINSET_PIN9_Msk (0x1UL << GPIO_RETAINSET_PIN9_Pos) /*!< Bit mask of PIN9 field.                              */
  #define GPIO_RETAINSET_PIN9_Min (0x0UL)            /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_RETAINSET_PIN9_Max (0x1UL)            /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_RETAINSET_PIN9_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN9_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN9_Set (0x1UL)            /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN10 @Bit 10 : Set RETAIN for pin 10 */
  #define GPIO_RETAINSET_PIN10_Pos (10UL)            /*!< Position of PIN10 field.                                             */
  #define GPIO_RETAINSET_PIN10_Msk (0x1UL << GPIO_RETAINSET_PIN10_Pos) /*!< Bit mask of PIN10 field.                           */
  #define GPIO_RETAINSET_PIN10_Min (0x0UL)           /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_RETAINSET_PIN10_Max (0x1UL)           /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_RETAINSET_PIN10_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN10_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN10_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

