NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN11 @Bit 11 : Set RETAIN for pin 11 */
  #define GPIO_RETAINSET_PIN11_Pos (11UL)            /*!< Position of PIN11 field.                                             */
  #define GPIO_RETAINSET_PIN11_Msk (0x1UL << GPIO_RETAINSET_PIN11_Pos) /*!< Bit mask of PIN11 field.                           */
  #define GPIO_RETAINSET_PIN11_Min (0x0UL)           /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_RETAINSET_PIN11_Max (0x1UL)           /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_RETAINSET_PIN11_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN11_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN11_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN12 @Bit 12 : Set RETAIN for pin 12 */
  #define GPIO_RETAINSET_PIN12_Pos (12UL)            /*!< Position of PIN12 field.                                             */
  #define GPIO_RETAINSET_PIN12_Msk (0x1UL << GPIO_RETAINSET_PIN12_Pos) /*!< Bit mask of PIN12 field.                           */
  #define GPIO_RETAINSET_PIN12_Min (0x0UL)           /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_RETAINSET_PIN12_Max (0x1UL)           /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_RETAINSET_PIN12_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN12_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN12_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN13 @Bit 13 : Set RETAIN for pin 13 */
  #define GPIO_RETAINSET_PIN13_Pos (13UL)            /*!< Position of PIN13 field.                                             */
  #define GPIO_RETAINSET_PIN13_Msk (0x1UL << GPIO_RETAINSET_PIN13_Pos) /*!< Bit mask of PIN13 field.                           */
  #define GPIO_RETAINSET_PIN13_Min (0x0UL)           /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_RETAINSET_PIN13_Max (0x1UL)           /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_RETAINSET_PIN13_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN13_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN13_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN14 @Bit 14 : Set RETAIN for pin 14 */
  #define GPIO_RETAINSET_PIN14_Pos (14UL)            /*!< Position of PIN14 field.                                             */
  #define GPIO_RETAINSET_PIN14_Msk (0x1UL << GPIO_RETAINSET_PIN14_Pos) /*!< Bit mask of PIN14 field.                           */
  #define GPIO_RETAINSET_PIN14_Min (0x0UL)           /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_RETAINSET_PIN14_Max (0x1UL)           /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_RETAINSET_PIN14_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN14_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN14_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN15 @Bit 15 : Set RETAIN for pin 15 */
  #define GPIO_RETAINSET_PIN15_Pos (15UL)            /*!< Position of PIN15 field.                                             */
  #define GPIO_RETAINSET_PIN15_Msk (0x1UL << GPIO_RETAINSET_PIN15_Pos) /*!< Bit mask of PIN15 field.                           */
  #define GPIO_RETAINSET_PIN15_Min (0x0UL)           /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_RETAINSET_PIN15_Max (0x1UL)           /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_RETAINSET_PIN15_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN15_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN15_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN16 @Bit 16 : Set RETAIN for pin 16 */
  #define GPIO_RETAINSET_PIN16_Pos (16UL)            /*!< Position of PIN16 field.                                             */
  #define GPIO_RETAINSET_PIN16_Msk (0x1UL << GPIO_RETAINSET_PIN16_Pos) /*!< Bit mask of PIN16 field.                           */
  #define GPIO_RETAINSET_PIN16_Min (0x0UL)           /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_RETAINSET_PIN16_Max (0x1UL)           /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_RETAINSET_PIN16_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN16_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN16_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

/* PIN17 @Bit 17 : Set RETAIN for pin 17 */
  #define GPIO_RETAINSET_PIN17_Pos (17UL)            /*!< Position of PIN17 field.                                             */
  #define GPIO_RETAINSET_PIN17_Msk (0x1UL << GPIO_RETAINSET_PIN17_Pos) /*!< Bit mask of PIN17 field.                           */
  #define GPIO_RETAINSET_PIN17_Min (0x0UL)           /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_RETAINSET_PIN17_Max (0x1UL)           /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_RETAINSET_PIN17_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINSET_PIN17_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINSET_PIN17_Set (0x1UL)           /*!< Write: writing a '1' sets pin to retained; writing a '0' has no
                                                          effect*/

