NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN8 @Bit 8 : Clear RETAIN for pin 8 */
  #define GPIO_RETAINCLR_PIN8_Pos (8UL)              /*!< Position of PIN8 field.                                              */
  #define GPIO_RETAINCLR_PIN8_Msk (0x1UL << GPIO_RETAINCLR_PIN8_Pos) /*!< Bit mask of PIN8 field.                              */
  #define GPIO_RETAINCLR_PIN8_Min (0x0UL)            /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_RETAINCLR_PIN8_Max (0x1UL)            /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_RETAINCLR_PIN8_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN8_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN8_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN9 @Bit 9 : Clear RETAIN for pin 9 */
  #define GPIO_RETAINCLR_PIN9_Pos (9UL)              /*!< Position of PIN9 field.                                              */
  #define GPIO_RETAINCLR_PIN9_Msk (0x1UL << GPIO_RETAINCLR_PIN9_Pos) /*!< Bit mask of PIN9 field.                              */
  #define GPIO_RETAINCLR_PIN9_Min (0x0UL)            /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_RETAINCLR_PIN9_Max (0x1UL)            /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_RETAINCLR_PIN9_Unretained (0x0UL)     /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN9_Retained (0x1UL)       /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN9_Clear (0x1UL)          /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN10 @Bit 10 : Clear RETAIN for pin 10 */
  #define GPIO_RETAINCLR_PIN10_Pos (10UL)            /*!< Position of PIN10 field.                                             */
  #define GPIO_RETAINCLR_PIN10_Msk (0x1UL << GPIO_RETAINCLR_PIN10_Pos) /*!< Bit mask of PIN10 field.                           */
  #define GPIO_RETAINCLR_PIN10_Min (0x0UL)           /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_RETAINCLR_PIN10_Max (0x1UL)           /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_RETAINCLR_PIN10_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN10_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN10_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN11 @Bit 11 : Clear RETAIN for pin 11 */
  #define GPIO_RETAINCLR_PIN11_Pos (11UL)            /*!< Position of PIN11 field.                                             */
  #define GPIO_RETAINCLR_PIN11_Msk (0x1UL << GPIO_RETAINCLR_PIN11_Pos) /*!< Bit mask of PIN11 field.                           */
  #define GPIO_RETAINCLR_PIN11_Min (0x0UL)           /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_RETAINCLR_PIN11_Max (0x1UL)           /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_RETAINCLR_PIN11_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN11_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN11_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN12 @Bit 12 : Clear RETAIN for pin 12 */
  #define GPIO_RETAINCLR_PIN12_Pos (12UL)            /*!< Position of PIN12 field.                                             */
  #define GPIO_RETAINCLR_PIN12_Msk (0x1UL << GPIO_RETAINCLR_PIN12_Pos) /*!< Bit mask of PIN12 field.                           */
  #define GPIO_RETAINCLR_PIN12_Min (0x0UL)           /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_RETAINCLR_PIN12_Max (0x1UL)           /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_RETAINCLR_PIN12_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN12_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN12_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN13 @Bit 13 : Clear RETAIN for pin 13 */
  #define GPIO_RETAINCLR_PIN13_Pos (13UL)            /*!< Position of PIN13 field.                                             */
  #define GPIO_RETAINCLR_PIN13_Msk (0x1UL << GPIO_RETAINCLR_PIN13_Pos) /*!< Bit mask of PIN13 field.                           */
  #define GPIO_RETAINCLR_PIN13_Min (0x0UL)           /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_RETAINCLR_PIN13_Max (0x1UL)           /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_RETAINCLR_PIN13_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN13_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN13_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN14 @Bit 14 : Clear RETAIN for pin 14 */
  #define GPIO_RETAINCLR_PIN14_Pos (14UL)            /*!< Position of PIN14 field.                                             */
  #define GPIO_RETAINCLR_PIN14_Msk (0x1UL << GPIO_RETAINCLR_PIN14_Pos) /*!< Bit mask of PIN14 field.                           */
  #define GPIO_RETAINCLR_PIN14_Min (0x0UL)           /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_RETAINCLR_PIN14_Max (0x1UL)           /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_RETAINCLR_PIN14_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN14_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN14_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN15 @Bit 15 : Clear RETAIN for pin 15 */
  #define GPIO_RETAINCLR_PIN15_Pos (15UL)            /*!< Position of PIN15 field.                                             */
  #define GPIO_RETAINCLR_PIN15_Msk (0x1UL << GPIO_RETAINCLR_PIN15_Pos) /*!< Bit mask of PIN15 field.                           */
  #define GPIO_RETAINCLR_PIN15_Min (0x0UL)           /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_RETAINCLR_PIN15_Max (0x1UL)           /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_RETAINCLR_PIN15_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN15_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN15_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

