NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PIN16 @Bit 16 : Clear RETAIN for pin 16 */
  #define GPIO_RETAINCLR_PIN16_Pos (16UL)            /*!< Position of PIN16 field.                                             */
  #define GPIO_RETAINCLR_PIN16_Msk (0x1UL << GPIO_RETAINCLR_PIN16_Pos) /*!< Bit mask of PIN16 field.                           */
  #define GPIO_RETAINCLR_PIN16_Min (0x0UL)           /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_RETAINCLR_PIN16_Max (0x1UL)           /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_RETAINCLR_PIN16_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN16_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN16_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN17 @Bit 17 : Clear RETAIN for pin 17 */
  #define GPIO_RETAINCLR_PIN17_Pos (17UL)            /*!< Position of PIN17 field.                                             */
  #define GPIO_RETAINCLR_PIN17_Msk (0x1UL << GPIO_RETAINCLR_PIN17_Pos) /*!< Bit mask of PIN17 field.                           */
  #define GPIO_RETAINCLR_PIN17_Min (0x0UL)           /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_RETAINCLR_PIN17_Max (0x1UL)           /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_RETAINCLR_PIN17_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN17_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN17_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN18 @Bit 18 : Clear RETAIN for pin 18 */
  #define GPIO_RETAINCLR_PIN18_Pos (18UL)            /*!< Position of PIN18 field.                                             */
  #define GPIO_RETAINCLR_PIN18_Msk (0x1UL << GPIO_RETAINCLR_PIN18_Pos) /*!< Bit mask of PIN18 field.                           */
  #define GPIO_RETAINCLR_PIN18_Min (0x0UL)           /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_RETAINCLR_PIN18_Max (0x1UL)           /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_RETAINCLR_PIN18_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN18_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN18_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN19 @Bit 19 : Clear RETAIN for pin 19 */
  #define GPIO_RETAINCLR_PIN19_Pos (19UL)            /*!< Position of PIN19 field.                                             */
  #define GPIO_RETAINCLR_PIN19_Msk (0x1UL << GPIO_RETAINCLR_PIN19_Pos) /*!< Bit mask of PIN19 field.                           */
  #define GPIO_RETAINCLR_PIN19_Min (0x0UL)           /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_RETAINCLR_PIN19_Max (0x1UL)           /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_RETAINCLR_PIN19_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN19_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN19_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN20 @Bit 20 : Clear RETAIN for pin 20 */
  #define GPIO_RETAINCLR_PIN20_Pos (20UL)            /*!< Position of PIN20 field.                                             */
  #define GPIO_RETAINCLR_PIN20_Msk (0x1UL << GPIO_RETAINCLR_PIN20_Pos) /*!< Bit mask of PIN20 field.                           */
  #define GPIO_RETAINCLR_PIN20_Min (0x0UL)           /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_RETAINCLR_PIN20_Max (0x1UL)           /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_RETAINCLR_PIN20_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN20_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN20_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

/* PIN21 @Bit 21 : Clear RETAIN for pin 21 */
  #define GPIO_RETAINCLR_PIN21_Pos (21UL)            /*!< Position of PIN21 field.                                             */
  #define GPIO_RETAINCLR_PIN21_Msk (0x1UL << GPIO_RETAINCLR_PIN21_Pos) /*!< Bit mask of PIN21 field.                           */
  #define GPIO_RETAINCLR_PIN21_Min (0x0UL)           /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_RETAINCLR_PIN21_Max (0x1UL)           /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_RETAINCLR_PIN21_Unretained (0x0UL)    /*!< Read: pin not retained                                               */
  #define GPIO_RETAINCLR_PIN21_Retained (0x1UL)      /*!< Read: pin retained                                                   */
  #define GPIO_RETAINCLR_PIN21_Clear (0x1UL)         /*!< Write: writing a '1' sets pin to not retain; writing a '0' has no
                                                          effect*/

