NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* DIR @Bit 0 : Pin direction. Same physical register as DIR register */
  #define GPIO_PIN_CNF_DIR_Pos (0UL)                 /*!< Position of DIR field.                                               */
  #define GPIO_PIN_CNF_DIR_Msk (0x1UL << GPIO_PIN_CNF_DIR_Pos) /*!< Bit mask of DIR field.                                     */
  #define GPIO_PIN_CNF_DIR_Min (0x0UL)               /*!< Min enumerator value of DIR field.                                   */
  #define GPIO_PIN_CNF_DIR_Max (0x1UL)               /*!< Max enumerator value of DIR field.                                   */
  #define GPIO_PIN_CNF_DIR_Input (0x0UL)             /*!< Configure pin as an input pin                                        */
  #define GPIO_PIN_CNF_DIR_Output (0x1UL)            /*!< Configure pin as an output pin                                       */

/* INPUT @Bit 1 : Connect or disconnect input buffer */
  #define GPIO_PIN_CNF_INPUT_Pos (1UL)               /*!< Position of INPUT field.                                             */
  #define GPIO_PIN_CNF_INPUT_Msk (0x1UL << GPIO_PIN_CNF_INPUT_Pos) /*!< Bit mask of INPUT field.                               */
  #define GPIO_PIN_CNF_INPUT_Min (0x0UL)             /*!< Min enumerator value of INPUT field.                                 */
  #define GPIO_PIN_CNF_INPUT_Max (0x1UL)             /*!< Max enumerator value of INPUT field.                                 */
  #define GPIO_PIN_CNF_INPUT_Connect (0x0UL)         /*!< Connect input buffer                                                 */
  #define GPIO_PIN_CNF_INPUT_Disconnect (0x1UL)      /*!< Disconnect input buffer                                              */

/* PULL @Bits 2..3 : Pull configuration */
  #define GPIO_PIN_CNF_PULL_Pos (2UL)                /*!< Position of PULL field.                                              */
  #define GPIO_PIN_CNF_PULL_Msk (0x3UL << GPIO_PIN_CNF_PULL_Pos) /*!< Bit mask of PULL field.                                  */
  #define GPIO_PIN_CNF_PULL_Min (0x0UL)              /*!< Min enumerator value of PULL field.                                  */
  #define GPIO_PIN_CNF_PULL_Max (0x3UL)              /*!< Max enumerator value of PULL field.                                  */
  #define GPIO_PIN_CNF_PULL_Disabled (0x0UL)         /*!< No pull                                                              */
  #define GPIO_PIN_CNF_PULL_Pulldown (0x1UL)         /*!< Pull down on pin                                                     */
  #define GPIO_PIN_CNF_PULL_Pullup (0x3UL)           /*!< Pull up on pin                                                       */

/* DRIVE0 @Bits 8..9 : Drive configuration for '0' */
  #define GPIO_PIN_CNF_DRIVE0_Pos (8UL)              /*!< Position of DRIVE0 field.                                            */
  #define GPIO_PIN_CNF_DRIVE0_Msk (0x3UL << GPIO_PIN_CNF_DRIVE0_Pos) /*!< Bit mask of DRIVE0 field.                            */
  #define GPIO_PIN_CNF_DRIVE0_Min (0x0UL)            /*!< Min enumerator value of DRIVE0 field.                                */
  #define GPIO_PIN_CNF_DRIVE0_Max (0x3UL)            /*!< Max enumerator value of DRIVE0 field.                                */
  #define GPIO_PIN_CNF_DRIVE0_S0 (0x0UL)             /*!< Standard '0'                                                         */
  #define GPIO_PIN_CNF_DRIVE0_H0 (0x1UL)             /*!< High drive '0'                                                       */
  #define GPIO_PIN_CNF_DRIVE0_D0 (0x2UL)             /*!< Disconnect '0'(normally used for wired-or connections)               */
  #define GPIO_PIN_CNF_DRIVE0_E0 (0x3UL)             /*!< Extra high drive '0'                                                 */

/* DRIVE1 @Bits 10..11 : Drive configuration for '1' */
  #define GPIO_PIN_CNF_DRIVE1_Pos (10UL)             /*!< Position of DRIVE1 field.                                            */
  #define GPIO_PIN_CNF_DRIVE1_Msk (0x3UL << GPIO_PIN_CNF_DRIVE1_Pos) /*!< Bit mask of DRIVE1 field.                            */
  #define GPIO_PIN_CNF_DRIVE1_Min (0x0UL)            /*!< Min enumerator value of DRIVE1 field.                                */
  #define GPIO_PIN_CNF_DRIVE1_Max (0x3UL)            /*!< Max enumerator value of DRIVE1 field.                                */
  #define GPIO_PIN_CNF_DRIVE1_S1 (0x0UL)             /*!< Standard '1'                                                         */
  #define GPIO_PIN_CNF_DRIVE1_H1 (0x1UL)             /*!< High drive '1'                                                       */
  #define GPIO_PIN_CNF_DRIVE1_D1 (0x2UL)             /*!< Disconnect '1'(normally used for wired-or connections)               */
  #define GPIO_PIN_CNF_DRIVE1_E1 (0x3UL)             /*!< Extra high drive '1'                                                 */

/* SENSE @Bits 16..17 : Pin sensing mechanism */
  #define GPIO_PIN_CNF_SENSE_Pos (16UL)              /*!< Position of SENSE field.                                             */
  #define GPIO_PIN_CNF_SENSE_Msk (0x3UL << GPIO_PIN_CNF_SENSE_Pos) /*!< Bit mask of SENSE field.                               */
  #define GPIO_PIN_CNF_SENSE_Min (0x0UL)             /*!< Min enumerator value of SENSE field.                                 */
  #define GPIO_PIN_CNF_SENSE_Max (0x3UL)             /*!< Max enumerator value of SENSE field.                                 */
  #define GPIO_PIN_CNF_SENSE_Disabled (0x0UL)        /*!< Disabled                                                             */
  #define GPIO_PIN_CNF_SENSE_High (0x2UL)            /*!< Sense for high level                                                 */
  #define GPIO_PIN_CNF_SENSE_Low (0x3UL)             /*!< Sense for low level                                                  */

/* CLOCKPIN @Bit 31 : Enable clock on the pin. */
  #define GPIO_PIN_CNF_CLOCKPIN_Pos (31UL)           /*!< Position of CLOCKPIN field.                                          */
  #define GPIO_PIN_CNF_CLOCKPIN_Msk (0x1UL << GPIO_PIN_CNF_CLOCKPIN_Pos) /*!< Bit mask of CLOCKPIN field.                      */
  #define GPIO_PIN_CNF_CLOCKPIN_Min (0x0UL)          /*!< Min enumerator value of CLOCKPIN field.                              */
  #define GPIO_PIN_CNF_CLOCKPIN_Max (0x1UL)          /*!< Max enumerator value of CLOCKPIN field.                              */
  #define GPIO_PIN_CNF_CLOCKPIN_Disabled (0x0UL)     /*!< Clock disabled                                                       */
  #define GPIO_PIN_CNF_CLOCKPIN_Enabled (0x1UL)      /*!< Clock enabled                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GPIOTE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct GPIOTE_EVENTS_PORT ================================================ */
/**
  * @brief EVENTS_PORT [GPIOTE_EVENTS_PORT] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  NONSECURE;                         /*!< (@ 0x00000000) Non-secure port event from owner n                    */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Secure port event from owner n                        */
} NRF_GPIOTE_EVENTS_PORT_Type;                       /*!< Size = 8 (0x008)                                                     */
