NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PSEL @Bits 4..8 : GPIO number associated with SET[n], CLR[n], and OUT[n] tasks and IN[n] event */
  #define GPIOTE_CONFIG_PSEL_Pos (4UL)               /*!< Position of PSEL field.                                              */
  #define GPIOTE_CONFIG_PSEL_Msk (0x1FUL << GPIOTE_CONFIG_PSEL_Pos) /*!< Bit mask of PSEL field.                               */
  #define GPIOTE_CONFIG_PSEL_Min (0x00UL)            /*!< Min value of PSEL field.                                             */
  #define GPIOTE_CONFIG_PSEL_Max (0x1FUL)            /*!< Max size of PSEL field.                                              */

/* PORT @Bits 9..12 : Port number */
  #define GPIOTE_CONFIG_PORT_Pos (9UL)               /*!< Position of PORT field.                                              */
  #define GPIOTE_CONFIG_PORT_Msk (0xFUL << GPIOTE_CONFIG_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define GPIOTE_CONFIG_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define GPIOTE_CONFIG_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* POLARITY @Bits 16..17 : When In task mode: Operation to be performed on output when OUT[n] task is triggered. When In event
                           mode: Operation on input that shall trigger IN[n] event. */

  #define GPIOTE_CONFIG_POLARITY_Pos (16UL)          /*!< Position of POLARITY field.                                          */
  #define GPIOTE_CONFIG_POLARITY_Msk (0x3UL << GPIOTE_CONFIG_POLARITY_Pos) /*!< Bit mask of POLARITY field.                    */
  #define GPIOTE_CONFIG_POLARITY_Min (0x0UL)         /*!< Min enumerator value of POLARITY field.                              */
  #define GPIOTE_CONFIG_POLARITY_Max (0x3UL)         /*!< Max enumerator value of POLARITY field.                              */
  #define GPIOTE_CONFIG_POLARITY_None (0x0UL)        /*!< Task mode: No effect on pin from OUT[n] task. Event mode: no IN[n]
                                                          event generated on pin activity.*/
  #define GPIOTE_CONFIG_POLARITY_LoToHi (0x1UL)      /*!< Task mode: Set pin from OUT[n] task. Event mode: Generate IN[n] event
                                                          when rising edge on pin.*/
  #define GPIOTE_CONFIG_POLARITY_HiToLo (0x2UL)      /*!< Task mode: Clear pin from OUT[n] task. Event mode: Generate IN[n]
                                                          event when falling edge on pin.*/
  #define GPIOTE_CONFIG_POLARITY_Toggle (0x3UL)      /*!< Task mode: Toggle pin from OUT[n]. Event mode: Generate IN[n] when any
                                                          change on pin.*/

/* OUTINIT @Bit 20 : When in task mode: Initial value of the output when the GPIOTE channel is configured. When in event mode:
                     No effect. */

  #define GPIOTE_CONFIG_OUTINIT_Pos (20UL)           /*!< Position of OUTINIT field.                                           */
  #define GPIOTE_CONFIG_OUTINIT_Msk (0x1UL << GPIOTE_CONFIG_OUTINIT_Pos) /*!< Bit mask of OUTINIT field.                       */
  #define GPIOTE_CONFIG_OUTINIT_Min (0x0UL)          /*!< Min enumerator value of OUTINIT field.                               */
  #define GPIOTE_CONFIG_OUTINIT_Max (0x1UL)          /*!< Max enumerator value of OUTINIT field.                               */
  #define GPIOTE_CONFIG_OUTINIT_Low (0x0UL)          /*!< Task mode: Initial value of pin before task triggering is low        */
  #define GPIOTE_CONFIG_OUTINIT_High (0x1UL)         /*!< Task mode: Initial value of pin before task triggering is high       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            GPR                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct GPR ======================================================== */
/**
  * @brief Granular Power Requester
  */
  typedef struct {                                   /*!< GPR Structure                                                        */
    __IOM uint32_t CPWRUPREQ;                        /*!< (@ 0x00000000) Debug Power Request Register                          */
    __IM uint32_t CPWRUPACK;                         /*!< (@ 0x00000004) Debug Power Acknowledge Register                      */
    __IM uint32_t RESERVED[958];
    __IM uint32_t ITCTRL;                            /*!< (@ 0x00000F00) Integration Mode Control Register                     */
    __IM uint32_t RESERVED1[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Claim Tag Set Register                                */
    __IM uint32_t CLAIMCLR;                          /*!< (@ 0x00000FA4) Claim Tag Clear Register                              */
    __IM uint32_t RESERVED2[2];
    __OM uint32_t LOCKACCESS;                        /*!< (@ 0x00000FB0) Lock Access Register                                  */
    __IM uint32_t LOCKSTATUS;                        /*!< (@ 0x00000FB4) Lock Status Register                                  */
    __IM uint32_t AUTHSTATUS;                        /*!< (@ 0x00000FB8) Authentication Status Register                        */
    __IM uint32_t DEVARCH;                           /*!< (@ 0x00000FBC) Device Architecture Register                          */
    __IM uint32_t RESERVED3[2];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Device Configuration Register                         */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) Device Type Identifier Register                       */
    __IM uint32_t PERIPHID4;                         /*!< (@ 0x00000FD0) Peripheral ID4 Register                               */
    __IM uint32_t RESERVED4[3];
    __IM uint32_t PERIPHID0;                         /*!< (@ 0x00000FE0) Peripheral ID0 Register                               */
    __IM uint32_t PERIPHID1;                         /*!< (@ 0x00000FE4) Peripheral ID1 Register                               */
    __IM uint32_t PERIPHID2;                         /*!< (@ 0x00000FE8) Peripheral ID2 Register                               */
    __IM uint32_t PERIPHID3;                         /*!< (@ 0x00000FEC) Peripheral ID3 Register                               */
    __IM uint32_t COMPID0;                           /*!< (@ 0x00000FF0) Component ID0 Register                                */
    __IM uint32_t COMPID1;                           /*!< (@ 0x00000FF4) Component ID1 Register                                */
    __IM uint32_t COMPID2;                           /*!< (@ 0x00000FF8) Component ID2 Register                                */
    __IM uint32_t COMPID3;                           /*!< (@ 0x00000FFC) Component ID3 Register                                */
  } NRF_GPR_Type;                                    /*!< Size = 4096 (0x1000)                                                 */

/* GPR_CPWRUPREQ: Debug Power Request Register */
  #define GPR_CPWRUPREQ_ResetValue (0x00000000UL)    /*!< Reset value of CPWRUPREQ register.                                   */

/* CPWRUPREQ_BIT0 @Bit 0 : Bit 0 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT0_Pos (0UL)     /*!< Position of CPWRUPREQ_BIT0 field.                                    */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT0_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT0_Pos) /*!< Bit mask of CPWRUPREQ_BIT0 field.  */

