NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ================================================= Struct GRTC_SYSCOUNTER ================================================== */
/**
  * @brief SYSCOUNTER [GRTC_SYSCOUNTER] (unspecified)
  */
typedef struct {
  __IM  uint32_t  SYSCOUNTERL;                       /*!< (@ 0x00000000) The lower 32-bits of the SYSCOUNTER for index [n]     */
  __IM  uint32_t  SYSCOUNTERH;                       /*!< (@ 0x00000004) The higher 20-bits of the SYSCOUNTER for index [n]    */
  __IOM uint32_t  ACTIVE;                            /*!< (@ 0x00000008) Request to keep the SYSCOUNTER in the active state and
                                                                         prevent going to sleep for index [n]*/
  __IM  uint32_t  RESERVED;
} NRF_GRTC_SYSCOUNTER_Type;                          /*!< Size = 16 (0x010)                                                    */
  #define GRTC_SYSCOUNTER_MaxCount (11UL)            /*!< Size of SYSCOUNTER[11] array.                                        */
  #define GRTC_SYSCOUNTER_MaxIndex (10UL)            /*!< Max index of SYSCOUNTER[11] array.                                   */
  #define GRTC_SYSCOUNTER_MinIndex (0UL)             /*!< Min index of SYSCOUNTER[11] array.                                   */

/* GRTC_SYSCOUNTER_SYSCOUNTERL: The lower 32-bits of the SYSCOUNTER for index [n] */
  #define GRTC_SYSCOUNTER_SYSCOUNTERL_ResetValue (0x00000000UL) /*!< Reset value of SYSCOUNTERL register.                      */

/* VALUE @Bits 0..31 : The lower 32-bits of the SYSCOUNTER value. */
  #define GRTC_SYSCOUNTER_SYSCOUNTERL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                            */
  #define GRTC_SYSCOUNTER_SYSCOUNTERL_VALUE_Msk (0xFFFFFFFFUL << GRTC_SYSCOUNTER_SYSCOUNTERL_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* GRTC_SYSCOUNTER_SYSCOUNTERH: The higher 20-bits of the SYSCOUNTER for index [n] */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_ResetValue (0x40000000UL) /*!< Reset value of SYSCOUNTERH register.                      */

/* VALUE @Bits 0..19 : The higher 20-bits of the SYSCOUNTER value. */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Pos (0UL) /*!< Position of VALUE field.                                            */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Msk (0xFFFFFUL << GRTC_SYSCOUNTER_SYSCOUNTERH_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/

/* BUSY @Bit 30 : SYSCOUNTER busy status */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Pos (30UL) /*!< Position of BUSY field.                                             */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Msk (0x1UL << GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Pos) /*!< Bit mask of BUSY field.    */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                                */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                                */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Ready (0x0UL) /*!< SYSCOUNTER is ready for read                                     */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_BUSY_Busy (0x1UL) /*!< SYSCOUNTER is busy, so not ready for read (value returned in the
                                                             VALUE field of this register is not valid)*/

/* OVERFLOW @Bit 31 : The SYSCOUNTERL overflow indication after reading it. */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Pos (31UL) /*!< Position of OVERFLOW field.                                     */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Msk (0x1UL << GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW
                                                                            field.*/
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Min (0x0UL) /*!< Min enumerator value of OVERFLOW field.                        */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Max (0x1UL) /*!< Max enumerator value of OVERFLOW field.                        */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_NoOverflow (0x0UL) /*!< SYSCOUNTERL is not overflown                            */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Overflow (0x1UL) /*!< SYSCOUNTERL overflown                                     */


/* GRTC_SYSCOUNTER_ACTIVE: Request to keep the SYSCOUNTER in the active state and prevent going to sleep for index [n] */
  #define GRTC_SYSCOUNTER_ACTIVE_ResetValue (0x00000000UL) /*!< Reset value of ACTIVE register.                                */

/* ACTIVE @Bit 0 : Keep SYSCOUNTER in active state */
  #define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos (0UL)    /*!< Position of ACTIVE field.                                            */
  #define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Msk (0x1UL << GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.        */
  #define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Min (0x0UL)  /*!< Min enumerator value of ACTIVE field.                                */
  #define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Max (0x1UL)  /*!< Max enumerator value of ACTIVE field.                                */
  #define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                 */
  #define GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active (0x1UL) /*!< Keep SYSCOUNTER active                                             */


/* ======================================================= Struct GRTC ======================================================= */
/**
  * @brief Global Real-time counter
  */
  typedef struct {                                   /*!< GRTC Structure                                                       */
    __OM uint32_t TASKS_CAPTURE[16];                 /*!< (@ 0x00000000) Capture the counter value to CC[n] register           */
    __IM uint32_t RESERVED[11];
    __OM uint32_t TASKS_PWMSTART;                    /*!< (@ 0x0000006C) Start the PWM                                         */
    __OM uint32_t TASKS_PWMSTOP;                     /*!< (@ 0x00000070) Stop the PWM                                          */
    __IM uint32_t RESERVED1[3];
    __IOM uint32_t SUBSCRIBE_CAPTURE[16];            /*!< (@ 0x00000080) Subscribe configuration for task CAPTURE[n]           */
    __IM uint32_t RESERVED2[16];
    __IOM uint32_t EVENTS_COMPARE[16];               /*!< (@ 0x00000100) Compare event on CC[n] match                          */
    __IM uint32_t RESERVED3[9];
    __IOM uint32_t EVENTS_RTCOMPARESYNC;             /*!< (@ 0x00000164) The GRTC low frequency timer is synchronized with the
                                                                         SYSCOUNTER*/
    __IM uint32_t RESERVED4;
    __IOM uint32_t EVENTS_PWMPERIODEND;              /*!< (@ 0x0000016C) Event on end of each PWM period                       */
    __IM uint32_t RESERVED5[4];
    __IOM uint32_t PUBLISH_COMPARE[16];              /*!< (@ 0x00000180) Publish configuration for event COMPARE[n]            */
    __IM uint32_t RESERVED6[16];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED7[63];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND0;                          /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000310) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000314) Enable interrupt                                      */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000318) Disable interrupt                                     */
    __IM uint32_t INTPEND1;                          /*!< (@ 0x0000031C) Pending interrupts                                    */
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000320) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t INTPEND2;                          /*!< (@ 0x0000032C) Pending interrupts                                    */
    __IOM uint32_t INTEN3;                           /*!< (@ 0x00000330) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x00000334) Enable interrupt                                      */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x00000338) Disable interrupt                                     */
    __IM uint32_t INTPEND3;                          /*!< (@ 0x0000033C) Pending interrupts                                    */
    __IOM uint32_t INTEN4;                           /*!< (@ 0x00000340) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET4;                        /*!< (@ 0x00000344) Enable interrupt                                      */
    __IOM uint32_t INTENCLR4;                        /*!< (@ 0x00000348) Disable interrupt                                     */
    __IM uint32_t INTPEND4;                          /*!< (@ 0x0000034C) Pending interrupts                                    */
    __IOM uint32_t INTEN5;                           /*!< (@ 0x00000350) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET5;                        /*!< (@ 0x00000354) Enable interrupt                                      */
    __IOM uint32_t INTENCLR5;                        /*!< (@ 0x00000358) Disable interrupt                                     */
    __IM uint32_t INTPEND5;                          /*!< (@ 0x0000035C) Pending interrupts                                    */
    __IOM uint32_t INTEN6;                           /*!< (@ 0x00000360) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET6;                        /*!< (@ 0x00000364) Enable interrupt                                      */
    __IOM uint32_t INTENCLR6;                        /*!< (@ 0x00000368) Disable interrupt                                     */
    __IM uint32_t INTPEND6;                          /*!< (@ 0x0000036C) Pending interrupts                                    */
    __IOM uint32_t INTEN7;                           /*!< (@ 0x00000370) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET7;                        /*!< (@ 0x00000374) Enable interrupt                                      */
    __IOM uint32_t INTENCLR7;                        /*!< (@ 0x00000378) Disable interrupt                                     */
    __IM uint32_t INTPEND7;                          /*!< (@ 0x0000037C) Pending interrupts                                    */
    __IOM uint32_t INTEN8;                           /*!< (@ 0x00000380) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET8;                        /*!< (@ 0x00000384) Enable interrupt                                      */
    __IOM uint32_t INTENCLR8;                        /*!< (@ 0x00000388) Disable interrupt                                     */
    __IM uint32_t INTPEND8;                          /*!< (@ 0x0000038C) Pending interrupts                                    */
    __IOM uint32_t INTEN9;                           /*!< (@ 0x00000390) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET9;                        /*!< (@ 0x00000394) Enable interrupt                                      */
    __IOM uint32_t INTENCLR9;                        /*!< (@ 0x00000398) Disable interrupt                                     */
    __IM uint32_t INTPEND9;                          /*!< (@ 0x0000039C) Pending interrupts                                    */
    __IOM uint32_t INTEN10;                          /*!< (@ 0x000003A0) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET10;                       /*!< (@ 0x000003A4) Enable interrupt                                      */
    __IOM uint32_t INTENCLR10;                       /*!< (@ 0x000003A8) Disable interrupt                                     */
    __IM uint32_t INTPEND10;                         /*!< (@ 0x000003AC) Pending interrupts                                    */
    __IM uint32_t RESERVED8[20];
    __IOM uint32_t EVTEN;                            /*!< (@ 0x00000400) Enable or disable event routing                       */
    __IOM uint32_t EVTENSET;                         /*!< (@ 0x00000404) Enable event routing                                  */
    __IOM uint32_t EVTENCLR;                         /*!< (@ 0x00000408) Disable event routing                                 */
    __IM uint32_t RESERVED9[65];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000510) Counter mode selection                                */
    __IM uint32_t RESERVED10[3];
    __IOM NRF_GRTC_CC_Type CC[16];                   /*!< (@ 0x00000520) (unspecified)                                         */
    __IM uint32_t RESERVED11[33];
    __IOM uint32_t TIMEOUT;                          /*!< (@ 0x000006A4) Timeout after all CPUs gone into sleep state to stop
                                                                         the SYSCOUNTER*/
    __IOM uint32_t INTERVAL;                         /*!< (@ 0x000006A8) Count to add to CC[0] when the event EVENTS_COMPARE[0]
                                                                         triggers.*/
    __IM uint32_t RESERVED12[25];
    __IOM uint32_t PWMCONFIG;                        /*!< (@ 0x00000710) PWM configuration.                                    */
    __IOM uint32_t CLKOUT;                           /*!< (@ 0x00000714) Configuration of clock output                         */
    __IOM uint32_t CLKCFG;                           /*!< (@ 0x00000718) Clock Configuration                                   */
    __IM uint32_t RESERVED13;
    __IOM NRF_GRTC_SYSCOUNTER_Type SYSCOUNTER[11];   /*!< (@ 0x00000720) (unspecified)                                         */
  } NRF_GRTC_Type;                                   /*!< Size = 2000 (0x7D0)                                                  */

/* GRTC_TASKS_CAPTURE: Capture the counter value to CC[n] register */
  #define GRTC_TASKS_CAPTURE_MaxCount (16UL)         /*!< Max size of TASKS_CAPTURE[16] array.                                 */
  #define GRTC_TASKS_CAPTURE_MaxIndex (15UL)         /*!< Max index of TASKS_CAPTURE[16] array.                                */
  #define GRTC_TASKS_CAPTURE_MinIndex (0UL)          /*!< Min index of TASKS_CAPTURE[16] array.                                */
  #define GRTC_TASKS_CAPTURE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CAPTURE[16] register.                         */

