NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TASKS_CAPTURE @Bit 0 : Capture the counter value to CC[n] register */
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos (0UL) /*!< Position of TASKS_CAPTURE field.                                     */
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Msk (0x1UL << GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos) /*!< Bit mask of TASKS_CAPTURE
                                                                            field.*/
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Min (0x1UL) /*!< Min enumerator value of TASKS_CAPTURE field.                       */
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Max (0x1UL) /*!< Max enumerator value of TASKS_CAPTURE field.                       */
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Trigger (0x1UL) /*!< Trigger task                                                   */


/* GRTC_TASKS_PWMSTART: Start the PWM */
  #define GRTC_TASKS_PWMSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWMSTART register.                           */

/* TASKS_PWMSTART @Bit 0 : Start the PWM */
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Pos (0UL) /*!< Position of TASKS_PWMSTART field.                                  */
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Msk (0x1UL << GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Pos) /*!< Bit mask of
                                                                            TASKS_PWMSTART field.*/
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_PWMSTART field.                    */
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_PWMSTART field.                    */
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Trigger (0x1UL) /*!< Trigger task                                                 */


/* GRTC_TASKS_PWMSTOP: Stop the PWM */
  #define GRTC_TASKS_PWMSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWMSTOP register.                             */

/* TASKS_PWMSTOP @Bit 0 : Stop the PWM */
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Pos (0UL) /*!< Position of TASKS_PWMSTOP field.                                     */
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Msk (0x1UL << GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Pos) /*!< Bit mask of TASKS_PWMSTOP
                                                                            field.*/
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWMSTOP field.                       */
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWMSTOP field.                       */
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Trigger (0x1UL) /*!< Trigger task                                                   */


/* GRTC_SUBSCRIBE_CAPTURE: Subscribe configuration for task CAPTURE[n] */
  #define GRTC_SUBSCRIBE_CAPTURE_MaxCount (16UL)     /*!< Max size of SUBSCRIBE_CAPTURE[16] array.                             */
  #define GRTC_SUBSCRIBE_CAPTURE_MaxIndex (15UL)     /*!< Max index of SUBSCRIBE_CAPTURE[16] array.                            */
  #define GRTC_SUBSCRIBE_CAPTURE_MinIndex (0UL)      /*!< Min index of SUBSCRIBE_CAPTURE[16] array.                            */
  #define GRTC_SUBSCRIBE_CAPTURE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CAPTURE[16] register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that task CAPTURE[n] will subscribe to */
  #define GRTC_SUBSCRIBE_CAPTURE_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define GRTC_SUBSCRIBE_CAPTURE_CHIDX_Msk (0xFFUL << GRTC_SUBSCRIBE_CAPTURE_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define GRTC_SUBSCRIBE_CAPTURE_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define GRTC_SUBSCRIBE_CAPTURE_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Msk (0x1UL << GRTC_SUBSCRIBE_CAPTURE_EN_Pos) /*!< Bit mask of EN field.                    */
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* GRTC_EVENTS_COMPARE: Compare event on CC[n] match */
  #define GRTC_EVENTS_COMPARE_MaxCount (16UL)        /*!< Max size of EVENTS_COMPARE[16] array.                                */
  #define GRTC_EVENTS_COMPARE_MaxIndex (15UL)        /*!< Max index of EVENTS_COMPARE[16] array.                               */
  #define GRTC_EVENTS_COMPARE_MinIndex (0UL)         /*!< Min index of EVENTS_COMPARE[16] array.                               */
  #define GRTC_EVENTS_COMPARE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_COMPARE[16] register.                       */

/* EVENTS_COMPARE @Bit 0 : Compare event on CC[n] match */
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL) /*!< Position of EVENTS_COMPARE field.                                  */
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of
                                                                            EVENTS_COMPARE field.*/
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Min (0x0UL) /*!< Min enumerator value of EVENTS_COMPARE field.                    */
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Max (0x1UL) /*!< Max enumerator value of EVENTS_COMPARE field.                    */
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Generated (0x1UL) /*!< Event generated                                            */


/* GRTC_EVENTS_RTCOMPARESYNC: The GRTC low frequency timer is synchronized with the SYSCOUNTER */
  #define GRTC_EVENTS_RTCOMPARESYNC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RTCOMPARESYNC register.               */

/* EVENTS_RTCOMPARESYNC @Bit 0 : The GRTC low frequency timer is synchronized with the SYSCOUNTER */
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Pos (0UL) /*!< Position of EVENTS_RTCOMPARESYNC field.                */
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Msk (0x1UL << GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Pos) /*!<
                                                                            Bit mask of EVENTS_RTCOMPARESYNC field.*/
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Min (0x0UL) /*!< Min enumerator value of EVENTS_RTCOMPARESYNC field.  */
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Max (0x1UL) /*!< Max enumerator value of EVENTS_RTCOMPARESYNC field.  */
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Generated (0x1UL) /*!< Event generated                                */


/* GRTC_EVENTS_PWMPERIODEND: Event on end of each PWM period */
  #define GRTC_EVENTS_PWMPERIODEND_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PWMPERIODEND register.                 */

