NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* COMPARE12 @Bit 12 : Write '1' to disable interrupt for event COMPARE[12] */
  #define GRTC_INTENCLR10_COMPARE12_Pos (12UL)       /*!< Position of COMPARE12 field.                                         */
  #define GRTC_INTENCLR10_COMPARE12_Msk (0x1UL << GRTC_INTENCLR10_COMPARE12_Pos) /*!< Bit mask of COMPARE12 field.             */
  #define GRTC_INTENCLR10_COMPARE12_Min (0x0UL)      /*!< Min enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENCLR10_COMPARE12_Max (0x1UL)      /*!< Max enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENCLR10_COMPARE12_Clear (0x1UL)    /*!< Disable                                                              */
  #define GRTC_INTENCLR10_COMPARE12_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR10_COMPARE12_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPARE13 @Bit 13 : Write '1' to disable interrupt for event COMPARE[13] */
  #define GRTC_INTENCLR10_COMPARE13_Pos (13UL)       /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTENCLR10_COMPARE13_Msk (0x1UL << GRTC_INTENCLR10_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.             */
  #define GRTC_INTENCLR10_COMPARE13_Min (0x0UL)      /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENCLR10_COMPARE13_Max (0x1UL)      /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENCLR10_COMPARE13_Clear (0x1UL)    /*!< Disable                                                              */
  #define GRTC_INTENCLR10_COMPARE13_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR10_COMPARE13_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPARE14 @Bit 14 : Write '1' to disable interrupt for event COMPARE[14] */
  #define GRTC_INTENCLR10_COMPARE14_Pos (14UL)       /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTENCLR10_COMPARE14_Msk (0x1UL << GRTC_INTENCLR10_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.             */
  #define GRTC_INTENCLR10_COMPARE14_Min (0x0UL)      /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENCLR10_COMPARE14_Max (0x1UL)      /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENCLR10_COMPARE14_Clear (0x1UL)    /*!< Disable                                                              */
  #define GRTC_INTENCLR10_COMPARE14_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR10_COMPARE14_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* COMPARE15 @Bit 15 : Write '1' to disable interrupt for event COMPARE[15] */
  #define GRTC_INTENCLR10_COMPARE15_Pos (15UL)       /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTENCLR10_COMPARE15_Msk (0x1UL << GRTC_INTENCLR10_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.             */
  #define GRTC_INTENCLR10_COMPARE15_Min (0x0UL)      /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENCLR10_COMPARE15_Max (0x1UL)      /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENCLR10_COMPARE15_Clear (0x1UL)    /*!< Disable                                                              */
  #define GRTC_INTENCLR10_COMPARE15_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR10_COMPARE15_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RTCOMPARESYNC @Bit 25 : Write '1' to disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENCLR10_RTCOMPARESYNC_Pos (25UL)   /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTENCLR10_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENCLR10_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field. */
  #define GRTC_INTENCLR10_RTCOMPARESYNC_Min (0x0UL)  /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENCLR10_RTCOMPARESYNC_Max (0x1UL)  /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENCLR10_RTCOMPARESYNC_Clear (0x1UL) /*!< Disable                                                             */
  #define GRTC_INTENCLR10_RTCOMPARESYNC_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define GRTC_INTENCLR10_RTCOMPARESYNC_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* PWMPERIODEND @Bit 27 : Write '1' to disable interrupt for event PWMPERIODEND */
  #define GRTC_INTENCLR10_PWMPERIODEND_Pos (27UL)    /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTENCLR10_PWMPERIODEND_Msk (0x1UL << GRTC_INTENCLR10_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.    */
  #define GRTC_INTENCLR10_PWMPERIODEND_Min (0x0UL)   /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENCLR10_PWMPERIODEND_Max (0x1UL)   /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENCLR10_PWMPERIODEND_Clear (0x1UL) /*!< Disable                                                              */
  #define GRTC_INTENCLR10_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GRTC_INTENCLR10_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* GRTC_INTPEND10: Pending interrupts */
  #define GRTC_INTPEND10_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND10 register.                                   */

/* COMPARE0 @Bit 0 : Read pending status of interrupt for event COMPARE[0] */
  #define GRTC_INTPEND10_COMPARE0_Pos (0UL)          /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTPEND10_COMPARE0_Msk (0x1UL << GRTC_INTPEND10_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                  */
  #define GRTC_INTPEND10_COMPARE0_Min (0x0UL)        /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTPEND10_COMPARE0_Max (0x1UL)        /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTPEND10_COMPARE0_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND10_COMPARE0_Pending (0x1UL)    /*!< Read: Pending                                                        */

