NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CLKOUTFAST @Bit 1 : Enable fast clock output on pin */
  #define GRTC_CLKOUT_CLKOUTFAST_Pos (1UL)           /*!< Position of CLKOUTFAST field.                                        */
  #define GRTC_CLKOUT_CLKOUTFAST_Msk (0x1UL << GRTC_CLKOUT_CLKOUTFAST_Pos) /*!< Bit mask of CLKOUTFAST field.                  */
  #define GRTC_CLKOUT_CLKOUTFAST_Min (0x0UL)         /*!< Min enumerator value of CLKOUTFAST field.                            */
  #define GRTC_CLKOUT_CLKOUTFAST_Max (0x1UL)         /*!< Max enumerator value of CLKOUTFAST field.                            */
  #define GRTC_CLKOUT_CLKOUTFAST_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define GRTC_CLKOUT_CLKOUTFAST_Enabled (0x1UL)     /*!< Enabled                                                              */


/* GRTC_CLKCFG: Clock Configuration */
  #define GRTC_CLKCFG_ResetValue (0x00010001UL)      /*!< Reset value of CLKCFG register.                                      */

/* CLKFASTDIV @Bits 0..7 : Fast clock divisor value of clock output */
  #define GRTC_CLKCFG_CLKFASTDIV_Pos (0UL)           /*!< Position of CLKFASTDIV field.                                        */
  #define GRTC_CLKCFG_CLKFASTDIV_Msk (0xFFUL << GRTC_CLKCFG_CLKFASTDIV_Pos) /*!< Bit mask of CLKFASTDIV field.                 */
  #define GRTC_CLKCFG_CLKFASTDIV_Min (0x01UL)        /*!< Min value of CLKFASTDIV field.                                       */
  #define GRTC_CLKCFG_CLKFASTDIV_Max (0xFFUL)        /*!< Max size of CLKFASTDIV field.                                        */

/* CLKSEL @Bits 16..17 : GRTC LFCLK clock source selection */
  #define GRTC_CLKCFG_CLKSEL_Pos (16UL)              /*!< Position of CLKSEL field.                                            */
  #define GRTC_CLKCFG_CLKSEL_Msk (0x3UL << GRTC_CLKCFG_CLKSEL_Pos) /*!< Bit mask of CLKSEL field.                              */
  #define GRTC_CLKCFG_CLKSEL_Min (0x0UL)             /*!< Min enumerator value of CLKSEL field.                                */
  #define GRTC_CLKCFG_CLKSEL_Max (0x2UL)             /*!< Max enumerator value of CLKSEL field.                                */
  #define GRTC_CLKCFG_CLKSEL_LFXO (0x0UL)            /*!< GRTC LFCLK clock source is LFXO                                      */
  #define GRTC_CLKCFG_CLKSEL_SystemLFCLK (0x1UL)     /*!< GRTC LFCLK clock source is system LFCLK                              */
  #define GRTC_CLKCFG_CLKSEL_LFLPRC (0x2UL)          /*!< GRTC LFCLK clock source is LFLPRC                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           HSFLL                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct HSFLL_TRIM ==================================================== */
/**
  * @brief TRIM [HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VSUP;                              /*!< (@ 0x00000000) Internal regulator voltage supply level trimming      */
  __IOM uint32_t  COARSE;                            /*!< (@ 0x00000004) Coarse frequency trimming                             */
  __IOM uint32_t  FINE;                              /*!< (@ 0x00000008) Fine frequency trimming                               */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  TCOEF;                             /*!< (@ 0x00000010) Temperature coefficient trimming                      */
} NRF_HSFLL_TRIM_Type;                               /*!< Size = 20 (0x014)                                                    */

/* HSFLL_TRIM_VSUP: Internal regulator voltage supply level trimming */
  #define HSFLL_TRIM_VSUP_ResetValue (0x0000000FUL)  /*!< Reset value of VSUP register.                                        */

/* VALUE @Bits 0..4 : Trim value */
  #define HSFLL_TRIM_VSUP_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_VSUP_VALUE_Msk (0x1FUL << HSFLL_TRIM_VSUP_VALUE_Pos) /*!< Bit mask of VALUE field.                        */


/* HSFLL_TRIM_COARSE: Coarse frequency trimming */
  #define HSFLL_TRIM_COARSE_ResetValue (0x00000002UL) /*!< Reset value of COARSE register.                                     */

/* VALUE @Bits 0..9 : Coarse frequency trimming value. */
  #define HSFLL_TRIM_COARSE_VALUE_Pos (0UL)          /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_COARSE_VALUE_Msk (0x3FFUL << HSFLL_TRIM_COARSE_VALUE_Pos) /*!< Bit mask of VALUE field.                   */


/* HSFLL_TRIM_FINE: Fine frequency trimming */
  #define HSFLL_TRIM_FINE_ResetValue (0x0000001EUL)  /*!< Reset value of FINE register.                                        */

/* VALUE @Bits 0..10 : Fine frequency trimming value */
  #define HSFLL_TRIM_FINE_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_FINE_VALUE_Msk (0x7FFUL << HSFLL_TRIM_FINE_VALUE_Pos) /*!< Bit mask of VALUE field.                       */


/* HSFLL_TRIM_TCOEF: Temperature coefficient trimming */
  #define HSFLL_TRIM_TCOEF_ResetValue (0x00000002UL) /*!< Reset value of TCOEF register.                                       */

/* VALUE @Bits 0..3 : Trim value. */
  #define HSFLL_TRIM_TCOEF_VALUE_Pos (0UL)           /*!< Position of VALUE field.                                             */
  #define HSFLL_TRIM_TCOEF_VALUE_Msk (0xFUL << HSFLL_TRIM_TCOEF_VALUE_Pos) /*!< Bit mask of VALUE field.                       */



/* ================================================= Struct HSFLL_CLOCKCTRL ================================================== */
/**
  * @brief CLOCKCTRL [HSFLL_CLOCKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Clock control                                         */
  __IOM uint32_t  DITHERING;                         /*!< (@ 0x00000004) Clock dithering configuration                         */
  __IOM uint32_t  MULT;                              /*!< (@ 0x00000008) Multiplication factor                                 */
  __IM  uint32_t  RESERVED[3];
  __IOM uint32_t  DITHERINIT;                        /*!< (@ 0x00000018) Clock dithering, configurable seed                    */
} NRF_HSFLL_CLOCKCTRL_Type;                          /*!< Size = 28 (0x01C)                                                    */

/* HSFLL_CLOCKCTRL_MODE: Clock control */
  #define HSFLL_CLOCKCTRL_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                    */

