NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MODE @Bits 0..1 : The HSFLL operating mode. */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Pos (0UL)        /*!< Position of MODE field.                                              */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Msk (0x3UL << HSFLL_CLOCKCTRL_MODE_MODE_Pos) /*!< Bit mask of MODE field.                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Min (0x0UL)      /*!< Min enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Max (0x2UL)      /*!< Max enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Auto (0x0UL)     /*!< The LRC controls the HSFLL mode automatically.                       */
  #define HSFLL_CLOCKCTRL_MODE_MODE_OpenLoop (0x1UL) /*!< Open-loop mode. The coarse HSFLL trim can be changed.                */
  #define HSFLL_CLOCKCTRL_MODE_MODE_ClosedLoop (0x2UL) /*!< Closed-loop mode.                                                  */


/* HSFLL_CLOCKCTRL_DITHERING: Clock dithering configuration */
  #define HSFLL_CLOCKCTRL_DITHERING_ResetValue (0x00000033UL) /*!< Reset value of DITHERING register.                          */

/* CYCLECOUNT @Bits 0..2 : Cycle count configuration for clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos (0UL) /*!< Position of CYCLECOUNT field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Msk (0x7UL << HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos) /*!< Bit mask of
                                                                            CYCLECOUNT field.*/

/* MAXOFFSET @Bits 4..6 : Maximum offset configuration for clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Pos (4UL) /*!< Position of MAXOFFSET field.                                      */
  #define HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Msk (0x7UL << HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Pos) /*!< Bit mask of MAXOFFSET
                                                                            field.*/

/* EN @Bit 31 : Enable the clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Msk (0x1UL << HSFLL_CLOCKCTRL_DITHERING_EN_Pos) /*!< Bit mask of EN field.              */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Disabled (0x0UL) /*!< Clock dithering is disabled                                       */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Enabled (0x1UL) /*!< Clock dithering is enabled                                         */


/* HSFLL_CLOCKCTRL_MULT: Multiplication factor */
  #define HSFLL_CLOCKCTRL_MULT_ResetValue (0x00000004UL) /*!< Reset value of MULT register.                                    */

/* VAL @Bits 0..4 : Multiplication factor value. Valid range: 4 to 25. Output frequency is a multiplication of 16 MHz reference
                    and the multiplication factor. */

  #define HSFLL_CLOCKCTRL_MULT_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define HSFLL_CLOCKCTRL_MULT_VAL_Msk (0x1FUL << HSFLL_CLOCKCTRL_MULT_VAL_Pos) /*!< Bit mask of VAL field.                    */


/* HSFLL_CLOCKCTRL_DITHERINIT: Clock dithering, configurable seed */
  #define HSFLL_CLOCKCTRL_DITHERINIT_ResetValue (0x00000000UL) /*!< Reset value of DITHERINIT register.                        */

/* SEED @Bits 0..31 : Initial PRNG seed value for clock dithering. */
  #define HSFLL_CLOCKCTRL_DITHERINIT_SEED_Pos (0UL)  /*!< Position of SEED field.                                              */
  #define HSFLL_CLOCKCTRL_DITHERINIT_SEED_Msk (0xFFFFFFFFUL << HSFLL_CLOCKCTRL_DITHERINIT_SEED_Pos) /*!< Bit mask of SEED
                                                                            field.*/


/* ====================================================== Struct HSFLL ======================================================= */
/**
  * @brief HSFLL
  */
  typedef struct {                                   /*!< HSFLL Structure                                                      */
    __IM uint32_t RESERVED[5];
    __OM uint32_t TASKS_FREQCHANGE;                  /*!< (@ 0x00000014) Trigger frequency change                              */
    __IM uint32_t RESERVED1[62];
    __IOM uint32_t EVENTS_FREQCHANGED;               /*!< (@ 0x00000110) Frequency change done                                 */
    __IM uint32_t RESERVED2[187];
    __IM uint32_t CLOCKSTATUS;                       /*!< (@ 0x00000400) Clock status                                          */
    __IM uint32_t RESERVED3[15];
    __IOM NRF_HSFLL_TRIM_Type TRIM;                  /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED4[3];
    __IOM NRF_HSFLL_CLOCKCTRL_Type CLOCKCTRL;        /*!< (@ 0x00000460) (unspecified)                                         */
    __IM uint32_t RESERVED5;
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK to write mirrored registers               */
  } NRF_HSFLL_Type;                                  /*!< Size = 1156 (0x484)                                                  */

/* HSFLL_TASKS_FREQCHANGE: Trigger frequency change */
  #define HSFLL_TASKS_FREQCHANGE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FREQCHANGE register.                      */

/* TASKS_FREQCHANGE @Bit 0 : Trigger frequency change */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos (0UL) /*!< Position of TASKS_FREQCHANGE field.                           */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Msk (0x1UL << HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos) /*!< Bit mask of
                                                                            TASKS_FREQCHANGE field.*/
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Min (0x1UL) /*!< Min enumerator value of TASKS_FREQCHANGE field.             */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Max (0x1UL) /*!< Max enumerator value of TASKS_FREQCHANGE field.             */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Trigger (0x1UL) /*!< Trigger task                                            */


/* HSFLL_EVENTS_FREQCHANGED: Frequency change done */
  #define HSFLL_EVENTS_FREQCHANGED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FREQCHANGED register.                  */

/* EVENTS_FREQCHANGED @Bit 0 : Frequency change done */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos (0UL) /*!< Position of EVENTS_FREQCHANGED field.                     */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Msk (0x1UL << HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos) /*!< Bit
                                                                            mask of EVENTS_FREQCHANGED field.*/
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Min (0x0UL) /*!< Min enumerator value of EVENTS_FREQCHANGED field.       */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Max (0x1UL) /*!< Max enumerator value of EVENTS_FREQCHANGED field.       */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Generated (0x1UL) /*!< Event generated                                   */


