NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* HSFLL_CLOCKSTATUS: Clock status */
  #define HSFLL_CLOCKSTATUS_ResetValue (0x00000000UL) /*!< Reset value of CLOCKSTATUS register.                                */

/* MODE @Bits 0..1 : The HSFLL operating mode. */
  #define HSFLL_CLOCKSTATUS_MODE_Pos (0UL)           /*!< Position of MODE field.                                              */
  #define HSFLL_CLOCKSTATUS_MODE_Msk (0x3UL << HSFLL_CLOCKSTATUS_MODE_Pos) /*!< Bit mask of MODE field.                        */
  #define HSFLL_CLOCKSTATUS_MODE_Min (0x0UL)         /*!< Min enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKSTATUS_MODE_Max (0x1UL)         /*!< Max enumerator value of MODE field.                                  */
  #define HSFLL_CLOCKSTATUS_MODE_OpenLoop (0x0UL)    /*!< Open loop mode.                                                      */
  #define HSFLL_CLOCKSTATUS_MODE_ClosedLoop (0x1UL)  /*!< Closed loop mode.                                                    */

/* ACCURACY @Bit 9 : Clock accuracy. */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Pos (9UL)       /*!< Position of ACCURACY field.                                          */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Msk (0x1UL << HSFLL_CLOCKSTATUS_ACCURACY_Pos) /*!< Bit mask of ACCURACY field.            */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Min (0x0UL)     /*!< Min enumerator value of ACCURACY field.                              */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Max (0x1UL)     /*!< Max enumerator value of ACCURACY field.                              */
  #define HSFLL_CLOCKSTATUS_ACCURACY_OutsideLimit (0x0UL) /*!< Clock accuracy is outside 2 percent.                            */
  #define HSFLL_CLOCKSTATUS_ACCURACY_WithinLimit (0x1UL) /*!< Clock accuracy is within 2 percent.                              */

/* LOCKED @Bit 10 : The HSFLL lock status. */
  #define HSFLL_CLOCKSTATUS_LOCKED_Pos (10UL)        /*!< Position of LOCKED field.                                            */
  #define HSFLL_CLOCKSTATUS_LOCKED_Msk (0x1UL << HSFLL_CLOCKSTATUS_LOCKED_Pos) /*!< Bit mask of LOCKED field.                  */
  #define HSFLL_CLOCKSTATUS_LOCKED_Min (0x0UL)       /*!< Min enumerator value of LOCKED field.                                */
  #define HSFLL_CLOCKSTATUS_LOCKED_Max (0x1UL)       /*!< Max enumerator value of LOCKED field.                                */
  #define HSFLL_CLOCKSTATUS_LOCKED_NotLocked (0x0UL) /*!< Not locked to reference clock                                        */
  #define HSFLL_CLOCKSTATUS_LOCKED_Locked (0x1UL)    /*!< Locked to reference clock.                                           */


/* HSFLL_MIRROR: Enable LOCK to write mirrored registers */
  #define HSFLL_MIRROR_ResetValue (0x00000001UL)     /*!< Reset value of MIRROR register.                                      */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define HSFLL_MIRROR_LOCK_Pos (0UL)                /*!< Position of LOCK field.                                              */
  #define HSFLL_MIRROR_LOCK_Msk (0x1UL << HSFLL_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Min (0x0UL)              /*!< Min enumerator value of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Max (0x1UL)              /*!< Max enumerator value of LOCK field.                                  */
  #define HSFLL_MIRROR_LOCK_Disabled (0x0UL)         /*!< Lock disabled                                                        */
  #define HSFLL_MIRROR_LOCK_Enabled (0x1UL)          /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        ICACHEDATA                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct ICACHEDATA_SET_WAY_DU =============================================== */
/**
  * @brief DU [ICACHEDATA_SET_WAY_DU] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[2];                           /*!< (@ 0x00000000) Cache data bits for DATA[q] in DU[p] (DataUnit) of
                                                                         SET[n], WAY[o].*/
} NRF_ICACHEDATA_SET_WAY_DU_Type;                    /*!< Size = 8 (0x008)                                                     */
  #define ICACHEDATA_SET_WAY_DU_MaxCount (4UL)       /*!< Size of DU[4] array.                                                 */
  #define ICACHEDATA_SET_WAY_DU_MaxIndex (3UL)       /*!< Max index of DU[4] array.                                            */
  #define ICACHEDATA_SET_WAY_DU_MinIndex (0UL)       /*!< Min index of DU[4] array.                                            */

/* ICACHEDATA_SET_WAY_DU_DATA: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o]. */
  #define ICACHEDATA_SET_WAY_DU_DATA_MaxCount (2UL)  /*!< Max size of DATA[2] array.                                           */
  #define ICACHEDATA_SET_WAY_DU_DATA_MaxIndex (1UL)  /*!< Max index of DATA[2] array.                                          */
  #define ICACHEDATA_SET_WAY_DU_DATA_MinIndex (0UL)  /*!< Min index of DATA[2] array.                                          */
  #define ICACHEDATA_SET_WAY_DU_DATA_ResetValue (0x00000000UL) /*!< Reset value of DATA[2] register.                           */

/* Data @Bits 0..31 : Data */
  #define ICACHEDATA_SET_WAY_DU_DATA_Data_Pos (0UL)  /*!< Position of Data field.                                              */
  #define ICACHEDATA_SET_WAY_DU_DATA_Data_Msk (0xFFFFFFFFUL << ICACHEDATA_SET_WAY_DU_DATA_Data_Pos) /*!< Bit mask of Data
                                                                            field.*/



/* ================================================ Struct ICACHEDATA_SET_WAY ================================================ */
/**
  * @brief WAY [ICACHEDATA_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM NRF_ICACHEDATA_SET_WAY_DU_Type DU[4];        /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_ICACHEDATA_SET_WAY_Type;                       /*!< Size = 32 (0x020)                                                    */
  #define ICACHEDATA_SET_WAY_MaxCount (2UL)          /*!< Size of WAY[2] array.                                                */
  #define ICACHEDATA_SET_WAY_MaxIndex (1UL)          /*!< Max index of WAY[2] array.                                           */
  #define ICACHEDATA_SET_WAY_MinIndex (0UL)          /*!< Min index of WAY[2] array.                                           */


