NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* SEND15 @Bit 15 : Overflow status for SEND[15] task */
  #define IPCT_OVERFLOW_SEND_SEND15_Pos (15UL)       /*!< Position of SEND15 field.                                            */
  #define IPCT_OVERFLOW_SEND_SEND15_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND15_Pos) /*!< Bit mask of SEND15 field.                */
  #define IPCT_OVERFLOW_SEND_SEND15_Min (0x0UL)      /*!< Min enumerator value of SEND15 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND15_Max (0x1UL)      /*!< Max enumerator value of SEND15 field.                                */
  #define IPCT_OVERFLOW_SEND_SEND15_Overflow (0x1UL) /*!< Task overflow has happened                                           */
  #define IPCT_OVERFLOW_SEND_SEND15_NoOverflow (0x0UL) /*!< Task overflow has not happened                                     */


/* ======================================================= Struct IPCT ======================================================= */
/**
  * @brief IPCT APB registers
  */
  typedef struct {                                   /*!< IPCT Structure                                                       */
    __OM uint32_t TASKS_SEND[16];                    /*!< (@ 0x00000000) Trigger event on IPCT source channel n if there are no
                                                                         active signals present on that channel*/
    __OM uint32_t TASKS_FLUSH[16];                   /*!< (@ 0x00000040) Flush IPCT sink channel n. Any pending IPCT signal on
                                                                         that channel will re-trigger the RECEIVE[n] event. The
                                                                         flush can happen automatically by configuring the
                                                                         SHORTS register accordingly.*/
    __IOM uint32_t SUBSCRIBE_SEND[16];               /*!< (@ 0x00000080) Subscribe configuration for task SEND[n]              */
    __IOM uint32_t SUBSCRIBE_FLUSH[16];              /*!< (@ 0x000000C0) Subscribe configuration for task FLUSH[n]             */
    __IOM uint32_t EVENTS_RECEIVE[16];               /*!< (@ 0x00000100) Event received on IPCT sink channel n                 */
    __IOM uint32_t EVENTS_READY[16];                 /*!< (@ 0x00000140) Event received when hardware handshake of SEND task for
                                                                         IPCT source channel n is complete and a new signal can
                                                                         be triggered on that channel.*/
    __IOM uint32_t PUBLISH_RECEIVE[16];              /*!< (@ 0x00000180) Publish configuration for event RECEIVE[n]            */
    __IOM uint32_t PUBLISH_READY[16];                /*!< (@ 0x000001C0) Publish configuration for event READY[n]              */
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED[63];
    __IOM uint32_t INTEN0;                           /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET0;                        /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR0;                        /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND0;                          /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IOM uint32_t INTEN1;                           /*!< (@ 0x00000310) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET1;                        /*!< (@ 0x00000314) Enable interrupt                                      */
    __IOM uint32_t INTENCLR1;                        /*!< (@ 0x00000318) Disable interrupt                                     */
    __IM uint32_t INTPEND1;                          /*!< (@ 0x0000031C) Pending interrupts                                    */
    __IOM uint32_t INTEN2;                           /*!< (@ 0x00000320) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET2;                        /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t INTENCLR2;                        /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t INTPEND2;                          /*!< (@ 0x0000032C) Pending interrupts                                    */
    __IOM uint32_t INTEN3;                           /*!< (@ 0x00000330) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET3;                        /*!< (@ 0x00000334) Enable interrupt                                      */
    __IOM uint32_t INTENCLR3;                        /*!< (@ 0x00000338) Disable interrupt                                     */
    __IM uint32_t INTPEND3;                          /*!< (@ 0x0000033C) Pending interrupts                                    */
    __IOM uint32_t INTEN4;                           /*!< (@ 0x00000340) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET4;                        /*!< (@ 0x00000344) Enable interrupt                                      */
    __IOM uint32_t INTENCLR4;                        /*!< (@ 0x00000348) Disable interrupt                                     */
    __IM uint32_t INTPEND4;                          /*!< (@ 0x0000034C) Pending interrupts                                    */
    __IOM uint32_t INTEN5;                           /*!< (@ 0x00000350) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET5;                        /*!< (@ 0x00000354) Enable interrupt                                      */
    __IOM uint32_t INTENCLR5;                        /*!< (@ 0x00000358) Disable interrupt                                     */
    __IM uint32_t INTPEND5;                          /*!< (@ 0x0000035C) Pending interrupts                                    */
    __IOM uint32_t INTEN6;                           /*!< (@ 0x00000360) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET6;                        /*!< (@ 0x00000364) Enable interrupt                                      */
    __IOM uint32_t INTENCLR6;                        /*!< (@ 0x00000368) Disable interrupt                                     */
    __IM uint32_t INTPEND6;                          /*!< (@ 0x0000036C) Pending interrupts                                    */
    __IOM uint32_t INTEN7;                           /*!< (@ 0x00000370) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET7;                        /*!< (@ 0x00000374) Enable interrupt                                      */
    __IOM uint32_t INTENCLR7;                        /*!< (@ 0x00000378) Disable interrupt                                     */
    __IM uint32_t INTPEND7;                          /*!< (@ 0x0000037C) Pending interrupts                                    */
    __IM uint32_t RESERVED1[32];
    __IOM NRF_IPCT_OVERFLOW_Type OVERFLOW;           /*!< (@ 0x00000400) (unspecified)                                         */
  } NRF_IPCT_Type;                                   /*!< Size = 1028 (0x404)                                                  */

/* IPCT_TASKS_SEND: Trigger event on IPCT source channel n if there are no active signals present on that channel */
  #define IPCT_TASKS_SEND_MaxCount (16UL)            /*!< Max size of TASKS_SEND[16] array.                                    */
  #define IPCT_TASKS_SEND_MaxIndex (15UL)            /*!< Max index of TASKS_SEND[16] array.                                   */
  #define IPCT_TASKS_SEND_MinIndex (0UL)             /*!< Min index of TASKS_SEND[16] array.                                   */
  #define IPCT_TASKS_SEND_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_SEND[16] register.                              */

/* TASKS_SEND @Bit 0 : Trigger event on IPCT source channel n if there are no active signals present on that channel */
  #define IPCT_TASKS_SEND_TASKS_SEND_Pos (0UL)       /*!< Position of TASKS_SEND field.                                        */
  #define IPCT_TASKS_SEND_TASKS_SEND_Msk (0x1UL << IPCT_TASKS_SEND_TASKS_SEND_Pos) /*!< Bit mask of TASKS_SEND field.          */
  #define IPCT_TASKS_SEND_TASKS_SEND_Min (0x1UL)     /*!< Min enumerator value of TASKS_SEND field.                            */
  #define IPCT_TASKS_SEND_TASKS_SEND_Max (0x1UL)     /*!< Max enumerator value of TASKS_SEND field.                            */
  #define IPCT_TASKS_SEND_TASKS_SEND_Trigger (0x1UL) /*!< Trigger task                                                         */


/* IPCT_TASKS_FLUSH: Flush IPCT sink channel n. Any pending IPCT signal on that channel will re-trigger the RECEIVE[n] event.
                      The flush can happen automatically by configuring the SHORTS register accordingly. */

  #define IPCT_TASKS_FLUSH_MaxCount (16UL)           /*!< Max size of TASKS_FLUSH[16] array.                                   */
  #define IPCT_TASKS_FLUSH_MaxIndex (15UL)           /*!< Max index of TASKS_FLUSH[16] array.                                  */
  #define IPCT_TASKS_FLUSH_MinIndex (0UL)            /*!< Min index of TASKS_FLUSH[16] array.                                  */
  #define IPCT_TASKS_FLUSH_ResetValue (0x00000000UL) /*!< Reset value of TASKS_FLUSH[16] register.                             */

