NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TASKS_FLUSH @Bit 0 : Flush IPCT sink channel n. Any pending IPCT signal on that channel will re-trigger the RECEIVE[n] event.
                        The flush can happen automatically by configuring the SHORTS register accordingly. */

  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Pos (0UL)     /*!< Position of TASKS_FLUSH field.                                       */
  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Msk (0x1UL << IPCT_TASKS_FLUSH_TASKS_FLUSH_Pos) /*!< Bit mask of TASKS_FLUSH field.     */
  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Min (0x1UL)   /*!< Min enumerator value of TASKS_FLUSH field.                           */
  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Max (0x1UL)   /*!< Max enumerator value of TASKS_FLUSH field.                           */
  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Trigger (0x1UL) /*!< Trigger task                                                       */


/* IPCT_SUBSCRIBE_SEND: Subscribe configuration for task SEND[n] */
  #define IPCT_SUBSCRIBE_SEND_MaxCount (16UL)        /*!< Max size of SUBSCRIBE_SEND[16] array.                                */
  #define IPCT_SUBSCRIBE_SEND_MaxIndex (15UL)        /*!< Max index of SUBSCRIBE_SEND[16] array.                               */
  #define IPCT_SUBSCRIBE_SEND_MinIndex (0UL)         /*!< Min index of SUBSCRIBE_SEND[16] array.                               */
  #define IPCT_SUBSCRIBE_SEND_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SEND[16] register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that task SEND[n] will subscribe to */
  #define IPCT_SUBSCRIBE_SEND_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define IPCT_SUBSCRIBE_SEND_CHIDX_Msk (0xFFUL << IPCT_SUBSCRIBE_SEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define IPCT_SUBSCRIBE_SEND_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define IPCT_SUBSCRIBE_SEND_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_SUBSCRIBE_SEND_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define IPCT_SUBSCRIBE_SEND_EN_Msk (0x1UL << IPCT_SUBSCRIBE_SEND_EN_Pos) /*!< Bit mask of EN field.                          */
  #define IPCT_SUBSCRIBE_SEND_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define IPCT_SUBSCRIBE_SEND_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define IPCT_SUBSCRIBE_SEND_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define IPCT_SUBSCRIBE_SEND_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* IPCT_SUBSCRIBE_FLUSH: Subscribe configuration for task FLUSH[n] */
  #define IPCT_SUBSCRIBE_FLUSH_MaxCount (16UL)       /*!< Max size of SUBSCRIBE_FLUSH[16] array.                               */
  #define IPCT_SUBSCRIBE_FLUSH_MaxIndex (15UL)       /*!< Max index of SUBSCRIBE_FLUSH[16] array.                              */
  #define IPCT_SUBSCRIBE_FLUSH_MinIndex (0UL)        /*!< Min index of SUBSCRIBE_FLUSH[16] array.                              */
  #define IPCT_SUBSCRIBE_FLUSH_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_FLUSH[16] register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task FLUSH[n] will subscribe to */
  #define IPCT_SUBSCRIBE_FLUSH_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define IPCT_SUBSCRIBE_FLUSH_CHIDX_Msk (0xFFUL << IPCT_SUBSCRIBE_FLUSH_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define IPCT_SUBSCRIBE_FLUSH_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define IPCT_SUBSCRIBE_FLUSH_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_SUBSCRIBE_FLUSH_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define IPCT_SUBSCRIBE_FLUSH_EN_Msk (0x1UL << IPCT_SUBSCRIBE_FLUSH_EN_Pos) /*!< Bit mask of EN field.                        */
  #define IPCT_SUBSCRIBE_FLUSH_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define IPCT_SUBSCRIBE_FLUSH_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define IPCT_SUBSCRIBE_FLUSH_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define IPCT_SUBSCRIBE_FLUSH_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* IPCT_EVENTS_RECEIVE: Event received on IPCT sink channel n */
  #define IPCT_EVENTS_RECEIVE_MaxCount (16UL)        /*!< Max size of EVENTS_RECEIVE[16] array.                                */
  #define IPCT_EVENTS_RECEIVE_MaxIndex (15UL)        /*!< Max index of EVENTS_RECEIVE[16] array.                               */
  #define IPCT_EVENTS_RECEIVE_MinIndex (0UL)         /*!< Min index of EVENTS_RECEIVE[16] array.                               */
  #define IPCT_EVENTS_RECEIVE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RECEIVE[16] register.                       */

/* EVENTS_RECEIVE @Bit 0 : Event received on IPCT sink channel n */
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos (0UL) /*!< Position of EVENTS_RECEIVE field.                                  */
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Msk (0x1UL << IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos) /*!< Bit mask of
                                                                            EVENTS_RECEIVE field.*/
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Min (0x0UL) /*!< Min enumerator value of EVENTS_RECEIVE field.                    */
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Max (0x1UL) /*!< Max enumerator value of EVENTS_RECEIVE field.                    */
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Generated (0x1UL) /*!< Event generated                                            */


/* IPCT_EVENTS_READY: Event received when hardware handshake of SEND task for IPCT source channel n is complete and a new signal
                       can be triggered on that channel. */

