NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
  #define IPCT_EVENTS_READY_MaxCount (16UL)          /*!< Max size of EVENTS_READY[16] array.                                  */
  #define IPCT_EVENTS_READY_MaxIndex (15UL)          /*!< Max index of EVENTS_READY[16] array.                                 */
  #define IPCT_EVENTS_READY_MinIndex (0UL)           /*!< Min index of EVENTS_READY[16] array.                                 */
  #define IPCT_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY[16] register.                           */

/* EVENTS_READY @Bit 0 : Event received when hardware handshake of SEND task for IPCT source channel n is complete and a new
                         signal can be triggered on that channel. */

  #define IPCT_EVENTS_READY_EVENTS_READY_Pos (0UL)   /*!< Position of EVENTS_READY field.                                      */
  #define IPCT_EVENTS_READY_EVENTS_READY_Msk (0x1UL << IPCT_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY field.*/
  #define IPCT_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                          */
  #define IPCT_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                          */
  #define IPCT_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define IPCT_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                                */


/* IPCT_PUBLISH_RECEIVE: Publish configuration for event RECEIVE[n] */
  #define IPCT_PUBLISH_RECEIVE_MaxCount (16UL)       /*!< Max size of PUBLISH_RECEIVE[16] array.                               */
  #define IPCT_PUBLISH_RECEIVE_MaxIndex (15UL)       /*!< Max index of PUBLISH_RECEIVE[16] array.                              */
  #define IPCT_PUBLISH_RECEIVE_MinIndex (0UL)        /*!< Min index of PUBLISH_RECEIVE[16] array.                              */
  #define IPCT_PUBLISH_RECEIVE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RECEIVE[16] register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_RECEIVE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_RECEIVE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define IPCT_PUBLISH_RECEIVE_EN_Msk (0x1UL << IPCT_PUBLISH_RECEIVE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define IPCT_PUBLISH_RECEIVE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_RECEIVE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_RECEIVE_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define IPCT_PUBLISH_RECEIVE_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* IPCT_PUBLISH_READY: Publish configuration for event READY[n] */
  #define IPCT_PUBLISH_READY_MaxCount (16UL)         /*!< Max size of PUBLISH_READY[16] array.                                 */
  #define IPCT_PUBLISH_READY_MaxIndex (15UL)         /*!< Max index of PUBLISH_READY[16] array.                                */
  #define IPCT_PUBLISH_READY_MinIndex (0UL)          /*!< Min index of PUBLISH_READY[16] array.                                */
  #define IPCT_PUBLISH_READY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READY[16] register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event READY[n] will publish to */
  #define IPCT_PUBLISH_READY_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define IPCT_PUBLISH_READY_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define IPCT_PUBLISH_READY_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define IPCT_PUBLISH_READY_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_READY_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define IPCT_PUBLISH_READY_EN_Msk (0x1UL << IPCT_PUBLISH_READY_EN_Pos) /*!< Bit mask of EN field.                            */
  #define IPCT_PUBLISH_READY_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_READY_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define IPCT_PUBLISH_READY_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define IPCT_PUBLISH_READY_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* IPCT_SHORTS: Shortcuts between local events and tasks */
  #define IPCT_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* RECEIVE0_FLUSH0 @Bit 0 : Shortcut between event RECEIVE[0] and task FLUSH[0] */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Pos (0UL)      /*!< Position of RECEIVE0_FLUSH0 field.                                   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Msk (0x1UL << IPCT_SHORTS_RECEIVE0_FLUSH0_Pos) /*!< Bit mask of RECEIVE0_FLUSH0 field.   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Min (0x0UL)    /*!< Min enumerator value of RECEIVE0_FLUSH0 field.                       */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Max (0x1UL)    /*!< Max enumerator value of RECEIVE0_FLUSH0 field.                       */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Enabled (0x1UL) /*!< Enable shortcut                                                     */

