NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RECEIVE1_FLUSH1 @Bit 1 : Shortcut between event RECEIVE[1] and task FLUSH[1] */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Pos (1UL)      /*!< Position of RECEIVE1_FLUSH1 field.                                   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Msk (0x1UL << IPCT_SHORTS_RECEIVE1_FLUSH1_Pos) /*!< Bit mask of RECEIVE1_FLUSH1 field.   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Min (0x0UL)    /*!< Min enumerator value of RECEIVE1_FLUSH1 field.                       */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Max (0x1UL)    /*!< Max enumerator value of RECEIVE1_FLUSH1 field.                       */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE2_FLUSH2 @Bit 2 : Shortcut between event RECEIVE[2] and task FLUSH[2] */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Pos (2UL)      /*!< Position of RECEIVE2_FLUSH2 field.                                   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Msk (0x1UL << IPCT_SHORTS_RECEIVE2_FLUSH2_Pos) /*!< Bit mask of RECEIVE2_FLUSH2 field.   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Min (0x0UL)    /*!< Min enumerator value of RECEIVE2_FLUSH2 field.                       */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Max (0x1UL)    /*!< Max enumerator value of RECEIVE2_FLUSH2 field.                       */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE3_FLUSH3 @Bit 3 : Shortcut between event RECEIVE[3] and task FLUSH[3] */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Pos (3UL)      /*!< Position of RECEIVE3_FLUSH3 field.                                   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Msk (0x1UL << IPCT_SHORTS_RECEIVE3_FLUSH3_Pos) /*!< Bit mask of RECEIVE3_FLUSH3 field.   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Min (0x0UL)    /*!< Min enumerator value of RECEIVE3_FLUSH3 field.                       */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Max (0x1UL)    /*!< Max enumerator value of RECEIVE3_FLUSH3 field.                       */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE4_FLUSH4 @Bit 4 : Shortcut between event RECEIVE[4] and task FLUSH[4] */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Pos (4UL)      /*!< Position of RECEIVE4_FLUSH4 field.                                   */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Msk (0x1UL << IPCT_SHORTS_RECEIVE4_FLUSH4_Pos) /*!< Bit mask of RECEIVE4_FLUSH4 field.   */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Min (0x0UL)    /*!< Min enumerator value of RECEIVE4_FLUSH4 field.                       */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Max (0x1UL)    /*!< Max enumerator value of RECEIVE4_FLUSH4 field.                       */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE5_FLUSH5 @Bit 5 : Shortcut between event RECEIVE[5] and task FLUSH[5] */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Pos (5UL)      /*!< Position of RECEIVE5_FLUSH5 field.                                   */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Msk (0x1UL << IPCT_SHORTS_RECEIVE5_FLUSH5_Pos) /*!< Bit mask of RECEIVE5_FLUSH5 field.   */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Min (0x0UL)    /*!< Min enumerator value of RECEIVE5_FLUSH5 field.                       */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Max (0x1UL)    /*!< Max enumerator value of RECEIVE5_FLUSH5 field.                       */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE6_FLUSH6 @Bit 6 : Shortcut between event RECEIVE[6] and task FLUSH[6] */
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Pos (6UL)      /*!< Position of RECEIVE6_FLUSH6 field.                                   */
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Msk (0x1UL << IPCT_SHORTS_RECEIVE6_FLUSH6_Pos) /*!< Bit mask of RECEIVE6_FLUSH6 field.   */
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Min (0x0UL)    /*!< Min enumerator value of RECEIVE6_FLUSH6 field.                       */
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Max (0x1UL)    /*!< Max enumerator value of RECEIVE6_FLUSH6 field.                       */
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Enabled (0x1UL) /*!< Enable shortcut                                                     */

/* RECEIVE7_FLUSH7 @Bit 7 : Shortcut between event RECEIVE[7] and task FLUSH[7] */
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Pos (7UL)      /*!< Position of RECEIVE7_FLUSH7 field.                                   */
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Msk (0x1UL << IPCT_SHORTS_RECEIVE7_FLUSH7_Pos) /*!< Bit mask of RECEIVE7_FLUSH7 field.   */
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Min (0x0UL)    /*!< Min enumerator value of RECEIVE7_FLUSH7 field.                       */
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Max (0x1UL)    /*!< Max enumerator value of RECEIVE7_FLUSH7 field.                       */
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Enabled (0x1UL) /*!< Enable shortcut                                                     */

