NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* READY7 @Bit 23 : Enable or disable interrupt for event READY[7] */
  #define IPCT_INTEN0_READY7_Pos (23UL)              /*!< Position of READY7 field.                                            */
  #define IPCT_INTEN0_READY7_Msk (0x1UL << IPCT_INTEN0_READY7_Pos) /*!< Bit mask of READY7 field.                              */
  #define IPCT_INTEN0_READY7_Min (0x0UL)             /*!< Min enumerator value of READY7 field.                                */
  #define IPCT_INTEN0_READY7_Max (0x1UL)             /*!< Max enumerator value of READY7 field.                                */
  #define IPCT_INTEN0_READY7_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN0_READY7_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY8 @Bit 24 : Enable or disable interrupt for event READY[8] */
  #define IPCT_INTEN0_READY8_Pos (24UL)              /*!< Position of READY8 field.                                            */
  #define IPCT_INTEN0_READY8_Msk (0x1UL << IPCT_INTEN0_READY8_Pos) /*!< Bit mask of READY8 field.                              */
  #define IPCT_INTEN0_READY8_Min (0x0UL)             /*!< Min enumerator value of READY8 field.                                */
  #define IPCT_INTEN0_READY8_Max (0x1UL)             /*!< Max enumerator value of READY8 field.                                */
  #define IPCT_INTEN0_READY8_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN0_READY8_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY9 @Bit 25 : Enable or disable interrupt for event READY[9] */
  #define IPCT_INTEN0_READY9_Pos (25UL)              /*!< Position of READY9 field.                                            */
  #define IPCT_INTEN0_READY9_Msk (0x1UL << IPCT_INTEN0_READY9_Pos) /*!< Bit mask of READY9 field.                              */
  #define IPCT_INTEN0_READY9_Min (0x0UL)             /*!< Min enumerator value of READY9 field.                                */
  #define IPCT_INTEN0_READY9_Max (0x1UL)             /*!< Max enumerator value of READY9 field.                                */
  #define IPCT_INTEN0_READY9_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN0_READY9_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY10 @Bit 26 : Enable or disable interrupt for event READY[10] */
  #define IPCT_INTEN0_READY10_Pos (26UL)             /*!< Position of READY10 field.                                           */
  #define IPCT_INTEN0_READY10_Msk (0x1UL << IPCT_INTEN0_READY10_Pos) /*!< Bit mask of READY10 field.                           */
  #define IPCT_INTEN0_READY10_Min (0x0UL)            /*!< Min enumerator value of READY10 field.                               */
  #define IPCT_INTEN0_READY10_Max (0x1UL)            /*!< Max enumerator value of READY10 field.                               */
  #define IPCT_INTEN0_READY10_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN0_READY10_Enabled (0x1UL)        /*!< Enable                                                               */

/* READY11 @Bit 27 : Enable or disable interrupt for event READY[11] */
  #define IPCT_INTEN0_READY11_Pos (27UL)             /*!< Position of READY11 field.                                           */
  #define IPCT_INTEN0_READY11_Msk (0x1UL << IPCT_INTEN0_READY11_Pos) /*!< Bit mask of READY11 field.                           */
  #define IPCT_INTEN0_READY11_Min (0x0UL)            /*!< Min enumerator value of READY11 field.                               */
  #define IPCT_INTEN0_READY11_Max (0x1UL)            /*!< Max enumerator value of READY11 field.                               */
  #define IPCT_INTEN0_READY11_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN0_READY11_Enabled (0x1UL)        /*!< Enable                                                               */

/* READY12 @Bit 28 : Enable or disable interrupt for event READY[12] */
  #define IPCT_INTEN0_READY12_Pos (28UL)             /*!< Position of READY12 field.                                           */
  #define IPCT_INTEN0_READY12_Msk (0x1UL << IPCT_INTEN0_READY12_Pos) /*!< Bit mask of READY12 field.                           */
  #define IPCT_INTEN0_READY12_Min (0x0UL)            /*!< Min enumerator value of READY12 field.                               */
  #define IPCT_INTEN0_READY12_Max (0x1UL)            /*!< Max enumerator value of READY12 field.                               */
  #define IPCT_INTEN0_READY12_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN0_READY12_Enabled (0x1UL)        /*!< Enable                                                               */

/* READY13 @Bit 29 : Enable or disable interrupt for event READY[13] */
  #define IPCT_INTEN0_READY13_Pos (29UL)             /*!< Position of READY13 field.                                           */
  #define IPCT_INTEN0_READY13_Msk (0x1UL << IPCT_INTEN0_READY13_Pos) /*!< Bit mask of READY13 field.                           */
  #define IPCT_INTEN0_READY13_Min (0x0UL)            /*!< Min enumerator value of READY13 field.                               */
  #define IPCT_INTEN0_READY13_Max (0x1UL)            /*!< Max enumerator value of READY13 field.                               */
  #define IPCT_INTEN0_READY13_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN0_READY13_Enabled (0x1UL)        /*!< Enable                                                               */

/* READY14 @Bit 30 : Enable or disable interrupt for event READY[14] */
  #define IPCT_INTEN0_READY14_Pos (30UL)             /*!< Position of READY14 field.                                           */
  #define IPCT_INTEN0_READY14_Msk (0x1UL << IPCT_INTEN0_READY14_Pos) /*!< Bit mask of READY14 field.                           */
  #define IPCT_INTEN0_READY14_Min (0x0UL)            /*!< Min enumerator value of READY14 field.                               */
  #define IPCT_INTEN0_READY14_Max (0x1UL)            /*!< Max enumerator value of READY14 field.                               */
  #define IPCT_INTEN0_READY14_Disabled (0x0UL)       /*!< Disable                                                              */
  #define IPCT_INTEN0_READY14_Enabled (0x1UL)        /*!< Enable                                                               */

