NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RECEIVE14 @Bit 14 : Enable or disable interrupt for event RECEIVE[14] */
  #define IPCT_INTEN4_RECEIVE14_Pos (14UL)           /*!< Position of RECEIVE14 field.                                         */
  #define IPCT_INTEN4_RECEIVE14_Msk (0x1UL << IPCT_INTEN4_RECEIVE14_Pos) /*!< Bit mask of RECEIVE14 field.                     */
  #define IPCT_INTEN4_RECEIVE14_Min (0x0UL)          /*!< Min enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTEN4_RECEIVE14_Max (0x1UL)          /*!< Max enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTEN4_RECEIVE14_Disabled (0x0UL)     /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE14_Enabled (0x1UL)      /*!< Enable                                                               */

/* RECEIVE15 @Bit 15 : Enable or disable interrupt for event RECEIVE[15] */
  #define IPCT_INTEN4_RECEIVE15_Pos (15UL)           /*!< Position of RECEIVE15 field.                                         */
  #define IPCT_INTEN4_RECEIVE15_Msk (0x1UL << IPCT_INTEN4_RECEIVE15_Pos) /*!< Bit mask of RECEIVE15 field.                     */
  #define IPCT_INTEN4_RECEIVE15_Min (0x0UL)          /*!< Min enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTEN4_RECEIVE15_Max (0x1UL)          /*!< Max enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTEN4_RECEIVE15_Disabled (0x0UL)     /*!< Disable                                                              */
  #define IPCT_INTEN4_RECEIVE15_Enabled (0x1UL)      /*!< Enable                                                               */

/* READY0 @Bit 16 : Enable or disable interrupt for event READY[0] */
  #define IPCT_INTEN4_READY0_Pos (16UL)              /*!< Position of READY0 field.                                            */
  #define IPCT_INTEN4_READY0_Msk (0x1UL << IPCT_INTEN4_READY0_Pos) /*!< Bit mask of READY0 field.                              */
  #define IPCT_INTEN4_READY0_Min (0x0UL)             /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTEN4_READY0_Max (0x1UL)             /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTEN4_READY0_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN4_READY0_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY1 @Bit 17 : Enable or disable interrupt for event READY[1] */
  #define IPCT_INTEN4_READY1_Pos (17UL)              /*!< Position of READY1 field.                                            */
  #define IPCT_INTEN4_READY1_Msk (0x1UL << IPCT_INTEN4_READY1_Pos) /*!< Bit mask of READY1 field.                              */
  #define IPCT_INTEN4_READY1_Min (0x0UL)             /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTEN4_READY1_Max (0x1UL)             /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTEN4_READY1_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN4_READY1_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY2 @Bit 18 : Enable or disable interrupt for event READY[2] */
  #define IPCT_INTEN4_READY2_Pos (18UL)              /*!< Position of READY2 field.                                            */
  #define IPCT_INTEN4_READY2_Msk (0x1UL << IPCT_INTEN4_READY2_Pos) /*!< Bit mask of READY2 field.                              */
  #define IPCT_INTEN4_READY2_Min (0x0UL)             /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTEN4_READY2_Max (0x1UL)             /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTEN4_READY2_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN4_READY2_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY3 @Bit 19 : Enable or disable interrupt for event READY[3] */
  #define IPCT_INTEN4_READY3_Pos (19UL)              /*!< Position of READY3 field.                                            */
  #define IPCT_INTEN4_READY3_Msk (0x1UL << IPCT_INTEN4_READY3_Pos) /*!< Bit mask of READY3 field.                              */
  #define IPCT_INTEN4_READY3_Min (0x0UL)             /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTEN4_READY3_Max (0x1UL)             /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTEN4_READY3_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN4_READY3_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY4 @Bit 20 : Enable or disable interrupt for event READY[4] */
  #define IPCT_INTEN4_READY4_Pos (20UL)              /*!< Position of READY4 field.                                            */
  #define IPCT_INTEN4_READY4_Msk (0x1UL << IPCT_INTEN4_READY4_Pos) /*!< Bit mask of READY4 field.                              */
  #define IPCT_INTEN4_READY4_Min (0x0UL)             /*!< Min enumerator value of READY4 field.                                */
  #define IPCT_INTEN4_READY4_Max (0x1UL)             /*!< Max enumerator value of READY4 field.                                */
  #define IPCT_INTEN4_READY4_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN4_READY4_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY5 @Bit 21 : Enable or disable interrupt for event READY[5] */
  #define IPCT_INTEN4_READY5_Pos (21UL)              /*!< Position of READY5 field.                                            */
  #define IPCT_INTEN4_READY5_Msk (0x1UL << IPCT_INTEN4_READY5_Pos) /*!< Bit mask of READY5 field.                              */
  #define IPCT_INTEN4_READY5_Min (0x0UL)             /*!< Min enumerator value of READY5 field.                                */
  #define IPCT_INTEN4_READY5_Max (0x1UL)             /*!< Max enumerator value of READY5 field.                                */
  #define IPCT_INTEN4_READY5_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN4_READY5_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY6 @Bit 22 : Enable or disable interrupt for event READY[6] */
  #define IPCT_INTEN4_READY6_Pos (22UL)              /*!< Position of READY6 field.                                            */
  #define IPCT_INTEN4_READY6_Msk (0x1UL << IPCT_INTEN4_READY6_Pos) /*!< Bit mask of READY6 field.                              */
  #define IPCT_INTEN4_READY6_Min (0x0UL)             /*!< Min enumerator value of READY6 field.                                */
  #define IPCT_INTEN4_READY6_Max (0x1UL)             /*!< Max enumerator value of READY6 field.                                */
  #define IPCT_INTEN4_READY6_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN4_READY6_Enabled (0x1UL)         /*!< Enable                                                               */

