NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RECEIVE11 @Bit 11 : Write '1' to disable interrupt for event RECEIVE[11] */
  #define IPCT_INTENCLR5_RECEIVE11_Pos (11UL)        /*!< Position of RECEIVE11 field.                                         */
  #define IPCT_INTENCLR5_RECEIVE11_Msk (0x1UL << IPCT_INTENCLR5_RECEIVE11_Pos) /*!< Bit mask of RECEIVE11 field.               */
  #define IPCT_INTENCLR5_RECEIVE11_Min (0x0UL)       /*!< Min enumerator value of RECEIVE11 field.                             */
  #define IPCT_INTENCLR5_RECEIVE11_Max (0x1UL)       /*!< Max enumerator value of RECEIVE11 field.                             */
  #define IPCT_INTENCLR5_RECEIVE11_Clear (0x1UL)     /*!< Disable                                                              */
  #define IPCT_INTENCLR5_RECEIVE11_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR5_RECEIVE11_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE12 @Bit 12 : Write '1' to disable interrupt for event RECEIVE[12] */
  #define IPCT_INTENCLR5_RECEIVE12_Pos (12UL)        /*!< Position of RECEIVE12 field.                                         */
  #define IPCT_INTENCLR5_RECEIVE12_Msk (0x1UL << IPCT_INTENCLR5_RECEIVE12_Pos) /*!< Bit mask of RECEIVE12 field.               */
  #define IPCT_INTENCLR5_RECEIVE12_Min (0x0UL)       /*!< Min enumerator value of RECEIVE12 field.                             */
  #define IPCT_INTENCLR5_RECEIVE12_Max (0x1UL)       /*!< Max enumerator value of RECEIVE12 field.                             */
  #define IPCT_INTENCLR5_RECEIVE12_Clear (0x1UL)     /*!< Disable                                                              */
  #define IPCT_INTENCLR5_RECEIVE12_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR5_RECEIVE12_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE13 @Bit 13 : Write '1' to disable interrupt for event RECEIVE[13] */
  #define IPCT_INTENCLR5_RECEIVE13_Pos (13UL)        /*!< Position of RECEIVE13 field.                                         */
  #define IPCT_INTENCLR5_RECEIVE13_Msk (0x1UL << IPCT_INTENCLR5_RECEIVE13_Pos) /*!< Bit mask of RECEIVE13 field.               */
  #define IPCT_INTENCLR5_RECEIVE13_Min (0x0UL)       /*!< Min enumerator value of RECEIVE13 field.                             */
  #define IPCT_INTENCLR5_RECEIVE13_Max (0x1UL)       /*!< Max enumerator value of RECEIVE13 field.                             */
  #define IPCT_INTENCLR5_RECEIVE13_Clear (0x1UL)     /*!< Disable                                                              */
  #define IPCT_INTENCLR5_RECEIVE13_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR5_RECEIVE13_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE14 @Bit 14 : Write '1' to disable interrupt for event RECEIVE[14] */
  #define IPCT_INTENCLR5_RECEIVE14_Pos (14UL)        /*!< Position of RECEIVE14 field.                                         */
  #define IPCT_INTENCLR5_RECEIVE14_Msk (0x1UL << IPCT_INTENCLR5_RECEIVE14_Pos) /*!< Bit mask of RECEIVE14 field.               */
  #define IPCT_INTENCLR5_RECEIVE14_Min (0x0UL)       /*!< Min enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTENCLR5_RECEIVE14_Max (0x1UL)       /*!< Max enumerator value of RECEIVE14 field.                             */
  #define IPCT_INTENCLR5_RECEIVE14_Clear (0x1UL)     /*!< Disable                                                              */
  #define IPCT_INTENCLR5_RECEIVE14_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR5_RECEIVE14_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RECEIVE15 @Bit 15 : Write '1' to disable interrupt for event RECEIVE[15] */
  #define IPCT_INTENCLR5_RECEIVE15_Pos (15UL)        /*!< Position of RECEIVE15 field.                                         */
  #define IPCT_INTENCLR5_RECEIVE15_Msk (0x1UL << IPCT_INTENCLR5_RECEIVE15_Pos) /*!< Bit mask of RECEIVE15 field.               */
  #define IPCT_INTENCLR5_RECEIVE15_Min (0x0UL)       /*!< Min enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTENCLR5_RECEIVE15_Max (0x1UL)       /*!< Max enumerator value of RECEIVE15 field.                             */
  #define IPCT_INTENCLR5_RECEIVE15_Clear (0x1UL)     /*!< Disable                                                              */
  #define IPCT_INTENCLR5_RECEIVE15_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR5_RECEIVE15_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* READY0 @Bit 16 : Write '1' to disable interrupt for event READY[0] */
  #define IPCT_INTENCLR5_READY0_Pos (16UL)           /*!< Position of READY0 field.                                            */
  #define IPCT_INTENCLR5_READY0_Msk (0x1UL << IPCT_INTENCLR5_READY0_Pos) /*!< Bit mask of READY0 field.                        */
  #define IPCT_INTENCLR5_READY0_Min (0x0UL)          /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTENCLR5_READY0_Max (0x1UL)          /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTENCLR5_READY0_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR5_READY0_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR5_READY0_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY1 @Bit 17 : Write '1' to disable interrupt for event READY[1] */
  #define IPCT_INTENCLR5_READY1_Pos (17UL)           /*!< Position of READY1 field.                                            */
  #define IPCT_INTENCLR5_READY1_Msk (0x1UL << IPCT_INTENCLR5_READY1_Pos) /*!< Bit mask of READY1 field.                        */
  #define IPCT_INTENCLR5_READY1_Min (0x0UL)          /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTENCLR5_READY1_Max (0x1UL)          /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTENCLR5_READY1_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR5_READY1_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR5_READY1_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

