NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* D1 @Bit 29 : Dirty status of combined data unit 2 and 3. */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Pos (29UL)     /*!< Position of D1 field.                                                */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_D1_Pos) /*!< Bit mask of D1 field.                */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Min (0x0UL)    /*!< Min enumerator value of D1 field.                                    */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Max (0x1UL)    /*!< Max enumerator value of D1 field.                                    */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Clean (0x0UL)  /*!< Clean data unit                                                      */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Dirty (0x1UL)  /*!< Dirty data unit                                                      */

/* V @Bit 30 : Line valid bit. */
  #define L2CACHEINFO_SET_WAY_INFO_V_Pos (30UL)      /*!< Position of V field.                                                 */
  #define L2CACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_V_Pos) /*!< Bit mask of V field.                   */
  #define L2CACHEINFO_SET_WAY_INFO_V_Min (0x0UL)     /*!< Min enumerator value of V field.                                     */
  #define L2CACHEINFO_SET_WAY_INFO_V_Max (0x1UL)     /*!< Max enumerator value of V field.                                     */
  #define L2CACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL) /*!< Invalid cache line                                                   */
  #define L2CACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)   /*!< Valid cache line                                                     */

/* MRU @Bit 31 : Most recently used way. */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)    /*!< Position of MRU field.                                               */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_MRU_Pos) /*!< Bit mask of MRU field.             */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)   /*!< Min enumerator value of MRU field.                                   */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)   /*!< Max enumerator value of MRU field.                                   */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)  /*!< Way0 was most recently used                                          */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)  /*!< Way1 was most recently used                                          */



/* ================================================= Struct L2CACHEINFO_SET ================================================== */
/**
  * @brief SET [L2CACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_L2CACHEINFO_SET_WAY_Type WAY[2];         /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_L2CACHEINFO_SET_Type;                          /*!< Size = 8 (0x008)                                                     */
  #define L2CACHEINFO_SET_MaxCount (1024UL)          /*!< Size of SET[1024] array.                                             */
  #define L2CACHEINFO_SET_MaxIndex (1023UL)          /*!< Max index of SET[1024] array.                                        */
  #define L2CACHEINFO_SET_MinIndex (0UL)             /*!< Min index of SET[1024] array.                                        */

/* =================================================== Struct L2CACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {                                   /*!< L2CACHEINFO Structure                                                */
    __IOM NRF_L2CACHEINFO_SET_Type SET[1024];        /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_L2CACHEINFO_Type;                            /*!< Size = 8192 (0x2000)                                                 */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          LPCOMP                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct LPCOMP ====================================================== */
/**
  * @brief Low-power comparator
  */
  typedef struct {                                   /*!< LPCOMP Structure                                                     */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start comparator                                      */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop comparator                                       */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000008) Sample comparator value. This task requires that LPCOMP
                                                                         has been started by the START task.*/
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000088) Subscribe configuration for task SAMPLE               */
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) LPCOMP is ready and output is valid                   */
    __IOM uint32_t EVENTS_DOWN;                      /*!< (@ 0x00000104) Downward crossing                                     */
    __IOM uint32_t EVENTS_UP;                        /*!< (@ 0x00000108) Upward crossing                                       */
    __IOM uint32_t EVENTS_CROSS;                     /*!< (@ 0x0000010C) Downward or upward crossing                           */
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_DOWN;                     /*!< (@ 0x00000184) Publish configuration for event DOWN                  */
    __IOM uint32_t PUBLISH_UP;                       /*!< (@ 0x00000188) Publish configuration for event UP                    */
    __IOM uint32_t PUBLISH_CROSS;                    /*!< (@ 0x0000018C) Publish configuration for event CROSS                 */
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED5[60];
    __IM uint32_t RESULT;                            /*!< (@ 0x00000400) Compare result                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable LPCOMP                                         */
    __IOM uint32_t PSEL;                             /*!< (@ 0x00000504) Input pin select                                      */
    __IOM uint32_t REFSEL;                           /*!< (@ 0x00000508) Reference select                                      */
    __IOM uint32_t EXTREFSEL;                        /*!< (@ 0x0000050C) External reference select                             */
    __IM uint32_t RESERVED7[4];
    __IOM uint32_t ANADETECT;                        /*!< (@ 0x00000520) Analog detect configuration                           */
    __IM uint32_t RESERVED8[5];
    __IOM uint32_t HYST;                             /*!< (@ 0x00000538) Comparator hysteresis enable                          */
  } NRF_LPCOMP_Type;                                 /*!< Size = 1340 (0x53C)                                                  */

/* LPCOMP_TASKS_START: Start comparator */
  #define LPCOMP_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                               */

