NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PVAL @Bit 13 : Prepared Valid */
  #define MCAN_TEST_PVAL_Pos (13UL)                  /*!< Position of PVAL field.                                              */
  #define MCAN_TEST_PVAL_Msk (0x1UL << MCAN_TEST_PVAL_Pos) /*!< Bit mask of PVAL field.                                        */
  #define MCAN_TEST_PVAL_Min (0x0UL)                 /*!< Min enumerator value of PVAL field.                                  */
  #define MCAN_TEST_PVAL_Max (0x1UL)                 /*!< Max enumerator value of PVAL field.                                  */
  #define MCAN_TEST_PVAL_NotValid (0x0UL)            /*!< Value of TXBNP not valid                                             */
  #define MCAN_TEST_PVAL_Valid (0x1UL)               /*!< Value of TXBNP valid                                                 */

/* TXBNS @Bits 16..20 : Tx Buffer Number Started */
  #define MCAN_TEST_TXBNS_Pos (16UL)                 /*!< Position of TXBNS field.                                             */
  #define MCAN_TEST_TXBNS_Msk (0x1FUL << MCAN_TEST_TXBNS_Pos) /*!< Bit mask of TXBNS field.                                    */

/* SVAL @Bit 21 : Started Valid */
  #define MCAN_TEST_SVAL_Pos (21UL)                  /*!< Position of SVAL field.                                              */
  #define MCAN_TEST_SVAL_Msk (0x1UL << MCAN_TEST_SVAL_Pos) /*!< Bit mask of SVAL field.                                        */
  #define MCAN_TEST_SVAL_Min (0x0UL)                 /*!< Min enumerator value of SVAL field.                                  */
  #define MCAN_TEST_SVAL_Max (0x1UL)                 /*!< Max enumerator value of SVAL field.                                  */
  #define MCAN_TEST_SVAL_NotValid (0x0UL)            /*!< Value of TXBNP not valid                                             */
  #define MCAN_TEST_SVAL_Valid (0x1UL)               /*!< Value of TXBNP valid                                                 */


/* MCAN_RWD: RAM Watchdog */
  #define MCAN_RWD_ResetValue (0x00000000UL)         /*!< Reset value of RWD register.                                         */

/* WDC @Bits 0..7 : Start value of the Message RAM Watchdog Counter. With the reset value of '00' the counter is disabled. */
  #define MCAN_RWD_WDC_Pos (0UL)                     /*!< Position of WDC field.                                               */
  #define MCAN_RWD_WDC_Msk (0xFFUL << MCAN_RWD_WDC_Pos) /*!< Bit mask of WDC field.                                            */

/* WDV @Bits 8..15 : Actual Message RAM Watchdog Counter Value. */
  #define MCAN_RWD_WDV_Pos (8UL)                     /*!< Position of WDV field.                                               */
  #define MCAN_RWD_WDV_Msk (0xFFUL << MCAN_RWD_WDV_Pos) /*!< Bit mask of WDV field.                                            */


/* MCAN_CCCR: CC Control Register */
  #define MCAN_CCCR_ResetValue (0x00000000UL)        /*!< Reset value of CCCR register.                                        */

/* INIT @Bit 0 : Initialization */
  #define MCAN_CCCR_INIT_Pos (0UL)                   /*!< Position of INIT field.                                              */
  #define MCAN_CCCR_INIT_Msk (0x1UL << MCAN_CCCR_INIT_Pos) /*!< Bit mask of INIT field.                                        */
  #define MCAN_CCCR_INIT_Min (0x0UL)                 /*!< Min enumerator value of INIT field.                                  */
  #define MCAN_CCCR_INIT_Max (0x1UL)                 /*!< Max enumerator value of INIT field.                                  */
  #define MCAN_CCCR_INIT_Normal (0x0UL)              /*!< Normal Operation                                                     */
  #define MCAN_CCCR_INIT_Initialization (0x1UL)      /*!< Initialization is started                                            */

/* CCE @Bit 1 : Configuration Change Enable */
  #define MCAN_CCCR_CCE_Pos (1UL)                    /*!< Position of CCE field.                                               */
  #define MCAN_CCCR_CCE_Msk (0x1UL << MCAN_CCCR_CCE_Pos) /*!< Bit mask of CCE field.                                           */
  #define MCAN_CCCR_CCE_Min (0x0UL)                  /*!< Min enumerator value of CCE field.                                   */
  #define MCAN_CCCR_CCE_Max (0x1UL)                  /*!< Max enumerator value of CCE field.                                   */
  #define MCAN_CCCR_CCE_Disabled (0x0UL)             /*!< The CPU has no write access to the protected configuration registers */
  #define MCAN_CCCR_CCE_Enabled (0x1UL)              /*!< The CPU has write access to the protected configuration registers
                                                          (while CCCR.INIT = '1')*/

/* ASM @Bit 2 : Restricted Operation Mode */
  #define MCAN_CCCR_ASM_Pos (2UL)                    /*!< Position of ASM field.                                               */
  #define MCAN_CCCR_ASM_Msk (0x1UL << MCAN_CCCR_ASM_Pos) /*!< Bit mask of ASM field.                                           */
  #define MCAN_CCCR_ASM_Min (0x0UL)                  /*!< Min enumerator value of ASM field.                                   */
  #define MCAN_CCCR_ASM_Max (0x1UL)                  /*!< Max enumerator value of ASM field.                                   */
  #define MCAN_CCCR_ASM_Disabled (0x0UL)             /*!< Normal CAN operation                                                 */
  #define MCAN_CCCR_ASM_Enabled (0x1UL)              /*!< Restricted Operation Mode active                                     */

/* CSA @Bit 3 : Clock Stop Acknowledge */
  #define MCAN_CCCR_CSA_Pos (3UL)                    /*!< Position of CSA field.                                               */
  #define MCAN_CCCR_CSA_Msk (0x1UL << MCAN_CCCR_CSA_Pos) /*!< Bit mask of CSA field.                                           */
  #define MCAN_CCCR_CSA_Min (0x0UL)                  /*!< Min enumerator value of CSA field.                                   */
  #define MCAN_CCCR_CSA_Max (0x1UL)                  /*!< Max enumerator value of CSA field.                                   */
  #define MCAN_CCCR_CSA_Disabled (0x0UL)             /*!< No clock stop acknowledged                                           */
  #define MCAN_CCCR_CSA_Enabled (0x1UL)              /*!< MCAN may be set in power down by stopping m_can_hclk and m_can_cclk  */

/* CSR @Bit 4 : Clock Stop Request */
  #define MCAN_CCCR_CSR_Pos (4UL)                    /*!< Position of CSR field.                                               */
  #define MCAN_CCCR_CSR_Msk (0x1UL << MCAN_CCCR_CSR_Pos) /*!< Bit mask of CSR field.                                           */
  #define MCAN_CCCR_CSR_Min (0x0UL)                  /*!< Min enumerator value of CSR field.                                   */
  #define MCAN_CCCR_CSR_Max (0x1UL)                  /*!< Max enumerator value of CSR field.                                   */
  #define MCAN_CCCR_CSR_Disabled (0x0UL)             /*!< No clock stop is requested                                           */
  #define MCAN_CCCR_CSR_Enabled (0x1UL)              /*!< Clock stop requested.                                                */

/* MON @Bit 5 : Bus Monitoring Mode */
  #define MCAN_CCCR_MON_Pos (5UL)                    /*!< Position of MON field.                                               */
  #define MCAN_CCCR_MON_Msk (0x1UL << MCAN_CCCR_MON_Pos) /*!< Bit mask of MON field.                                           */
  #define MCAN_CCCR_MON_Min (0x0UL)                  /*!< Min enumerator value of MON field.                                   */
  #define MCAN_CCCR_MON_Max (0x1UL)                  /*!< Max enumerator value of MON field.                                   */
  #define MCAN_CCCR_MON_Disabled (0x0UL)             /*!< Bus Monitoring Mode is disabled                                      */
  #define MCAN_CCCR_MON_Enabled (0x1UL)              /*!< Bus Monitoring Mode is enabled                                       */

/* DAR @Bit 6 : Disable Automatic Retransmission */
  #define MCAN_CCCR_DAR_Pos (6UL)                    /*!< Position of DAR field.                                               */
  #define MCAN_CCCR_DAR_Msk (0x1UL << MCAN_CCCR_DAR_Pos) /*!< Bit mask of DAR field.                                           */
  #define MCAN_CCCR_DAR_Min (0x0UL)                  /*!< Min enumerator value of DAR field.                                   */
  #define MCAN_CCCR_DAR_Max (0x1UL)                  /*!< Max enumerator value of DAR field.                                   */
  #define MCAN_CCCR_DAR_Enabled (0x0UL)              /*!< Automatic retransmission of messages not transmitted successfully
                                                          enabled*/
  #define MCAN_CCCR_DAR_Disabled (0x1UL)             /*!< Automatic retransmission disabled                                    */

/* TEST @Bit 7 : Test Mode Enable */
  #define MCAN_CCCR_TEST_Pos (7UL)                   /*!< Position of TEST field.                                              */
  #define MCAN_CCCR_TEST_Msk (0x1UL << MCAN_CCCR_TEST_Pos) /*!< Bit mask of TEST field.                                        */
  #define MCAN_CCCR_TEST_Min (0x0UL)                 /*!< Min enumerator value of TEST field.                                  */
  #define MCAN_CCCR_TEST_Max (0x1UL)                 /*!< Max enumerator value of TEST field.                                  */
  #define MCAN_CCCR_TEST_Disabled (0x0UL)            /*!< Normal operation, register TEST holds reset values                   */
  #define MCAN_CCCR_TEST_Enabled (0x1UL)             /*!< Test Mode, write access to register TEST enabled                     */

/* FDOE @Bit 8 : FD Operation Enable */
  #define MCAN_CCCR_FDOE_Pos (8UL)                   /*!< Position of FDOE field.                                              */
  #define MCAN_CCCR_FDOE_Msk (0x1UL << MCAN_CCCR_FDOE_Pos) /*!< Bit mask of FDOE field.                                        */
  #define MCAN_CCCR_FDOE_Min (0x0UL)                 /*!< Min enumerator value of FDOE field.                                  */
  #define MCAN_CCCR_FDOE_Max (0x1UL)                 /*!< Max enumerator value of FDOE field.                                  */
  #define MCAN_CCCR_FDOE_Disabled (0x0UL)            /*!< FD operation disabled                                                */
  #define MCAN_CCCR_FDOE_Enabled (0x1UL)             /*!< FD operation enabled                                                 */

/* BRSE @Bit 9 : Bit Rate Switch Enable */
  #define MCAN_CCCR_BRSE_Pos (9UL)                   /*!< Position of BRSE field.                                              */
  #define MCAN_CCCR_BRSE_Msk (0x1UL << MCAN_CCCR_BRSE_Pos) /*!< Bit mask of BRSE field.                                        */
  #define MCAN_CCCR_BRSE_Min (0x0UL)                 /*!< Min enumerator value of BRSE field.                                  */
  #define MCAN_CCCR_BRSE_Max (0x1UL)                 /*!< Max enumerator value of BRSE field.                                  */
  #define MCAN_CCCR_BRSE_Disabled (0x0UL)            /*!< Bit rate switching for transmissions disabled                        */
  #define MCAN_CCCR_BRSE_Enabled (0x1UL)             /*!< Bit rate switching for transmissions enabled                         */

