NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RF1L @Bit 7 : Rx FIFO 1 Message Lost */
  #define MCAN_IR_RF1L_Pos (7UL)                     /*!< Position of RF1L field.                                              */
  #define MCAN_IR_RF1L_Msk (0x1UL << MCAN_IR_RF1L_Pos) /*!< Bit mask of RF1L field.                                            */
  #define MCAN_IR_RF1L_Min (0x0UL)                   /*!< Min enumerator value of RF1L field.                                  */
  #define MCAN_IR_RF1L_Max (0x1UL)                   /*!< Max enumerator value of RF1L field.                                  */
  #define MCAN_IR_RF1L_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_RF1L_NotGenerated (0x0UL)          /*!< No Rx FIFO 1 message lost                                            */
  #define MCAN_IR_RF1L_Generated (0x1UL)             /*!< Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of
                                                          size zero*/

/* HPM @Bit 8 : High Priority Message */
  #define MCAN_IR_HPM_Pos (8UL)                      /*!< Position of HPM field.                                               */
  #define MCAN_IR_HPM_Msk (0x1UL << MCAN_IR_HPM_Pos) /*!< Bit mask of HPM field.                                               */
  #define MCAN_IR_HPM_Min (0x0UL)                    /*!< Min enumerator value of HPM field.                                   */
  #define MCAN_IR_HPM_Max (0x1UL)                    /*!< Max enumerator value of HPM field.                                   */
  #define MCAN_IR_HPM_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_HPM_NotGenerated (0x0UL)           /*!< No high priority message received                                    */
  #define MCAN_IR_HPM_Generated (0x1UL)              /*!< High priority message received                                       */

/* TC @Bit 9 : Transmission Completed */
  #define MCAN_IR_TC_Pos (9UL)                       /*!< Position of TC field.                                                */
  #define MCAN_IR_TC_Msk (0x1UL << MCAN_IR_TC_Pos)   /*!< Bit mask of TC field.                                                */
  #define MCAN_IR_TC_Min (0x0UL)                     /*!< Min enumerator value of TC field.                                    */
  #define MCAN_IR_TC_Max (0x1UL)                     /*!< Max enumerator value of TC field.                                    */
  #define MCAN_IR_TC_Clear (0x1UL)                   /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TC_NotGenerated (0x0UL)            /*!< No transmission completed                                            */
  #define MCAN_IR_TC_Generated (0x1UL)               /*!< Transmission completed                                               */

/* TCF @Bit 10 : Transmission Cancellation Finished */
  #define MCAN_IR_TCF_Pos (10UL)                     /*!< Position of TCF field.                                               */
  #define MCAN_IR_TCF_Msk (0x1UL << MCAN_IR_TCF_Pos) /*!< Bit mask of TCF field.                                               */
  #define MCAN_IR_TCF_Min (0x0UL)                    /*!< Min enumerator value of TCF field.                                   */
  #define MCAN_IR_TCF_Max (0x1UL)                    /*!< Max enumerator value of TCF field.                                   */
  #define MCAN_IR_TCF_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TCF_NotGenerated (0x0UL)           /*!< No transmission cancellation finished                                */
  #define MCAN_IR_TCF_Generated (0x1UL)              /*!< Transmission cancellation finished                                   */

/* TFE @Bit 11 : Tx FIFO Empty */
  #define MCAN_IR_TFE_Pos (11UL)                     /*!< Position of TFE field.                                               */
  #define MCAN_IR_TFE_Msk (0x1UL << MCAN_IR_TFE_Pos) /*!< Bit mask of TFE field.                                               */
  #define MCAN_IR_TFE_Min (0x0UL)                    /*!< Min enumerator value of TFE field.                                   */
  #define MCAN_IR_TFE_Max (0x1UL)                    /*!< Max enumerator value of TFE field.                                   */
  #define MCAN_IR_TFE_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TFE_NotGenerated (0x0UL)           /*!< Tx FIFO non-empty                                                    */
  #define MCAN_IR_TFE_Generated (0x1UL)              /*!< Tx FIFO empty                                                        */

/* TEFN @Bit 12 : Tx Event FIFO New Entry */
  #define MCAN_IR_TEFN_Pos (12UL)                    /*!< Position of TEFN field.                                              */
  #define MCAN_IR_TEFN_Msk (0x1UL << MCAN_IR_TEFN_Pos) /*!< Bit mask of TEFN field.                                            */
  #define MCAN_IR_TEFN_Min (0x0UL)                   /*!< Min enumerator value of TEFN field.                                  */
  #define MCAN_IR_TEFN_Max (0x1UL)                   /*!< Max enumerator value of TEFN field.                                  */
  #define MCAN_IR_TEFN_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TEFN_NotGenerated (0x0UL)          /*!< Tx Event FIFO unchanged                                              */
  #define MCAN_IR_TEFN_Generated (0x1UL)             /*!< Tx Handler wrote Tx Event FIFO element                               */

/* TEFW @Bit 13 : Tx Event FIFO Watermark Reached */
  #define MCAN_IR_TEFW_Pos (13UL)                    /*!< Position of TEFW field.                                              */
  #define MCAN_IR_TEFW_Msk (0x1UL << MCAN_IR_TEFW_Pos) /*!< Bit mask of TEFW field.                                            */
  #define MCAN_IR_TEFW_Min (0x0UL)                   /*!< Min enumerator value of TEFW field.                                  */
  #define MCAN_IR_TEFW_Max (0x1UL)                   /*!< Max enumerator value of TEFW field.                                  */
  #define MCAN_IR_TEFW_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TEFW_NotGenerated (0x0UL)          /*!< Tx Event FIFO fill level below watermark                             */
  #define MCAN_IR_TEFW_Generated (0x1UL)             /*!< Tx Event FIFO fill level reached watermark                           */

/* TEFF @Bit 14 : Tx Event FIFO Full */
  #define MCAN_IR_TEFF_Pos (14UL)                    /*!< Position of TEFF field.                                              */
  #define MCAN_IR_TEFF_Msk (0x1UL << MCAN_IR_TEFF_Pos) /*!< Bit mask of TEFF field.                                            */
  #define MCAN_IR_TEFF_Min (0x0UL)                   /*!< Min enumerator value of TEFF field.                                  */
  #define MCAN_IR_TEFF_Max (0x1UL)                   /*!< Max enumerator value of TEFF field.                                  */
  #define MCAN_IR_TEFF_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TEFF_NotGenerated (0x0UL)          /*!< Tx Event FIFO not full                                               */
  #define MCAN_IR_TEFF_Generated (0x1UL)             /*!< Tx Event FIFO full                                                   */

/* TEFL @Bit 15 : Tx Event FIFO Element Lost */
  #define MCAN_IR_TEFL_Pos (15UL)                    /*!< Position of TEFL field.                                              */
  #define MCAN_IR_TEFL_Msk (0x1UL << MCAN_IR_TEFL_Pos) /*!< Bit mask of TEFL field.                                            */
  #define MCAN_IR_TEFL_Min (0x0UL)                   /*!< Min enumerator value of TEFL field.                                  */
  #define MCAN_IR_TEFL_Max (0x1UL)                   /*!< Max enumerator value of TEFL field.                                  */
  #define MCAN_IR_TEFL_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TEFL_NotGenerated (0x0UL)          /*!< No Tx Event FIFO element lost                                        */
  #define MCAN_IR_TEFL_Generated (0x1UL)             /*!< Tx Event FIFO element lost, also set after wr ite attempt to Tx Event
                                                          FIFO of siz e zero*/

/* TSW @Bit 16 : Timestamp Wraparound */
  #define MCAN_IR_TSW_Pos (16UL)                     /*!< Position of TSW field.                                               */
  #define MCAN_IR_TSW_Msk (0x1UL << MCAN_IR_TSW_Pos) /*!< Bit mask of TSW field.                                               */
  #define MCAN_IR_TSW_Min (0x0UL)                    /*!< Min enumerator value of TSW field.                                   */
  #define MCAN_IR_TSW_Max (0x1UL)                    /*!< Max enumerator value of TSW field.                                   */
  #define MCAN_IR_TSW_Clear (0x1UL)                  /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_TSW_NotGenerated (0x0UL)           /*!< No timestamp counter wrap-around                                     */
  #define MCAN_IR_TSW_Generated (0x1UL)              /*!< Timestamp counter wrapped around                                     */

/* MRAF @Bit 17 : Message RAM Access Failure */
  #define MCAN_IR_MRAF_Pos (17UL)                    /*!< Position of MRAF field.                                              */
  #define MCAN_IR_MRAF_Msk (0x1UL << MCAN_IR_MRAF_Pos) /*!< Bit mask of MRAF field.                                            */
  #define MCAN_IR_MRAF_Min (0x0UL)                   /*!< Min enumerator value of MRAF field.                                  */
  #define MCAN_IR_MRAF_Max (0x1UL)                   /*!< Max enumerator value of MRAF field.                                  */
  #define MCAN_IR_MRAF_Clear (0x1UL)                 /*!< Write '1' to clear interrupt flag                                    */
  #define MCAN_IR_MRAF_NotGenerated (0x0UL)          /*!< No Message RAM access failure occurred                               */
  #define MCAN_IR_MRAF_Generated (0x1UL)             /*!< Message RAM access failure occurred                                  */

