NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RF1WL @Bit 5 : Rx FIFO 1 Watermark Reached Interrupt Line */
  #define MCAN_ILS_RF1WL_Pos (5UL)                   /*!< Position of RF1WL field.                                             */
  #define MCAN_ILS_RF1WL_Msk (0x1UL << MCAN_ILS_RF1WL_Pos) /*!< Bit mask of RF1WL field.                                       */
  #define MCAN_ILS_RF1WL_Min (0x0UL)                 /*!< Min enumerator value of RF1WL field.                                 */
  #define MCAN_ILS_RF1WL_Max (0x1UL)                 /*!< Max enumerator value of RF1WL field.                                 */
  #define MCAN_ILS_RF1WL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_RF1WL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* RF1FL @Bit 6 : Rx FIFO 1 Full Interrupt Line */
  #define MCAN_ILS_RF1FL_Pos (6UL)                   /*!< Position of RF1FL field.                                             */
  #define MCAN_ILS_RF1FL_Msk (0x1UL << MCAN_ILS_RF1FL_Pos) /*!< Bit mask of RF1FL field.                                       */
  #define MCAN_ILS_RF1FL_Min (0x0UL)                 /*!< Min enumerator value of RF1FL field.                                 */
  #define MCAN_ILS_RF1FL_Max (0x1UL)                 /*!< Max enumerator value of RF1FL field.                                 */
  #define MCAN_ILS_RF1FL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_RF1FL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* RF1LL @Bit 7 : Rx FIFO 1 Message Lost Interrupt Line */
  #define MCAN_ILS_RF1LL_Pos (7UL)                   /*!< Position of RF1LL field.                                             */
  #define MCAN_ILS_RF1LL_Msk (0x1UL << MCAN_ILS_RF1LL_Pos) /*!< Bit mask of RF1LL field.                                       */
  #define MCAN_ILS_RF1LL_Min (0x0UL)                 /*!< Min enumerator value of RF1LL field.                                 */
  #define MCAN_ILS_RF1LL_Max (0x1UL)                 /*!< Max enumerator value of RF1LL field.                                 */
  #define MCAN_ILS_RF1LL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_RF1LL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* HPML @Bit 8 : High Priority Message Interrupt Line */
  #define MCAN_ILS_HPML_Pos (8UL)                    /*!< Position of HPML field.                                              */
  #define MCAN_ILS_HPML_Msk (0x1UL << MCAN_ILS_HPML_Pos) /*!< Bit mask of HPML field.                                          */
  #define MCAN_ILS_HPML_Min (0x0UL)                  /*!< Min enumerator value of HPML field.                                  */
  #define MCAN_ILS_HPML_Max (0x1UL)                  /*!< Max enumerator value of HPML field.                                  */
  #define MCAN_ILS_HPML_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_HPML_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* TCL @Bit 9 : Transmission Completed Interrupt Line */
  #define MCAN_ILS_TCL_Pos (9UL)                     /*!< Position of TCL field.                                               */
  #define MCAN_ILS_TCL_Msk (0x1UL << MCAN_ILS_TCL_Pos) /*!< Bit mask of TCL field.                                             */
  #define MCAN_ILS_TCL_Min (0x0UL)                   /*!< Min enumerator value of TCL field.                                   */
  #define MCAN_ILS_TCL_Max (0x1UL)                   /*!< Max enumerator value of TCL field.                                   */
  #define MCAN_ILS_TCL_Assigned0 (0x0UL)             /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TCL_Assigned1 (0x1UL)             /*!< Interrupt assigned to interrupt line CORE1.                          */

/* TCFL @Bit 10 : Transmission Cancellation Finished Interrupt Line */
  #define MCAN_ILS_TCFL_Pos (10UL)                   /*!< Position of TCFL field.                                              */
  #define MCAN_ILS_TCFL_Msk (0x1UL << MCAN_ILS_TCFL_Pos) /*!< Bit mask of TCFL field.                                          */
  #define MCAN_ILS_TCFL_Min (0x0UL)                  /*!< Min enumerator value of TCFL field.                                  */
  #define MCAN_ILS_TCFL_Max (0x1UL)                  /*!< Max enumerator value of TCFL field.                                  */
  #define MCAN_ILS_TCFL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TCFL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* TFEL @Bit 11 : Tx FIFO Empty Interrupt Line */
  #define MCAN_ILS_TFEL_Pos (11UL)                   /*!< Position of TFEL field.                                              */
  #define MCAN_ILS_TFEL_Msk (0x1UL << MCAN_ILS_TFEL_Pos) /*!< Bit mask of TFEL field.                                          */
  #define MCAN_ILS_TFEL_Min (0x0UL)                  /*!< Min enumerator value of TFEL field.                                  */
  #define MCAN_ILS_TFEL_Max (0x1UL)                  /*!< Max enumerator value of TFEL field.                                  */
  #define MCAN_ILS_TFEL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TFEL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* TEFNL @Bit 12 : Tx Event FIFO New Entry Interrupt Line */
  #define MCAN_ILS_TEFNL_Pos (12UL)                  /*!< Position of TEFNL field.                                             */
  #define MCAN_ILS_TEFNL_Msk (0x1UL << MCAN_ILS_TEFNL_Pos) /*!< Bit mask of TEFNL field.                                       */
  #define MCAN_ILS_TEFNL_Min (0x0UL)                 /*!< Min enumerator value of TEFNL field.                                 */
  #define MCAN_ILS_TEFNL_Max (0x1UL)                 /*!< Max enumerator value of TEFNL field.                                 */
  #define MCAN_ILS_TEFNL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TEFNL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* TEFWL @Bit 13 : Tx Event FIFO Watermark Reached Interrupt Line */
  #define MCAN_ILS_TEFWL_Pos (13UL)                  /*!< Position of TEFWL field.                                             */
  #define MCAN_ILS_TEFWL_Msk (0x1UL << MCAN_ILS_TEFWL_Pos) /*!< Bit mask of TEFWL field.                                       */
  #define MCAN_ILS_TEFWL_Min (0x0UL)                 /*!< Min enumerator value of TEFWL field.                                 */
  #define MCAN_ILS_TEFWL_Max (0x1UL)                 /*!< Max enumerator value of TEFWL field.                                 */
  #define MCAN_ILS_TEFWL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TEFWL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* TEFFL @Bit 14 : Tx Event FIFO Full Interrupt Line */
  #define MCAN_ILS_TEFFL_Pos (14UL)                  /*!< Position of TEFFL field.                                             */
  #define MCAN_ILS_TEFFL_Msk (0x1UL << MCAN_ILS_TEFFL_Pos) /*!< Bit mask of TEFFL field.                                       */
  #define MCAN_ILS_TEFFL_Min (0x0UL)                 /*!< Min enumerator value of TEFFL field.                                 */
  #define MCAN_ILS_TEFFL_Max (0x1UL)                 /*!< Max enumerator value of TEFFL field.                                 */
  #define MCAN_ILS_TEFFL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TEFFL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

