NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TEFLL @Bit 15 : Tx Event FIFO Event Lost Interrupt Line */
  #define MCAN_ILS_TEFLL_Pos (15UL)                  /*!< Position of TEFLL field.                                             */
  #define MCAN_ILS_TEFLL_Msk (0x1UL << MCAN_ILS_TEFLL_Pos) /*!< Bit mask of TEFLL field.                                       */
  #define MCAN_ILS_TEFLL_Min (0x0UL)                 /*!< Min enumerator value of TEFLL field.                                 */
  #define MCAN_ILS_TEFLL_Max (0x1UL)                 /*!< Max enumerator value of TEFLL field.                                 */
  #define MCAN_ILS_TEFLL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TEFLL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* TSWL @Bit 16 : Timestamp Wraparound Interrupt Line */
  #define MCAN_ILS_TSWL_Pos (16UL)                   /*!< Position of TSWL field.                                              */
  #define MCAN_ILS_TSWL_Msk (0x1UL << MCAN_ILS_TSWL_Pos) /*!< Bit mask of TSWL field.                                          */
  #define MCAN_ILS_TSWL_Min (0x0UL)                  /*!< Min enumerator value of TSWL field.                                  */
  #define MCAN_ILS_TSWL_Max (0x1UL)                  /*!< Max enumerator value of TSWL field.                                  */
  #define MCAN_ILS_TSWL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TSWL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* MRAFL @Bit 17 : Message RAM Access Failure Interrupt Line */
  #define MCAN_ILS_MRAFL_Pos (17UL)                  /*!< Position of MRAFL field.                                             */
  #define MCAN_ILS_MRAFL_Msk (0x1UL << MCAN_ILS_MRAFL_Pos) /*!< Bit mask of MRAFL field.                                       */
  #define MCAN_ILS_MRAFL_Min (0x0UL)                 /*!< Min enumerator value of MRAFL field.                                 */
  #define MCAN_ILS_MRAFL_Max (0x1UL)                 /*!< Max enumerator value of MRAFL field.                                 */
  #define MCAN_ILS_MRAFL_Assigned0 (0x0UL)           /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_MRAFL_Assigned1 (0x1UL)           /*!< Interrupt assigned to interrupt line CORE1.                          */

/* TOOL @Bit 18 : Timeout Occurred Interrupt Line */
  #define MCAN_ILS_TOOL_Pos (18UL)                   /*!< Position of TOOL field.                                              */
  #define MCAN_ILS_TOOL_Msk (0x1UL << MCAN_ILS_TOOL_Pos) /*!< Bit mask of TOOL field.                                          */
  #define MCAN_ILS_TOOL_Min (0x0UL)                  /*!< Min enumerator value of TOOL field.                                  */
  #define MCAN_ILS_TOOL_Max (0x1UL)                  /*!< Max enumerator value of TOOL field.                                  */
  #define MCAN_ILS_TOOL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_TOOL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* DRXL @Bit 19 : Message stored to Dedicated Rx Buffer Interrupt Line */
  #define MCAN_ILS_DRXL_Pos (19UL)                   /*!< Position of DRXL field.                                              */
  #define MCAN_ILS_DRXL_Msk (0x1UL << MCAN_ILS_DRXL_Pos) /*!< Bit mask of DRXL field.                                          */
  #define MCAN_ILS_DRXL_Min (0x0UL)                  /*!< Min enumerator value of DRXL field.                                  */
  #define MCAN_ILS_DRXL_Max (0x1UL)                  /*!< Max enumerator value of DRXL field.                                  */
  #define MCAN_ILS_DRXL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_DRXL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* BEUL @Bit 21 : Bus Error Uncorrected Interrupt Line */
  #define MCAN_ILS_BEUL_Pos (21UL)                   /*!< Position of BEUL field.                                              */
  #define MCAN_ILS_BEUL_Msk (0x1UL << MCAN_ILS_BEUL_Pos) /*!< Bit mask of BEUL field.                                          */
  #define MCAN_ILS_BEUL_Min (0x0UL)                  /*!< Min enumerator value of BEUL field.                                  */
  #define MCAN_ILS_BEUL_Max (0x1UL)                  /*!< Max enumerator value of BEUL field.                                  */
  #define MCAN_ILS_BEUL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_BEUL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* ELOL @Bit 22 : Error Logging Overflow Interrupt Line */
  #define MCAN_ILS_ELOL_Pos (22UL)                   /*!< Position of ELOL field.                                              */
  #define MCAN_ILS_ELOL_Msk (0x1UL << MCAN_ILS_ELOL_Pos) /*!< Bit mask of ELOL field.                                          */
  #define MCAN_ILS_ELOL_Min (0x0UL)                  /*!< Min enumerator value of ELOL field.                                  */
  #define MCAN_ILS_ELOL_Max (0x1UL)                  /*!< Max enumerator value of ELOL field.                                  */
  #define MCAN_ILS_ELOL_Assigned0 (0x0UL)            /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_ELOL_Assigned1 (0x1UL)            /*!< Interrupt assigned to interrupt line CORE1.                          */

/* EPL @Bit 23 : Error Passive Interrupt Line */
  #define MCAN_ILS_EPL_Pos (23UL)                    /*!< Position of EPL field.                                               */
  #define MCAN_ILS_EPL_Msk (0x1UL << MCAN_ILS_EPL_Pos) /*!< Bit mask of EPL field.                                             */
  #define MCAN_ILS_EPL_Min (0x0UL)                   /*!< Min enumerator value of EPL field.                                   */
  #define MCAN_ILS_EPL_Max (0x1UL)                   /*!< Max enumerator value of EPL field.                                   */
  #define MCAN_ILS_EPL_Assigned0 (0x0UL)             /*!< Interrupt assigned to interrupt line CORE0.                          */
  #define MCAN_ILS_EPL_Assigned1 (0x1UL)             /*!< Interrupt assigned to interrupt line CORE1.                          */

