NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ANFE @Bits 2..3 : Accept Non-matching Frames Extended */
  #define MCAN_GFC_ANFE_Pos (2UL)                    /*!< Position of ANFE field.                                              */
  #define MCAN_GFC_ANFE_Msk (0x3UL << MCAN_GFC_ANFE_Pos) /*!< Bit mask of ANFE field.                                          */
  #define MCAN_GFC_ANFE_Min (0x0UL)                  /*!< Min enumerator value of ANFE field.                                  */
  #define MCAN_GFC_ANFE_Max (0x3UL)                  /*!< Max enumerator value of ANFE field.                                  */
  #define MCAN_GFC_ANFE_Accept0 (0x0UL)              /*!< Accept in Rx FIFO 0.                                                 */
  #define MCAN_GFC_ANFE_Accept1 (0x1UL)              /*!< Accept in Rx FIFO 1.                                                 */
  #define MCAN_GFC_ANFE_Reject0 (0x2UL)              /*!< Reject in both Rx FIFOs.                                             */
  #define MCAN_GFC_ANFE_Reject1 (0x3UL)              /*!< Reject in both Rx FIFOs.                                             */

/* ANFS @Bits 4..5 : (unspecified) */
  #define MCAN_GFC_ANFS_Pos (4UL)                    /*!< Position of ANFS field.                                              */
  #define MCAN_GFC_ANFS_Msk (0x3UL << MCAN_GFC_ANFS_Pos) /*!< Bit mask of ANFS field.                                          */
  #define MCAN_GFC_ANFS_Min (0x0UL)                  /*!< Min enumerator value of ANFS field.                                  */
  #define MCAN_GFC_ANFS_Max (0x3UL)                  /*!< Max enumerator value of ANFS field.                                  */
  #define MCAN_GFC_ANFS_Accept0 (0x0UL)              /*!< Accept in Rx FIFO 0.                                                 */
  #define MCAN_GFC_ANFS_Accept1 (0x1UL)              /*!< Accept in Rx FIFO 1.                                                 */
  #define MCAN_GFC_ANFS_Reject0 (0x2UL)              /*!< Reject in both Rx FIFOs.                                             */
  #define MCAN_GFC_ANFS_Reject1 (0x3UL)              /*!< Reject in both Rx FIFOs.                                             */


/* MCAN_SIDFC: Standard ID Filter Configuration */
  #define MCAN_SIDFC_ResetValue (0x00000000UL)       /*!< Reset value of SIDFC register.                                       */

/* FLSSA @Bits 2..15 : Filter List Standard Start Address */
  #define MCAN_SIDFC_FLSSA_Pos (2UL)                 /*!< Position of FLSSA field.                                             */
  #define MCAN_SIDFC_FLSSA_Msk (0x3FFFUL << MCAN_SIDFC_FLSSA_Pos) /*!< Bit mask of FLSSA field.                                */

/* LSS @Bits 16..23 : List Size Standard */
  #define MCAN_SIDFC_LSS_Pos (16UL)                  /*!< Position of LSS field.                                               */
  #define MCAN_SIDFC_LSS_Msk (0xFFUL << MCAN_SIDFC_LSS_Pos) /*!< Bit mask of LSS field.                                        */


/* MCAN_XIDFC: Extended ID Filter Configuration */
  #define MCAN_XIDFC_ResetValue (0x00000000UL)       /*!< Reset value of XIDFC register.                                       */

/* FLESA @Bits 2..15 : Filter List Extended Start Address */
  #define MCAN_XIDFC_FLESA_Pos (2UL)                 /*!< Position of FLESA field.                                             */
  #define MCAN_XIDFC_FLESA_Msk (0x3FFFUL << MCAN_XIDFC_FLESA_Pos) /*!< Bit mask of FLESA field.                                */

/* LSE @Bits 16..22 : List Size Extended */
  #define MCAN_XIDFC_LSE_Pos (16UL)                  /*!< Position of LSE field.                                               */
  #define MCAN_XIDFC_LSE_Msk (0x7FUL << MCAN_XIDFC_LSE_Pos) /*!< Bit mask of LSE field.                                        */


/* MCAN_XIDAM: Extended ID AND Mask */
  #define MCAN_XIDAM_ResetValue (0x00000000UL)       /*!< Reset value of XIDAM register.                                       */

/* EIDM @Bits 0..28 : Extended ID Mask */
  #define MCAN_XIDAM_EIDM_Pos (0UL)                  /*!< Position of EIDM field.                                              */
  #define MCAN_XIDAM_EIDM_Msk (0x1FFFFFFFUL << MCAN_XIDAM_EIDM_Pos) /*!< Bit mask of EIDM field.                               */


/* MCAN_HPMS: High Priority Message Status */
  #define MCAN_HPMS_ResetValue (0x00000000UL)        /*!< Reset value of HPMS register.                                        */

/* BIDX @Bits 0..5 : Buffer Index */
  #define MCAN_HPMS_BIDX_Pos (0UL)                   /*!< Position of BIDX field.                                              */
  #define MCAN_HPMS_BIDX_Msk (0x3FUL << MCAN_HPMS_BIDX_Pos) /*!< Bit mask of BIDX field.                                       */

/* MSI @Bits 6..7 : Message Storage Indicator */
  #define MCAN_HPMS_MSI_Pos (6UL)                    /*!< Position of MSI field.                                               */
  #define MCAN_HPMS_MSI_Msk (0x3UL << MCAN_HPMS_MSI_Pos) /*!< Bit mask of MSI field.                                           */
  #define MCAN_HPMS_MSI_Min (0x0UL)                  /*!< Min enumerator value of MSI field.                                   */
  #define MCAN_HPMS_MSI_Max (0x3UL)                  /*!< Max enumerator value of MSI field.                                   */
  #define MCAN_HPMS_MSI_NotSelected (0x0UL)          /*!< No FIFO selected.                                                    */
  #define MCAN_HPMS_MSI_Lost (0x1UL)                 /*!< FIFO message lost.                                                   */
  #define MCAN_HPMS_MSI_Stored0 (0x2UL)              /*!< Message stored in FIFO 0.                                            */
  #define MCAN_HPMS_MSI_Stored1 (0x3UL)              /*!< Message stored in FIFO 1.                                            */

/* FIDX @Bits 8..14 : Filter Index */
  #define MCAN_HPMS_FIDX_Pos (8UL)                   /*!< Position of FIDX field.                                              */
  #define MCAN_HPMS_FIDX_Msk (0x7FUL << MCAN_HPMS_FIDX_Pos) /*!< Bit mask of FIDX field.                                       */

