NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* FLST @Bit 15 : Filter List */
  #define MCAN_HPMS_FLST_Pos (15UL)                  /*!< Position of FLST field.                                              */
  #define MCAN_HPMS_FLST_Msk (0x1UL << MCAN_HPMS_FLST_Pos) /*!< Bit mask of FLST field.                                        */
  #define MCAN_HPMS_FLST_Min (0x0UL)                 /*!< Min enumerator value of FLST field.                                  */
  #define MCAN_HPMS_FLST_Max (0x1UL)                 /*!< Max enumerator value of FLST field.                                  */
  #define MCAN_HPMS_FLST_Standard (0x0UL)            /*!< Standard Filter List.                                                */
  #define MCAN_HPMS_FLST_Extended (0x1UL)            /*!< Extended Filter List.                                                */


/* MCAN_NDAT1: New Data 1 */
  #define MCAN_NDAT1_ResetValue (0x00000000UL)       /*!< Reset value of NDAT1 register.                                       */

/* ND @Bits 0..31 : New Data */
  #define MCAN_NDAT1_ND_Pos (0UL)                    /*!< Position of ND field.                                                */
  #define MCAN_NDAT1_ND_Msk (0xFFFFFFFFUL << MCAN_NDAT1_ND_Pos) /*!< Bit mask of ND field.                                     */
  #define MCAN_NDAT1_ND_Min (0x0UL)                  /*!< Min enumerator value of ND field.                                    */
  #define MCAN_NDAT1_ND_Max (0x1UL)                  /*!< Max enumerator value of ND field.                                    */
  #define MCAN_NDAT1_ND_NotUpdated (0x00000000UL)    /*!< Rx Buffer not updated.                                               */
  #define MCAN_NDAT1_ND_Updated (0x00000001UL)       /*!< Rx Buffer updated from new message.                                  */


/* MCAN_NDAT2: New Data 2 */
  #define MCAN_NDAT2_ResetValue (0x00000000UL)       /*!< Reset value of NDAT2 register.                                       */

/* ND @Bits 0..31 : New Data */
  #define MCAN_NDAT2_ND_Pos (0UL)                    /*!< Position of ND field.                                                */
  #define MCAN_NDAT2_ND_Msk (0xFFFFFFFFUL << MCAN_NDAT2_ND_Pos) /*!< Bit mask of ND field.                                     */
  #define MCAN_NDAT2_ND_Min (0x0UL)                  /*!< Min enumerator value of ND field.                                    */
  #define MCAN_NDAT2_ND_Max (0x1UL)                  /*!< Max enumerator value of ND field.                                    */
  #define MCAN_NDAT2_ND_NotUpdated (0x00000000UL)    /*!< Rx Buffer not updated.                                               */
  #define MCAN_NDAT2_ND_Updated (0x00000001UL)       /*!< Rx Buffer updated from new message.                                  */


/* MCAN_RXF0C: Rx FIFO 0 Configuration */
  #define MCAN_RXF0C_ResetValue (0x00000000UL)       /*!< Reset value of RXF0C register.                                       */

/* F0SA @Bits 2..15 : Rx FIFO 0 Start Address */
  #define MCAN_RXF0C_F0SA_Pos (2UL)                  /*!< Position of F0SA field.                                              */
  #define MCAN_RXF0C_F0SA_Msk (0x3FFFUL << MCAN_RXF0C_F0SA_Pos) /*!< Bit mask of F0SA field.                                   */

/* F0S @Bits 16..22 : Rx FIFO 0 Size */
  #define MCAN_RXF0C_F0S_Pos (16UL)                  /*!< Position of F0S field.                                               */
  #define MCAN_RXF0C_F0S_Msk (0x7FUL << MCAN_RXF0C_F0S_Pos) /*!< Bit mask of F0S field.                                        */

/* F0WM @Bits 24..30 : Rx FIFO 0 Watermark */
  #define MCAN_RXF0C_F0WM_Pos (24UL)                 /*!< Position of F0WM field.                                              */
  #define MCAN_RXF0C_F0WM_Msk (0x7FUL << MCAN_RXF0C_F0WM_Pos) /*!< Bit mask of F0WM field.                                     */

/* F0OM @Bit 31 : FIFO 0 Operation Mode */
  #define MCAN_RXF0C_F0OM_Pos (31UL)                 /*!< Position of F0OM field.                                              */
  #define MCAN_RXF0C_F0OM_Msk (0x1UL << MCAN_RXF0C_F0OM_Pos) /*!< Bit mask of F0OM field.                                      */
  #define MCAN_RXF0C_F0OM_Min (0x0UL)                /*!< Min enumerator value of F0OM field.                                  */
  #define MCAN_RXF0C_F0OM_Max (0x1UL)                /*!< Max enumerator value of F0OM field.                                  */
  #define MCAN_RXF0C_F0OM_Blocking (0x0UL)           /*!< FIFO 0 blocking mode.                                                */
  #define MCAN_RXF0C_F0OM_Overwrite (0x1UL)          /*!< FIFO 0 overwrite mode.                                               */


/* MCAN_RXF0S: Rx FIFO 0 Status */
  #define MCAN_RXF0S_ResetValue (0x00000000UL)       /*!< Reset value of RXF0S register.                                       */

/* F0FL @Bits 0..6 : Rx FIFO 0 Fill Leve */
  #define MCAN_RXF0S_F0FL_Pos (0UL)                  /*!< Position of F0FL field.                                              */
  #define MCAN_RXF0S_F0FL_Msk (0x7FUL << MCAN_RXF0S_F0FL_Pos) /*!< Bit mask of F0FL field.                                     */

/* F0GI @Bits 8..13 : Rx FIFO 0 Get Index */
  #define MCAN_RXF0S_F0GI_Pos (8UL)                  /*!< Position of F0GI field.                                              */
  #define MCAN_RXF0S_F0GI_Msk (0x3FUL << MCAN_RXF0S_F0GI_Pos) /*!< Bit mask of F0GI field.                                     */

/* F0PI @Bits 16..21 : Rx FIFO 0 Put Index */
  #define MCAN_RXF0S_F0PI_Pos (16UL)                 /*!< Position of F0PI field.                                              */
  #define MCAN_RXF0S_F0PI_Msk (0x3FUL << MCAN_RXF0S_F0PI_Pos) /*!< Bit mask of F0PI field.                                     */

/* F0F @Bit 24 : Rx FIFO 0 Full */
  #define MCAN_RXF0S_F0F_Pos (24UL)                  /*!< Position of F0F field.                                               */
  #define MCAN_RXF0S_F0F_Msk (0x1UL << MCAN_RXF0S_F0F_Pos) /*!< Bit mask of F0F field.                                         */
  #define MCAN_RXF0S_F0F_Min (0x0UL)                 /*!< Min enumerator value of F0F field.                                   */
  #define MCAN_RXF0S_F0F_Max (0x1UL)                 /*!< Max enumerator value of F0F field.                                   */
  #define MCAN_RXF0S_F0F_NotFull (0x0UL)             /*!< Rx FIFO 0 not full.                                                  */
  #define MCAN_RXF0S_F0F_Full (0x1UL)                /*!< Rx FIFO 0 full.                                                      */

/* RF0L @Bit 25 : Rx FIFO 0 Message Lost */
  #define MCAN_RXF0S_RF0L_Pos (25UL)                 /*!< Position of RF0L field.                                              */
  #define MCAN_RXF0S_RF0L_Msk (0x1UL << MCAN_RXF0S_RF0L_Pos) /*!< Bit mask of RF0L field.                                      */
  #define MCAN_RXF0S_RF0L_Min (0x0UL)                /*!< Min enumerator value of RF0L field.                                  */
  #define MCAN_RXF0S_RF0L_Max (0x1UL)                /*!< Max enumerator value of RF0L field.                                  */
  #define MCAN_RXF0S_RF0L_NotLost (0x0UL)            /*!< No Rx FIFO 0 message lost.                                           */
  #define MCAN_RXF0S_RF0L_Lost (0x1UL)               /*!< Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of
                                                          size zero.*/


/* MCAN_RXF0A: Rx FIFO 0 Acknowledge */
  #define MCAN_RXF0A_ResetValue (0x00000000UL)       /*!< Reset value of RXF0A register.                                       */

/* F0AI @Bits 0..5 : Rx FIFO 0 Acknowledge Index */
  #define MCAN_RXF0A_F0AI_Pos (0UL)                  /*!< Position of F0AI field.                                              */
  #define MCAN_RXF0A_F0AI_Msk (0x3FUL << MCAN_RXF0A_F0AI_Pos) /*!< Bit mask of F0AI field.                                     */


