NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TFQF @Bit 21 : Tx FIFO/Queue Full */
  #define MCAN_TXFQS_TFQF_Pos (21UL)                 /*!< Position of TFQF field.                                              */
  #define MCAN_TXFQS_TFQF_Msk (0x1UL << MCAN_TXFQS_TFQF_Pos) /*!< Bit mask of TFQF field.                                      */
  #define MCAN_TXFQS_TFQF_Min (0x0UL)                /*!< Min enumerator value of TFQF field.                                  */
  #define MCAN_TXFQS_TFQF_Max (0x1UL)                /*!< Max enumerator value of TFQF field.                                  */
  #define MCAN_TXFQS_TFQF_NotFull (0x0UL)            /*!< Tx FIFO/Queue not full                                               */
  #define MCAN_TXFQS_TFQF_Full (0x1UL)               /*!< Tx FIFO/Queue full                                                   */


/* MCAN_TXESC: Tx Buffer Element Size Configuration */
  #define MCAN_TXESC_ResetValue (0x00000000UL)       /*!< Reset value of TXESC register.                                       */

/* TBDS @Bits 0..2 : Tx Buffer Data Field Size */
  #define MCAN_TXESC_TBDS_Pos (0UL)                  /*!< Position of TBDS field.                                              */
  #define MCAN_TXESC_TBDS_Msk (0x7UL << MCAN_TXESC_TBDS_Pos) /*!< Bit mask of TBDS field.                                      */
  #define MCAN_TXESC_TBDS_Min (0x0UL)                /*!< Min enumerator value of TBDS field.                                  */
  #define MCAN_TXESC_TBDS_Max (0x7UL)                /*!< Max enumerator value of TBDS field.                                  */
  #define MCAN_TXESC_TBDS_DataField8B (0x0UL)        /*!< 8 byte data field                                                    */
  #define MCAN_TXESC_TBDS_DataField12B (0x1UL)       /*!< 12 byte data field                                                   */
  #define MCAN_TXESC_TBDS_DataField16B (0x2UL)       /*!< 16 byte data field                                                   */
  #define MCAN_TXESC_TBDS_DataField20B (0x3UL)       /*!< 20 byte data field                                                   */
  #define MCAN_TXESC_TBDS_DataField24B (0x4UL)       /*!< 24 byte data field                                                   */
  #define MCAN_TXESC_TBDS_DataField32B (0x5UL)       /*!< 32 byte data field                                                   */
  #define MCAN_TXESC_TBDS_DataField48B (0x6UL)       /*!< 48 byte data field                                                   */
  #define MCAN_TXESC_TBDS_DataField64B (0x7UL)       /*!< 64 byte data field                                                   */


/* MCAN_TXBRP: Tx Buffer Request Pending */
  #define MCAN_TXBRP_ResetValue (0x00000000UL)       /*!< Reset value of TXBRP register.                                       */

/* TRP @Bits 0..31 : Transmission Request Pending */
  #define MCAN_TXBRP_TRP_Pos (0UL)                   /*!< Position of TRP field.                                               */
  #define MCAN_TXBRP_TRP_Msk (0xFFFFFFFFUL << MCAN_TXBRP_TRP_Pos) /*!< Bit mask of TRP field.                                  */
  #define MCAN_TXBRP_TRP_Min (0x0UL)                 /*!< Min enumerator value of TRP field.                                   */
  #define MCAN_TXBRP_TRP_Max (0x1UL)                 /*!< Max enumerator value of TRP field.                                   */
  #define MCAN_TXBRP_TRP_NoRequest (0x00000000UL)    /*!< No transmission request pending                                      */
  #define MCAN_TXBRP_TRP_Request (0x00000001UL)      /*!< Transmission request pending                                         */


/* MCAN_TXBAR: Tx Buffer Add Request */
  #define MCAN_TXBAR_ResetValue (0x00000000UL)       /*!< Reset value of TXBAR register.                                       */

/* AR @Bits 0..31 : Add Request */
  #define MCAN_TXBAR_AR_Pos (0UL)                    /*!< Position of AR field.                                                */
  #define MCAN_TXBAR_AR_Msk (0xFFFFFFFFUL << MCAN_TXBAR_AR_Pos) /*!< Bit mask of AR field.                                     */
  #define MCAN_TXBAR_AR_Min (0x0UL)                  /*!< Min enumerator value of AR field.                                    */
  #define MCAN_TXBAR_AR_Max (0x1UL)                  /*!< Max enumerator value of AR field.                                    */
  #define MCAN_TXBAR_AR_NoRequest (0x00000000UL)     /*!< No transmission request added                                        */
  #define MCAN_TXBAR_AR_Request (0x00000001UL)       /*!< Transmission requested added                                         */


/* MCAN_TXBCR: Tx Buffer Cancellation Request */
  #define MCAN_TXBCR_ResetValue (0x00000000UL)       /*!< Reset value of TXBCR register.                                       */

/* CR @Bits 0..31 : Cancellation Request */
  #define MCAN_TXBCR_CR_Pos (0UL)                    /*!< Position of CR field.                                                */
  #define MCAN_TXBCR_CR_Msk (0xFFFFFFFFUL << MCAN_TXBCR_CR_Pos) /*!< Bit mask of CR field.                                     */
  #define MCAN_TXBCR_CR_Min (0x0UL)                  /*!< Min enumerator value of CR field.                                    */
  #define MCAN_TXBCR_CR_Max (0x1UL)                  /*!< Max enumerator value of CR field.                                    */
  #define MCAN_TXBCR_CR_NoCancellation (0x00000000UL) /*!< No cancellation pending                                             */
  #define MCAN_TXBCR_CR_Cancellation (0x00000001UL)  /*!< Cancellation pending                                                 */


/* MCAN_TXBTO: Tx Buffer Transmission Occurred */
  #define MCAN_TXBTO_ResetValue (0x00000000UL)       /*!< Reset value of TXBTO register.                                       */

/* TO @Bits 0..31 : Transmission Occurred */
  #define MCAN_TXBTO_TO_Pos (0UL)                    /*!< Position of TO field.                                                */
  #define MCAN_TXBTO_TO_Msk (0xFFFFFFFFUL << MCAN_TXBTO_TO_Pos) /*!< Bit mask of TO field.                                     */
  #define MCAN_TXBTO_TO_Min (0x0UL)                  /*!< Min enumerator value of TO field.                                    */
  #define MCAN_TXBTO_TO_Max (0x1UL)                  /*!< Max enumerator value of TO field.                                    */
  #define MCAN_TXBTO_TO_NoTransmittion (0x00000000UL) /*!< No transmission occurred                                            */
  #define MCAN_TXBTO_TO_Transmittion (0x00000001UL)  /*!< Transmission occurred                                                */


/* MCAN_TXBCF: Tx Buffer Cancellation Finished */
  #define MCAN_TXBCF_ResetValue (0x00000000UL)       /*!< Reset value of TXBCF register.                                       */

/* CF @Bits 0..31 : Cancellation Finished */
  #define MCAN_TXBCF_CF_Pos (0UL)                    /*!< Position of CF field.                                                */
  #define MCAN_TXBCF_CF_Msk (0xFFFFFFFFUL << MCAN_TXBCF_CF_Pos) /*!< Bit mask of CF field.                                     */
  #define MCAN_TXBCF_CF_Min (0x0UL)                  /*!< Min enumerator value of CF field.                                    */
  #define MCAN_TXBCF_CF_Max (0x1UL)                  /*!< Max enumerator value of CF field.                                    */
  #define MCAN_TXBCF_CF_NoCancellation (0x00000000UL) /*!< No transmit buffer cancellation                                     */
  #define MCAN_TXBCF_CF_CancellationFinished (0x00000001UL) /*!< Transmit buffer cancellation finished                         */


