NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ================================================== Struct MEMCONF_POWER =================================================== */
/**
  * @brief POWER [MEMCONF_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000000) Control memory section(s) power.                      */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  RET;                               /*!< (@ 0x00000008) Control memory section(s) retention.                  */
  __IOM uint32_t  RET2;                              /*!< (@ 0x0000000C) Control memory section(s) retention.                  */
} NRF_MEMCONF_POWER_Type;                            /*!< Size = 16 (0x010)                                                    */
  #define MEMCONF_POWER_MaxCount (2UL)               /*!< Size of POWER[2] array.                                              */
  #define MEMCONF_POWER_MaxIndex (1UL)               /*!< Max index of POWER[2] array.                                         */
  #define MEMCONF_POWER_MinIndex (0UL)               /*!< Min index of POWER[2] array.                                         */

/* MEMCONF_POWER_CONTROL: Control memory section(s) power. */
  #define MEMCONF_POWER_CONTROL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONTROL register.                                */

/* MEM0 @Bit 0 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM0_Pos (0UL)       /*!< Position of MEM0 field.                                              */
  #define MEMCONF_POWER_CONTROL_MEM0_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM0_Pos) /*!< Bit mask of MEM0 field.                */
  #define MEMCONF_POWER_CONTROL_MEM0_Min (0x0UL)     /*!< Min enumerator value of MEM0 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM0_Max (0x1UL)     /*!< Max enumerator value of MEM0 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM0_Off (0x0UL)     /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM0_On (0x1UL)      /*!< Powered                                                              */

/* MEM1 @Bit 1 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM1_Pos (1UL)       /*!< Position of MEM1 field.                                              */
  #define MEMCONF_POWER_CONTROL_MEM1_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM1_Pos) /*!< Bit mask of MEM1 field.                */
  #define MEMCONF_POWER_CONTROL_MEM1_Min (0x0UL)     /*!< Min enumerator value of MEM1 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM1_Max (0x1UL)     /*!< Max enumerator value of MEM1 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM1_Off (0x0UL)     /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM1_On (0x1UL)      /*!< Powered                                                              */

/* MEM2 @Bit 2 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM2_Pos (2UL)       /*!< Position of MEM2 field.                                              */
  #define MEMCONF_POWER_CONTROL_MEM2_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM2_Pos) /*!< Bit mask of MEM2 field.                */
  #define MEMCONF_POWER_CONTROL_MEM2_Min (0x0UL)     /*!< Min enumerator value of MEM2 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM2_Max (0x1UL)     /*!< Max enumerator value of MEM2 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM2_Off (0x0UL)     /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM2_On (0x1UL)      /*!< Powered                                                              */

/* MEM3 @Bit 3 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM3_Pos (3UL)       /*!< Position of MEM3 field.                                              */
  #define MEMCONF_POWER_CONTROL_MEM3_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM3_Pos) /*!< Bit mask of MEM3 field.                */
  #define MEMCONF_POWER_CONTROL_MEM3_Min (0x0UL)     /*!< Min enumerator value of MEM3 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM3_Max (0x1UL)     /*!< Max enumerator value of MEM3 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM3_Off (0x0UL)     /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM3_On (0x1UL)      /*!< Powered                                                              */

/* MEM4 @Bit 4 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM4_Pos (4UL)       /*!< Position of MEM4 field.                                              */
  #define MEMCONF_POWER_CONTROL_MEM4_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM4_Pos) /*!< Bit mask of MEM4 field.                */
  #define MEMCONF_POWER_CONTROL_MEM4_Min (0x0UL)     /*!< Min enumerator value of MEM4 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM4_Max (0x1UL)     /*!< Max enumerator value of MEM4 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM4_Off (0x0UL)     /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM4_On (0x1UL)      /*!< Powered                                                              */

/* MEM5 @Bit 5 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM5_Pos (5UL)       /*!< Position of MEM5 field.                                              */
  #define MEMCONF_POWER_CONTROL_MEM5_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM5_Pos) /*!< Bit mask of MEM5 field.                */
  #define MEMCONF_POWER_CONTROL_MEM5_Min (0x0UL)     /*!< Min enumerator value of MEM5 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM5_Max (0x1UL)     /*!< Max enumerator value of MEM5 field.                                  */
  #define MEMCONF_POWER_CONTROL_MEM5_Off (0x0UL)     /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM5_On (0x1UL)      /*!< Powered                                                              */

