NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MEM19 @Bit 19 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM19_Pos (19UL)     /*!< Position of MEM19 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM19_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM19_Pos) /*!< Bit mask of MEM19 field.             */
  #define MEMCONF_POWER_CONTROL_MEM19_Min (0x0UL)    /*!< Min enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM19_Max (0x1UL)    /*!< Max enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM19_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM19_On (0x1UL)     /*!< Powered                                                              */

/* MEM20 @Bit 20 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM20_Pos (20UL)     /*!< Position of MEM20 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM20_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM20_Pos) /*!< Bit mask of MEM20 field.             */
  #define MEMCONF_POWER_CONTROL_MEM20_Min (0x0UL)    /*!< Min enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM20_Max (0x1UL)    /*!< Max enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM20_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM20_On (0x1UL)     /*!< Powered                                                              */

/* MEM21 @Bit 21 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM21_Pos (21UL)     /*!< Position of MEM21 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM21_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM21_Pos) /*!< Bit mask of MEM21 field.             */
  #define MEMCONF_POWER_CONTROL_MEM21_Min (0x0UL)    /*!< Min enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM21_Max (0x1UL)    /*!< Max enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM21_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM21_On (0x1UL)     /*!< Powered                                                              */

/* MEM22 @Bit 22 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM22_Pos (22UL)     /*!< Position of MEM22 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM22_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM22_Pos) /*!< Bit mask of MEM22 field.             */
  #define MEMCONF_POWER_CONTROL_MEM22_Min (0x0UL)    /*!< Min enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM22_Max (0x1UL)    /*!< Max enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM22_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM22_On (0x1UL)     /*!< Powered                                                              */

/* MEM23 @Bit 23 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM23_Pos (23UL)     /*!< Position of MEM23 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM23_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM23_Pos) /*!< Bit mask of MEM23 field.             */
  #define MEMCONF_POWER_CONTROL_MEM23_Min (0x0UL)    /*!< Min enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM23_Max (0x1UL)    /*!< Max enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM23_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM23_On (0x1UL)     /*!< Powered                                                              */

/* MEM24 @Bit 24 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM24_Pos (24UL)     /*!< Position of MEM24 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM24_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM24_Pos) /*!< Bit mask of MEM24 field.             */
  #define MEMCONF_POWER_CONTROL_MEM24_Min (0x0UL)    /*!< Min enumerator value of MEM24 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM24_Max (0x1UL)    /*!< Max enumerator value of MEM24 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM24_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM24_On (0x1UL)     /*!< Powered                                                              */

/* MEM25 @Bit 25 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM25_Pos (25UL)     /*!< Position of MEM25 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM25_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM25_Pos) /*!< Bit mask of MEM25 field.             */
  #define MEMCONF_POWER_CONTROL_MEM25_Min (0x0UL)    /*!< Min enumerator value of MEM25 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM25_Max (0x1UL)    /*!< Max enumerator value of MEM25 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM25_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM25_On (0x1UL)     /*!< Powered                                                              */

/* MEM26 @Bit 26 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM26_Pos (26UL)     /*!< Position of MEM26 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM26_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM26_Pos) /*!< Bit mask of MEM26 field.             */
  #define MEMCONF_POWER_CONTROL_MEM26_Min (0x0UL)    /*!< Min enumerator value of MEM26 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM26_Max (0x1UL)    /*!< Max enumerator value of MEM26 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM26_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM26_On (0x1UL)     /*!< Powered                                                              */

/* MEM27 @Bit 27 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM27_Pos (27UL)     /*!< Position of MEM27 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM27_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM27_Pos) /*!< Bit mask of MEM27 field.             */
  #define MEMCONF_POWER_CONTROL_MEM27_Min (0x0UL)    /*!< Min enumerator value of MEM27 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM27_Max (0x1UL)    /*!< Max enumerator value of MEM27 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM27_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM27_On (0x1UL)     /*!< Powered                                                              */

/* MEM28 @Bit 28 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM28_Pos (28UL)     /*!< Position of MEM28 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM28_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM28_Pos) /*!< Bit mask of MEM28 field.             */
  #define MEMCONF_POWER_CONTROL_MEM28_Min (0x0UL)    /*!< Min enumerator value of MEM28 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM28_Max (0x1UL)    /*!< Max enumerator value of MEM28 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM28_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM28_On (0x1UL)     /*!< Powered                                                              */

