NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MEM29 @Bit 29 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM29_Pos (29UL)     /*!< Position of MEM29 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM29_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM29_Pos) /*!< Bit mask of MEM29 field.             */
  #define MEMCONF_POWER_CONTROL_MEM29_Min (0x0UL)    /*!< Min enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM29_Max (0x1UL)    /*!< Max enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM29_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM29_On (0x1UL)     /*!< Powered                                                              */

/* MEM30 @Bit 30 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM30_Pos (30UL)     /*!< Position of MEM30 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM30_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM30_Pos) /*!< Bit mask of MEM30 field.             */
  #define MEMCONF_POWER_CONTROL_MEM30_Min (0x0UL)    /*!< Min enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM30_Max (0x1UL)    /*!< Max enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM30_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM30_On (0x1UL)     /*!< Powered                                                              */

/* MEM31 @Bit 31 : Power or unpower the corresponding memory section(s) when the domain the memory is in is powered. */
  #define MEMCONF_POWER_CONTROL_MEM31_Pos (31UL)     /*!< Position of MEM31 field.                                             */
  #define MEMCONF_POWER_CONTROL_MEM31_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM31_Pos) /*!< Bit mask of MEM31 field.             */
  #define MEMCONF_POWER_CONTROL_MEM31_Min (0x0UL)    /*!< Min enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM31_Max (0x1UL)    /*!< Max enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_CONTROL_MEM31_Off (0x0UL)    /*!< Unpowered                                                            */
  #define MEMCONF_POWER_CONTROL_MEM31_On (0x1UL)     /*!< Powered                                                              */


/* MEMCONF_POWER_RET: Control memory section(s) retention. */
  #define MEMCONF_POWER_RET_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RET register.                                        */

/* MEM0 @Bit 0 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM0_Pos (0UL)           /*!< Position of MEM0 field.                                              */
  #define MEMCONF_POWER_RET_MEM0_Msk (0x1UL << MEMCONF_POWER_RET_MEM0_Pos) /*!< Bit mask of MEM0 field.                        */
  #define MEMCONF_POWER_RET_MEM0_Min (0x0UL)         /*!< Min enumerator value of MEM0 field.                                  */
  #define MEMCONF_POWER_RET_MEM0_Max (0x1UL)         /*!< Max enumerator value of MEM0 field.                                  */
  #define MEMCONF_POWER_RET_MEM0_Off (0x0UL)         /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM0_On (0x1UL)          /*!< Retained                                                             */

/* MEM1 @Bit 1 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM1_Pos (1UL)           /*!< Position of MEM1 field.                                              */
  #define MEMCONF_POWER_RET_MEM1_Msk (0x1UL << MEMCONF_POWER_RET_MEM1_Pos) /*!< Bit mask of MEM1 field.                        */
  #define MEMCONF_POWER_RET_MEM1_Min (0x0UL)         /*!< Min enumerator value of MEM1 field.                                  */
  #define MEMCONF_POWER_RET_MEM1_Max (0x1UL)         /*!< Max enumerator value of MEM1 field.                                  */
  #define MEMCONF_POWER_RET_MEM1_Off (0x0UL)         /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM1_On (0x1UL)          /*!< Retained                                                             */

/* MEM2 @Bit 2 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM2_Pos (2UL)           /*!< Position of MEM2 field.                                              */
  #define MEMCONF_POWER_RET_MEM2_Msk (0x1UL << MEMCONF_POWER_RET_MEM2_Pos) /*!< Bit mask of MEM2 field.                        */
  #define MEMCONF_POWER_RET_MEM2_Min (0x0UL)         /*!< Min enumerator value of MEM2 field.                                  */
  #define MEMCONF_POWER_RET_MEM2_Max (0x1UL)         /*!< Max enumerator value of MEM2 field.                                  */
  #define MEMCONF_POWER_RET_MEM2_Off (0x0UL)         /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM2_On (0x1UL)          /*!< Retained                                                             */

/* MEM3 @Bit 3 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM3_Pos (3UL)           /*!< Position of MEM3 field.                                              */
  #define MEMCONF_POWER_RET_MEM3_Msk (0x1UL << MEMCONF_POWER_RET_MEM3_Pos) /*!< Bit mask of MEM3 field.                        */
  #define MEMCONF_POWER_RET_MEM3_Min (0x0UL)         /*!< Min enumerator value of MEM3 field.                                  */
  #define MEMCONF_POWER_RET_MEM3_Max (0x1UL)         /*!< Max enumerator value of MEM3 field.                                  */
  #define MEMCONF_POWER_RET_MEM3_Off (0x0UL)         /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM3_On (0x1UL)          /*!< Retained                                                             */

