NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MEM19 @Bit 19 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM19_Pos (19UL)         /*!< Position of MEM19 field.                                             */
  #define MEMCONF_POWER_RET_MEM19_Msk (0x1UL << MEMCONF_POWER_RET_MEM19_Pos) /*!< Bit mask of MEM19 field.                     */
  #define MEMCONF_POWER_RET_MEM19_Min (0x0UL)        /*!< Min enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_RET_MEM19_Max (0x1UL)        /*!< Max enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_RET_MEM19_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM19_On (0x1UL)         /*!< Retained                                                             */

/* MEM20 @Bit 20 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM20_Pos (20UL)         /*!< Position of MEM20 field.                                             */
  #define MEMCONF_POWER_RET_MEM20_Msk (0x1UL << MEMCONF_POWER_RET_MEM20_Pos) /*!< Bit mask of MEM20 field.                     */
  #define MEMCONF_POWER_RET_MEM20_Min (0x0UL)        /*!< Min enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_RET_MEM20_Max (0x1UL)        /*!< Max enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_RET_MEM20_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM20_On (0x1UL)         /*!< Retained                                                             */

/* MEM21 @Bit 21 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM21_Pos (21UL)         /*!< Position of MEM21 field.                                             */
  #define MEMCONF_POWER_RET_MEM21_Msk (0x1UL << MEMCONF_POWER_RET_MEM21_Pos) /*!< Bit mask of MEM21 field.                     */
  #define MEMCONF_POWER_RET_MEM21_Min (0x0UL)        /*!< Min enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_RET_MEM21_Max (0x1UL)        /*!< Max enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_RET_MEM21_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM21_On (0x1UL)         /*!< Retained                                                             */

/* MEM22 @Bit 22 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM22_Pos (22UL)         /*!< Position of MEM22 field.                                             */
  #define MEMCONF_POWER_RET_MEM22_Msk (0x1UL << MEMCONF_POWER_RET_MEM22_Pos) /*!< Bit mask of MEM22 field.                     */
  #define MEMCONF_POWER_RET_MEM22_Min (0x0UL)        /*!< Min enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_RET_MEM22_Max (0x1UL)        /*!< Max enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_RET_MEM22_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM22_On (0x1UL)         /*!< Retained                                                             */

/* MEM23 @Bit 23 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM23_Pos (23UL)         /*!< Position of MEM23 field.                                             */
  #define MEMCONF_POWER_RET_MEM23_Msk (0x1UL << MEMCONF_POWER_RET_MEM23_Pos) /*!< Bit mask of MEM23 field.                     */
  #define MEMCONF_POWER_RET_MEM23_Min (0x0UL)        /*!< Min enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_RET_MEM23_Max (0x1UL)        /*!< Max enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_RET_MEM23_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM23_On (0x1UL)         /*!< Retained                                                             */

/* MEM24 @Bit 24 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM24_Pos (24UL)         /*!< Position of MEM24 field.                                             */
  #define MEMCONF_POWER_RET_MEM24_Msk (0x1UL << MEMCONF_POWER_RET_MEM24_Pos) /*!< Bit mask of MEM24 field.                     */
  #define MEMCONF_POWER_RET_MEM24_Min (0x0UL)        /*!< Min enumerator value of MEM24 field.                                 */
  #define MEMCONF_POWER_RET_MEM24_Max (0x1UL)        /*!< Max enumerator value of MEM24 field.                                 */
  #define MEMCONF_POWER_RET_MEM24_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM24_On (0x1UL)         /*!< Retained                                                             */

/* MEM25 @Bit 25 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM25_Pos (25UL)         /*!< Position of MEM25 field.                                             */
  #define MEMCONF_POWER_RET_MEM25_Msk (0x1UL << MEMCONF_POWER_RET_MEM25_Pos) /*!< Bit mask of MEM25 field.                     */
  #define MEMCONF_POWER_RET_MEM25_Min (0x0UL)        /*!< Min enumerator value of MEM25 field.                                 */
  #define MEMCONF_POWER_RET_MEM25_Max (0x1UL)        /*!< Max enumerator value of MEM25 field.                                 */
  #define MEMCONF_POWER_RET_MEM25_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM25_On (0x1UL)         /*!< Retained                                                             */

/* MEM26 @Bit 26 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM26_Pos (26UL)         /*!< Position of MEM26 field.                                             */
  #define MEMCONF_POWER_RET_MEM26_Msk (0x1UL << MEMCONF_POWER_RET_MEM26_Pos) /*!< Bit mask of MEM26 field.                     */
  #define MEMCONF_POWER_RET_MEM26_Min (0x0UL)        /*!< Min enumerator value of MEM26 field.                                 */
  #define MEMCONF_POWER_RET_MEM26_Max (0x1UL)        /*!< Max enumerator value of MEM26 field.                                 */
  #define MEMCONF_POWER_RET_MEM26_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM26_On (0x1UL)         /*!< Retained                                                             */

/* MEM27 @Bit 27 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM27_Pos (27UL)         /*!< Position of MEM27 field.                                             */
  #define MEMCONF_POWER_RET_MEM27_Msk (0x1UL << MEMCONF_POWER_RET_MEM27_Pos) /*!< Bit mask of MEM27 field.                     */
  #define MEMCONF_POWER_RET_MEM27_Min (0x0UL)        /*!< Min enumerator value of MEM27 field.                                 */
  #define MEMCONF_POWER_RET_MEM27_Max (0x1UL)        /*!< Max enumerator value of MEM27 field.                                 */
  #define MEMCONF_POWER_RET_MEM27_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM27_On (0x1UL)         /*!< Retained                                                             */

/* MEM28 @Bit 28 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM28_Pos (28UL)         /*!< Position of MEM28 field.                                             */
  #define MEMCONF_POWER_RET_MEM28_Msk (0x1UL << MEMCONF_POWER_RET_MEM28_Pos) /*!< Bit mask of MEM28 field.                     */
  #define MEMCONF_POWER_RET_MEM28_Min (0x0UL)        /*!< Min enumerator value of MEM28 field.                                 */
  #define MEMCONF_POWER_RET_MEM28_Max (0x1UL)        /*!< Max enumerator value of MEM28 field.                                 */
  #define MEMCONF_POWER_RET_MEM28_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM28_On (0x1UL)         /*!< Retained                                                             */

/* MEM29 @Bit 29 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM29_Pos (29UL)         /*!< Position of MEM29 field.                                             */
  #define MEMCONF_POWER_RET_MEM29_Msk (0x1UL << MEMCONF_POWER_RET_MEM29_Pos) /*!< Bit mask of MEM29 field.                     */
  #define MEMCONF_POWER_RET_MEM29_Min (0x0UL)        /*!< Min enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_RET_MEM29_Max (0x1UL)        /*!< Max enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_RET_MEM29_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM29_On (0x1UL)         /*!< Retained                                                             */

/* MEM30 @Bit 30 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM30_Pos (30UL)         /*!< Position of MEM30 field.                                             */
  #define MEMCONF_POWER_RET_MEM30_Msk (0x1UL << MEMCONF_POWER_RET_MEM30_Pos) /*!< Bit mask of MEM30 field.                     */
  #define MEMCONF_POWER_RET_MEM30_Min (0x0UL)        /*!< Min enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_RET_MEM30_Max (0x1UL)        /*!< Max enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_RET_MEM30_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM30_On (0x1UL)         /*!< Retained                                                             */

/* MEM31 @Bit 31 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET_MEM31_Pos (31UL)         /*!< Position of MEM31 field.                                             */
  #define MEMCONF_POWER_RET_MEM31_Msk (0x1UL << MEMCONF_POWER_RET_MEM31_Pos) /*!< Bit mask of MEM31 field.                     */
  #define MEMCONF_POWER_RET_MEM31_Min (0x0UL)        /*!< Min enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_RET_MEM31_Max (0x1UL)        /*!< Max enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_RET_MEM31_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET_MEM31_On (0x1UL)         /*!< Retained                                                             */


/* MEMCONF_POWER_RET2: Control memory section(s) retention. */
  #define MEMCONF_POWER_RET2_ResetValue (0xFFFFFFFFUL) /*!< Reset value of RET2 register.                                      */

