NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MEM0 @Bit 0 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM0_Pos (0UL)          /*!< Position of MEM0 field.                                              */
  #define MEMCONF_POWER_RET2_MEM0_Msk (0x1UL << MEMCONF_POWER_RET2_MEM0_Pos) /*!< Bit mask of MEM0 field.                      */
  #define MEMCONF_POWER_RET2_MEM0_Min (0x0UL)        /*!< Min enumerator value of MEM0 field.                                  */
  #define MEMCONF_POWER_RET2_MEM0_Max (0x1UL)        /*!< Max enumerator value of MEM0 field.                                  */
  #define MEMCONF_POWER_RET2_MEM0_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM0_On (0x1UL)         /*!< Retained                                                             */

/* MEM1 @Bit 1 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM1_Pos (1UL)          /*!< Position of MEM1 field.                                              */
  #define MEMCONF_POWER_RET2_MEM1_Msk (0x1UL << MEMCONF_POWER_RET2_MEM1_Pos) /*!< Bit mask of MEM1 field.                      */
  #define MEMCONF_POWER_RET2_MEM1_Min (0x0UL)        /*!< Min enumerator value of MEM1 field.                                  */
  #define MEMCONF_POWER_RET2_MEM1_Max (0x1UL)        /*!< Max enumerator value of MEM1 field.                                  */
  #define MEMCONF_POWER_RET2_MEM1_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM1_On (0x1UL)         /*!< Retained                                                             */

/* MEM2 @Bit 2 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM2_Pos (2UL)          /*!< Position of MEM2 field.                                              */
  #define MEMCONF_POWER_RET2_MEM2_Msk (0x1UL << MEMCONF_POWER_RET2_MEM2_Pos) /*!< Bit mask of MEM2 field.                      */
  #define MEMCONF_POWER_RET2_MEM2_Min (0x0UL)        /*!< Min enumerator value of MEM2 field.                                  */
  #define MEMCONF_POWER_RET2_MEM2_Max (0x1UL)        /*!< Max enumerator value of MEM2 field.                                  */
  #define MEMCONF_POWER_RET2_MEM2_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM2_On (0x1UL)         /*!< Retained                                                             */

/* MEM3 @Bit 3 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM3_Pos (3UL)          /*!< Position of MEM3 field.                                              */
  #define MEMCONF_POWER_RET2_MEM3_Msk (0x1UL << MEMCONF_POWER_RET2_MEM3_Pos) /*!< Bit mask of MEM3 field.                      */
  #define MEMCONF_POWER_RET2_MEM3_Min (0x0UL)        /*!< Min enumerator value of MEM3 field.                                  */
  #define MEMCONF_POWER_RET2_MEM3_Max (0x1UL)        /*!< Max enumerator value of MEM3 field.                                  */
  #define MEMCONF_POWER_RET2_MEM3_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM3_On (0x1UL)         /*!< Retained                                                             */

/* MEM4 @Bit 4 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM4_Pos (4UL)          /*!< Position of MEM4 field.                                              */
  #define MEMCONF_POWER_RET2_MEM4_Msk (0x1UL << MEMCONF_POWER_RET2_MEM4_Pos) /*!< Bit mask of MEM4 field.                      */
  #define MEMCONF_POWER_RET2_MEM4_Min (0x0UL)        /*!< Min enumerator value of MEM4 field.                                  */
  #define MEMCONF_POWER_RET2_MEM4_Max (0x1UL)        /*!< Max enumerator value of MEM4 field.                                  */
  #define MEMCONF_POWER_RET2_MEM4_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM4_On (0x1UL)         /*!< Retained                                                             */

/* MEM5 @Bit 5 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM5_Pos (5UL)          /*!< Position of MEM5 field.                                              */
  #define MEMCONF_POWER_RET2_MEM5_Msk (0x1UL << MEMCONF_POWER_RET2_MEM5_Pos) /*!< Bit mask of MEM5 field.                      */
  #define MEMCONF_POWER_RET2_MEM5_Min (0x0UL)        /*!< Min enumerator value of MEM5 field.                                  */
  #define MEMCONF_POWER_RET2_MEM5_Max (0x1UL)        /*!< Max enumerator value of MEM5 field.                                  */
  #define MEMCONF_POWER_RET2_MEM5_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM5_On (0x1UL)         /*!< Retained                                                             */

/* MEM6 @Bit 6 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM6_Pos (6UL)          /*!< Position of MEM6 field.                                              */
  #define MEMCONF_POWER_RET2_MEM6_Msk (0x1UL << MEMCONF_POWER_RET2_MEM6_Pos) /*!< Bit mask of MEM6 field.                      */
  #define MEMCONF_POWER_RET2_MEM6_Min (0x0UL)        /*!< Min enumerator value of MEM6 field.                                  */
  #define MEMCONF_POWER_RET2_MEM6_Max (0x1UL)        /*!< Max enumerator value of MEM6 field.                                  */
  #define MEMCONF_POWER_RET2_MEM6_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM6_On (0x1UL)         /*!< Retained                                                             */

