NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MEM7 @Bit 7 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM7_Pos (7UL)          /*!< Position of MEM7 field.                                              */
  #define MEMCONF_POWER_RET2_MEM7_Msk (0x1UL << MEMCONF_POWER_RET2_MEM7_Pos) /*!< Bit mask of MEM7 field.                      */
  #define MEMCONF_POWER_RET2_MEM7_Min (0x0UL)        /*!< Min enumerator value of MEM7 field.                                  */
  #define MEMCONF_POWER_RET2_MEM7_Max (0x1UL)        /*!< Max enumerator value of MEM7 field.                                  */
  #define MEMCONF_POWER_RET2_MEM7_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM7_On (0x1UL)         /*!< Retained                                                             */

/* MEM8 @Bit 8 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM8_Pos (8UL)          /*!< Position of MEM8 field.                                              */
  #define MEMCONF_POWER_RET2_MEM8_Msk (0x1UL << MEMCONF_POWER_RET2_MEM8_Pos) /*!< Bit mask of MEM8 field.                      */
  #define MEMCONF_POWER_RET2_MEM8_Min (0x0UL)        /*!< Min enumerator value of MEM8 field.                                  */
  #define MEMCONF_POWER_RET2_MEM8_Max (0x1UL)        /*!< Max enumerator value of MEM8 field.                                  */
  #define MEMCONF_POWER_RET2_MEM8_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM8_On (0x1UL)         /*!< Retained                                                             */

/* MEM9 @Bit 9 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM9_Pos (9UL)          /*!< Position of MEM9 field.                                              */
  #define MEMCONF_POWER_RET2_MEM9_Msk (0x1UL << MEMCONF_POWER_RET2_MEM9_Pos) /*!< Bit mask of MEM9 field.                      */
  #define MEMCONF_POWER_RET2_MEM9_Min (0x0UL)        /*!< Min enumerator value of MEM9 field.                                  */
  #define MEMCONF_POWER_RET2_MEM9_Max (0x1UL)        /*!< Max enumerator value of MEM9 field.                                  */
  #define MEMCONF_POWER_RET2_MEM9_Off (0x0UL)        /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM9_On (0x1UL)         /*!< Retained                                                             */

/* MEM10 @Bit 10 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM10_Pos (10UL)        /*!< Position of MEM10 field.                                             */
  #define MEMCONF_POWER_RET2_MEM10_Msk (0x1UL << MEMCONF_POWER_RET2_MEM10_Pos) /*!< Bit mask of MEM10 field.                   */
  #define MEMCONF_POWER_RET2_MEM10_Min (0x0UL)       /*!< Min enumerator value of MEM10 field.                                 */
  #define MEMCONF_POWER_RET2_MEM10_Max (0x1UL)       /*!< Max enumerator value of MEM10 field.                                 */
  #define MEMCONF_POWER_RET2_MEM10_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM10_On (0x1UL)        /*!< Retained                                                             */

/* MEM11 @Bit 11 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM11_Pos (11UL)        /*!< Position of MEM11 field.                                             */
  #define MEMCONF_POWER_RET2_MEM11_Msk (0x1UL << MEMCONF_POWER_RET2_MEM11_Pos) /*!< Bit mask of MEM11 field.                   */
  #define MEMCONF_POWER_RET2_MEM11_Min (0x0UL)       /*!< Min enumerator value of MEM11 field.                                 */
  #define MEMCONF_POWER_RET2_MEM11_Max (0x1UL)       /*!< Max enumerator value of MEM11 field.                                 */
  #define MEMCONF_POWER_RET2_MEM11_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM11_On (0x1UL)        /*!< Retained                                                             */

/* MEM12 @Bit 12 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM12_Pos (12UL)        /*!< Position of MEM12 field.                                             */
  #define MEMCONF_POWER_RET2_MEM12_Msk (0x1UL << MEMCONF_POWER_RET2_MEM12_Pos) /*!< Bit mask of MEM12 field.                   */
  #define MEMCONF_POWER_RET2_MEM12_Min (0x0UL)       /*!< Min enumerator value of MEM12 field.                                 */
  #define MEMCONF_POWER_RET2_MEM12_Max (0x1UL)       /*!< Max enumerator value of MEM12 field.                                 */
  #define MEMCONF_POWER_RET2_MEM12_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM12_On (0x1UL)        /*!< Retained                                                             */

/* MEM13 @Bit 13 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM13_Pos (13UL)        /*!< Position of MEM13 field.                                             */
  #define MEMCONF_POWER_RET2_MEM13_Msk (0x1UL << MEMCONF_POWER_RET2_MEM13_Pos) /*!< Bit mask of MEM13 field.                   */
  #define MEMCONF_POWER_RET2_MEM13_Min (0x0UL)       /*!< Min enumerator value of MEM13 field.                                 */
  #define MEMCONF_POWER_RET2_MEM13_Max (0x1UL)       /*!< Max enumerator value of MEM13 field.                                 */
  #define MEMCONF_POWER_RET2_MEM13_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM13_On (0x1UL)        /*!< Retained                                                             */

/* MEM14 @Bit 14 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM14_Pos (14UL)        /*!< Position of MEM14 field.                                             */
  #define MEMCONF_POWER_RET2_MEM14_Msk (0x1UL << MEMCONF_POWER_RET2_MEM14_Pos) /*!< Bit mask of MEM14 field.                   */
  #define MEMCONF_POWER_RET2_MEM14_Min (0x0UL)       /*!< Min enumerator value of MEM14 field.                                 */
  #define MEMCONF_POWER_RET2_MEM14_Max (0x1UL)       /*!< Max enumerator value of MEM14 field.                                 */
  #define MEMCONF_POWER_RET2_MEM14_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM14_On (0x1UL)        /*!< Retained                                                             */

/* MEM15 @Bit 15 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM15_Pos (15UL)        /*!< Position of MEM15 field.                                             */
  #define MEMCONF_POWER_RET2_MEM15_Msk (0x1UL << MEMCONF_POWER_RET2_MEM15_Pos) /*!< Bit mask of MEM15 field.                   */
  #define MEMCONF_POWER_RET2_MEM15_Min (0x0UL)       /*!< Min enumerator value of MEM15 field.                                 */
  #define MEMCONF_POWER_RET2_MEM15_Max (0x1UL)       /*!< Max enumerator value of MEM15 field.                                 */
  #define MEMCONF_POWER_RET2_MEM15_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM15_On (0x1UL)        /*!< Retained                                                             */

/* MEM16 @Bit 16 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM16_Pos (16UL)        /*!< Position of MEM16 field.                                             */
  #define MEMCONF_POWER_RET2_MEM16_Msk (0x1UL << MEMCONF_POWER_RET2_MEM16_Pos) /*!< Bit mask of MEM16 field.                   */
  #define MEMCONF_POWER_RET2_MEM16_Min (0x0UL)       /*!< Min enumerator value of MEM16 field.                                 */
  #define MEMCONF_POWER_RET2_MEM16_Max (0x1UL)       /*!< Max enumerator value of MEM16 field.                                 */
  #define MEMCONF_POWER_RET2_MEM16_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM16_On (0x1UL)        /*!< Retained                                                             */

