NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MEM17 @Bit 17 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM17_Pos (17UL)        /*!< Position of MEM17 field.                                             */
  #define MEMCONF_POWER_RET2_MEM17_Msk (0x1UL << MEMCONF_POWER_RET2_MEM17_Pos) /*!< Bit mask of MEM17 field.                   */
  #define MEMCONF_POWER_RET2_MEM17_Min (0x0UL)       /*!< Min enumerator value of MEM17 field.                                 */
  #define MEMCONF_POWER_RET2_MEM17_Max (0x1UL)       /*!< Max enumerator value of MEM17 field.                                 */
  #define MEMCONF_POWER_RET2_MEM17_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM17_On (0x1UL)        /*!< Retained                                                             */

/* MEM18 @Bit 18 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM18_Pos (18UL)        /*!< Position of MEM18 field.                                             */
  #define MEMCONF_POWER_RET2_MEM18_Msk (0x1UL << MEMCONF_POWER_RET2_MEM18_Pos) /*!< Bit mask of MEM18 field.                   */
  #define MEMCONF_POWER_RET2_MEM18_Min (0x0UL)       /*!< Min enumerator value of MEM18 field.                                 */
  #define MEMCONF_POWER_RET2_MEM18_Max (0x1UL)       /*!< Max enumerator value of MEM18 field.                                 */
  #define MEMCONF_POWER_RET2_MEM18_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM18_On (0x1UL)        /*!< Retained                                                             */

/* MEM19 @Bit 19 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM19_Pos (19UL)        /*!< Position of MEM19 field.                                             */
  #define MEMCONF_POWER_RET2_MEM19_Msk (0x1UL << MEMCONF_POWER_RET2_MEM19_Pos) /*!< Bit mask of MEM19 field.                   */
  #define MEMCONF_POWER_RET2_MEM19_Min (0x0UL)       /*!< Min enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_RET2_MEM19_Max (0x1UL)       /*!< Max enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_RET2_MEM19_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM19_On (0x1UL)        /*!< Retained                                                             */

/* MEM20 @Bit 20 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM20_Pos (20UL)        /*!< Position of MEM20 field.                                             */
  #define MEMCONF_POWER_RET2_MEM20_Msk (0x1UL << MEMCONF_POWER_RET2_MEM20_Pos) /*!< Bit mask of MEM20 field.                   */
  #define MEMCONF_POWER_RET2_MEM20_Min (0x0UL)       /*!< Min enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_RET2_MEM20_Max (0x1UL)       /*!< Max enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_RET2_MEM20_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM20_On (0x1UL)        /*!< Retained                                                             */

/* MEM21 @Bit 21 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM21_Pos (21UL)        /*!< Position of MEM21 field.                                             */
  #define MEMCONF_POWER_RET2_MEM21_Msk (0x1UL << MEMCONF_POWER_RET2_MEM21_Pos) /*!< Bit mask of MEM21 field.                   */
  #define MEMCONF_POWER_RET2_MEM21_Min (0x0UL)       /*!< Min enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_RET2_MEM21_Max (0x1UL)       /*!< Max enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_RET2_MEM21_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM21_On (0x1UL)        /*!< Retained                                                             */

/* MEM22 @Bit 22 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM22_Pos (22UL)        /*!< Position of MEM22 field.                                             */
  #define MEMCONF_POWER_RET2_MEM22_Msk (0x1UL << MEMCONF_POWER_RET2_MEM22_Pos) /*!< Bit mask of MEM22 field.                   */
  #define MEMCONF_POWER_RET2_MEM22_Min (0x0UL)       /*!< Min enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_RET2_MEM22_Max (0x1UL)       /*!< Max enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_RET2_MEM22_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM22_On (0x1UL)        /*!< Retained                                                             */

/* MEM23 @Bit 23 : Retain or do not retain the corresponding memory section(s) when the domain the memory is in is unpowered. */
  #define MEMCONF_POWER_RET2_MEM23_Pos (23UL)        /*!< Position of MEM23 field.                                             */
  #define MEMCONF_POWER_RET2_MEM23_Msk (0x1UL << MEMCONF_POWER_RET2_MEM23_Pos) /*!< Bit mask of MEM23 field.                   */
  #define MEMCONF_POWER_RET2_MEM23_Min (0x0UL)       /*!< Min enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_RET2_MEM23_Max (0x1UL)       /*!< Max enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_RET2_MEM23_Off (0x0UL)       /*!< Not retained                                                         */
  #define MEMCONF_POWER_RET2_MEM23_On (0x1UL)        /*!< Retained                                                             */

