NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MEMCONF_BLOCKTYPE_TRIM: Memory trim configuration. */
  #define MEMCONF_BLOCKTYPE_TRIM_ResetValue (0x00000000UL) /*!< Reset value of TRIM register.                                  */

/* TRIM @Bits 0..31 : Trim value */
  #define MEMCONF_BLOCKTYPE_TRIM_TRIM_Pos (0UL)      /*!< Position of TRIM field.                                              */
  #define MEMCONF_BLOCKTYPE_TRIM_TRIM_Msk (0xFFFFFFFFUL << MEMCONF_BLOCKTYPE_TRIM_TRIM_Pos) /*!< Bit mask of TRIM field.       */


/* ===================================================== Struct MEMCONF ====================================================== */
/**
  * @brief Memory configuration
  */
  typedef struct {                                   /*!< MEMCONF Structure                                                    */
    __IM uint32_t RESERVED[320];
    __IOM NRF_MEMCONF_POWER_Type POWER[2];           /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED1[248];
    __IOM NRF_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[64];  /*!< (@ 0x00000900) (unspecified)                                         */
  } NRF_MEMCONF_Type;                                /*!< Size = 2560 (0xA00)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            MPC                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct MPC_MEMACCERR =================================================== */
/**
  * @brief MEMACCERR [MPC_MEMACCERR] Memory Access Error status registers
  */
typedef struct {
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Target Address of Memory Access Error. Register content
                                                                         won't be changed as long as MEMACCERR event is active.*/
  __IM  uint32_t  INFO;                              /*!< (@ 0x00000004) Access information for the transaction that triggered a
                                                                         memory access error. Register content won't be changed
                                                                         as long as MEMACCERR event is active.*/
} NRF_MPC_MEMACCERR_Type;                            /*!< Size = 8 (0x008)                                                     */

/* MPC_MEMACCERR_ADDRESS: Target Address of Memory Access Error. Register content won't be changed as long as MEMACCERR event is
                           active. */

  #define MPC_MEMACCERR_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                */

/* ADDRESS @Bits 0..31 : Target address for erroneous access */
  #define MPC_MEMACCERR_ADDRESS_ADDRESS_Pos (0UL)    /*!< Position of ADDRESS field.                                           */
  #define MPC_MEMACCERR_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MPC_MEMACCERR_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.*/


/* MPC_MEMACCERR_INFO: Access information for the transaction that triggered a memory access error. Register content won't be
                        changed as long as MEMACCERR event is active. */

  #define MPC_MEMACCERR_INFO_ResetValue (0x00000000UL) /*!< Reset value of INFO register.                                      */

/* OWNERID @Bits 0..3 : Owner identifier of the erroneous access */
  #define MPC_MEMACCERR_INFO_OWNERID_Pos (0UL)       /*!< Position of OWNERID field.                                           */
  #define MPC_MEMACCERR_INFO_OWNERID_Msk (0xFUL << MPC_MEMACCERR_INFO_OWNERID_Pos) /*!< Bit mask of OWNERID field.             */
  #define MPC_MEMACCERR_INFO_OWNERID_Min (0x0UL)     /*!< Min value of OWNERID field.                                          */
  #define MPC_MEMACCERR_INFO_OWNERID_Max (0xFUL)     /*!< Max size of OWNERID field.                                           */

/* MASTERPORT @Bits 4..8 : Master port where erroneous access is detected */
  #define MPC_MEMACCERR_INFO_MASTERPORT_Pos (4UL)    /*!< Position of MASTERPORT field.                                        */
  #define MPC_MEMACCERR_INFO_MASTERPORT_Msk (0x1FUL << MPC_MEMACCERR_INFO_MASTERPORT_Pos) /*!< Bit mask of MASTERPORT field.   */
  #define MPC_MEMACCERR_INFO_MASTERPORT_Min (0x00UL) /*!< Min value of MASTERPORT field.                                       */
  #define MPC_MEMACCERR_INFO_MASTERPORT_Max (0x1FUL) /*!< Max size of MASTERPORT field.                                        */

/* READ @Bit 12 : Read bit of bus access */
  #define MPC_MEMACCERR_INFO_READ_Pos (12UL)         /*!< Position of READ field.                                              */
  #define MPC_MEMACCERR_INFO_READ_Msk (0x1UL << MPC_MEMACCERR_INFO_READ_Pos) /*!< Bit mask of READ field.                      */
  #define MPC_MEMACCERR_INFO_READ_Min (0x0UL)        /*!< Min enumerator value of READ field.                                  */
  #define MPC_MEMACCERR_INFO_READ_Max (0x1UL)        /*!< Max enumerator value of READ field.                                  */
  #define MPC_MEMACCERR_INFO_READ_Set (0x1UL)        /*!< Read access bit was set                                              */
  #define MPC_MEMACCERR_INFO_READ_NotSet (0x0UL)     /*!< Read access bit was not set                                          */

/* WRITE @Bit 13 : Write bit of bus access */
  #define MPC_MEMACCERR_INFO_WRITE_Pos (13UL)        /*!< Position of WRITE field.                                             */
  #define MPC_MEMACCERR_INFO_WRITE_Msk (0x1UL << MPC_MEMACCERR_INFO_WRITE_Pos) /*!< Bit mask of WRITE field.                   */
  #define MPC_MEMACCERR_INFO_WRITE_Min (0x0UL)       /*!< Min enumerator value of WRITE field.                                 */
  #define MPC_MEMACCERR_INFO_WRITE_Max (0x1UL)       /*!< Max enumerator value of WRITE field.                                 */
  #define MPC_MEMACCERR_INFO_WRITE_Set (0x1UL)       /*!< Write access bit was set                                             */
  #define MPC_MEMACCERR_INFO_WRITE_NotSet (0x0UL)    /*!< Write access bit was not set                                         */

/* EXECUTE @Bit 14 : Execute bit of bus access */
  #define MPC_MEMACCERR_INFO_EXECUTE_Pos (14UL)      /*!< Position of EXECUTE field.                                           */
  #define MPC_MEMACCERR_INFO_EXECUTE_Msk (0x1UL << MPC_MEMACCERR_INFO_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.             */
  #define MPC_MEMACCERR_INFO_EXECUTE_Min (0x0UL)     /*!< Min enumerator value of EXECUTE field.                               */
  #define MPC_MEMACCERR_INFO_EXECUTE_Max (0x1UL)     /*!< Max enumerator value of EXECUTE field.                               */
  #define MPC_MEMACCERR_INFO_EXECUTE_Set (0x1UL)     /*!< Execute access bit was set                                           */
  #define MPC_MEMACCERR_INFO_EXECUTE_NotSet (0x0UL)  /*!< Execute access bit was not set                                       */

/* SECURE @Bit 15 : Secure bit of bus access */
  #define MPC_MEMACCERR_INFO_SECURE_Pos (15UL)       /*!< Position of SECURE field.                                            */
  #define MPC_MEMACCERR_INFO_SECURE_Msk (0x1UL << MPC_MEMACCERR_INFO_SECURE_Pos) /*!< Bit mask of SECURE field.                */
  #define MPC_MEMACCERR_INFO_SECURE_Min (0x0UL)      /*!< Min enumerator value of SECURE field.                                */
  #define MPC_MEMACCERR_INFO_SECURE_Max (0x1UL)      /*!< Max enumerator value of SECURE field.                                */
  #define MPC_MEMACCERR_INFO_SECURE_Set (0x1UL)      /*!< Secure access bit was set                                            */
  #define MPC_MEMACCERR_INFO_SECURE_NotSet (0x0UL)   /*!< Secure access bit was not set                                        */

