NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CONNECTION5 @Bit 5 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Pos (5UL) /*!< Position of CONNECTION5 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Pos) /*!< Bit mask of
                                                                            CONNECTION5 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Min (0x0UL) /*!< Min enumerator value of CONNECTION5 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Max (0x1UL) /*!< Max enumerator value of CONNECTION5 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Disabled (0x0UL) /*!< Master port 5 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Enabled (0x1UL) /*!< Master port 5 connection to global slave is enabled      */

/* CONNECTION6 @Bit 6 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Pos (6UL) /*!< Position of CONNECTION6 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Pos) /*!< Bit mask of
                                                                            CONNECTION6 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Min (0x0UL) /*!< Min enumerator value of CONNECTION6 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Max (0x1UL) /*!< Max enumerator value of CONNECTION6 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Disabled (0x0UL) /*!< Master port 6 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Enabled (0x1UL) /*!< Master port 6 connection to global slave is enabled      */

/* CONNECTION7 @Bit 7 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Pos (7UL) /*!< Position of CONNECTION7 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Pos) /*!< Bit mask of
                                                                            CONNECTION7 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Min (0x0UL) /*!< Min enumerator value of CONNECTION7 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Max (0x1UL) /*!< Max enumerator value of CONNECTION7 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Disabled (0x0UL) /*!< Master port 7 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Enabled (0x1UL) /*!< Master port 7 connection to global slave is enabled      */

/* CONNECTION8 @Bit 8 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Pos (8UL) /*!< Position of CONNECTION8 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Pos) /*!< Bit mask of
                                                                            CONNECTION8 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Min (0x0UL) /*!< Min enumerator value of CONNECTION8 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Max (0x1UL) /*!< Max enumerator value of CONNECTION8 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Disabled (0x0UL) /*!< Master port 8 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Enabled (0x1UL) /*!< Master port 8 connection to global slave is enabled      */

/* CONNECTION9 @Bit 9 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Pos (9UL) /*!< Position of CONNECTION9 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Pos) /*!< Bit mask of
                                                                            CONNECTION9 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Min (0x0UL) /*!< Min enumerator value of CONNECTION9 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Max (0x1UL) /*!< Max enumerator value of CONNECTION9 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Disabled (0x0UL) /*!< Master port 9 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Enabled (0x1UL) /*!< Master port 9 connection to global slave is enabled      */

/* CONNECTION10 @Bit 10 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Pos (10UL) /*!< Position of CONNECTION10 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Pos) /*!< Bit mask of
                                                                            CONNECTION10 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Min (0x0UL) /*!< Min enumerator value of CONNECTION10 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Max (0x1UL) /*!< Max enumerator value of CONNECTION10 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Disabled (0x0UL) /*!< Master port 10 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Enabled (0x1UL) /*!< Master port 10 connection to global slave is enabled    */

/* CONNECTION11 @Bit 11 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Pos (11UL) /*!< Position of CONNECTION11 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Pos) /*!< Bit mask of
                                                                            CONNECTION11 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Min (0x0UL) /*!< Min enumerator value of CONNECTION11 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Max (0x1UL) /*!< Max enumerator value of CONNECTION11 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Disabled (0x0UL) /*!< Master port 11 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Enabled (0x1UL) /*!< Master port 11 connection to global slave is enabled    */

