NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CONNECTION12 @Bit 12 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Pos (12UL) /*!< Position of CONNECTION12 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Pos) /*!< Bit mask of
                                                                            CONNECTION12 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Min (0x0UL) /*!< Min enumerator value of CONNECTION12 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Max (0x1UL) /*!< Max enumerator value of CONNECTION12 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Disabled (0x0UL) /*!< Master port 12 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Enabled (0x1UL) /*!< Master port 12 connection to global slave is enabled    */

/* CONNECTION13 @Bit 13 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Pos (13UL) /*!< Position of CONNECTION13 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Pos) /*!< Bit mask of
                                                                            CONNECTION13 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Min (0x0UL) /*!< Min enumerator value of CONNECTION13 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Max (0x1UL) /*!< Max enumerator value of CONNECTION13 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Disabled (0x0UL) /*!< Master port 13 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Enabled (0x1UL) /*!< Master port 13 connection to global slave is enabled    */

/* CONNECTION14 @Bit 14 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Pos (14UL) /*!< Position of CONNECTION14 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Pos) /*!< Bit mask of
                                                                            CONNECTION14 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Min (0x0UL) /*!< Min enumerator value of CONNECTION14 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Max (0x1UL) /*!< Max enumerator value of CONNECTION14 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Disabled (0x0UL) /*!< Master port 14 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Enabled (0x1UL) /*!< Master port 14 connection to global slave is enabled    */

/* CONNECTION15 @Bit 15 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Pos (15UL) /*!< Position of CONNECTION15 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Pos) /*!< Bit mask of
                                                                            CONNECTION15 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Min (0x0UL) /*!< Min enumerator value of CONNECTION15 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Max (0x1UL) /*!< Max enumerator value of CONNECTION15 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Disabled (0x0UL) /*!< Master port 15 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Enabled (0x1UL) /*!< Master port 15 connection to global slave is enabled    */

/* CONNECTION16 @Bit 16 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Pos (16UL) /*!< Position of CONNECTION16 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Pos) /*!< Bit mask of
                                                                            CONNECTION16 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Min (0x0UL) /*!< Min enumerator value of CONNECTION16 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Max (0x1UL) /*!< Max enumerator value of CONNECTION16 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Disabled (0x0UL) /*!< Master port 16 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Enabled (0x1UL) /*!< Master port 16 connection to global slave is enabled    */

/* CONNECTION17 @Bit 17 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Pos (17UL) /*!< Position of CONNECTION17 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Pos) /*!< Bit mask of
                                                                            CONNECTION17 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Min (0x0UL) /*!< Min enumerator value of CONNECTION17 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Max (0x1UL) /*!< Max enumerator value of CONNECTION17 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Disabled (0x0UL) /*!< Master port 17 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Enabled (0x1UL) /*!< Master port 17 connection to global slave is enabled    */

/* CONNECTION18 @Bit 18 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Pos (18UL) /*!< Position of CONNECTION18 field.                              */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Pos) /*!< Bit mask of
                                                                            CONNECTION18 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Min (0x0UL) /*!< Min enumerator value of CONNECTION18 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Max (0x1UL) /*!< Max enumerator value of CONNECTION18 field.                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Disabled (0x0UL) /*!< Master port 18 connection to global slave is disabled  */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Enabled (0x1UL) /*!< Master port 18 connection to global slave is enabled    */

