NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ENABLE28 @Bit 28 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Pos (28UL) /*!< Position of ENABLE28 field.                                         */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE28_Pos) /*!< Bit mask of ENABLE28 field.*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Min (0x0UL) /*!< Min enumerator value of ENABLE28 field.                            */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Max (0x1UL) /*!< Max enumerator value of ENABLE28 field.                            */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 28 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 28 Write Address
                                                               Channel*/

/* ENABLE29 @Bit 29 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Pos (29UL) /*!< Position of ENABLE29 field.                                         */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE29_Pos) /*!< Bit mask of ENABLE29 field.*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Min (0x0UL) /*!< Min enumerator value of ENABLE29 field.                            */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Max (0x1UL) /*!< Max enumerator value of ENABLE29 field.                            */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 29 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 29 Write Address
                                                               Channel*/

/* ENABLE30 @Bit 30 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Pos (30UL) /*!< Position of ENABLE30 field.                                         */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE30_Pos) /*!< Bit mask of ENABLE30 field.*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Min (0x0UL) /*!< Min enumerator value of ENABLE30 field.                            */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Max (0x1UL) /*!< Max enumerator value of ENABLE30 field.                            */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 30 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 30 Write Address
                                                               Channel*/

/* ENABLE31 @Bit 31 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Pos (31UL) /*!< Position of ENABLE31 field.                                         */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE31_Pos) /*!< Bit mask of ENABLE31 field.*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Min (0x0UL) /*!< Min enumerator value of ENABLE31 field.                            */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Max (0x1UL) /*!< Max enumerator value of ENABLE31 field.                            */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 31 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 31 Write Address
                                                               Channel*/


/* MPC_RTCHOKE_READACCESS: Enable AXI Read Address Channel Real Time Choke for master port */
  #define MPC_RTCHOKE_READACCESS_ResetValue (0x00000000UL) /*!< Reset value of READACCESS register.                            */

/* ENABLE0 @Bit 0 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Pos (0UL)   /*!< Position of ENABLE0 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Min (0x0UL) /*!< Min enumerator value of ENABLE0 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Max (0x1UL) /*!< Max enumerator value of ENABLE0 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 0 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 0 Read Address Channel */

/* ENABLE1 @Bit 1 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Pos (1UL)   /*!< Position of ENABLE1 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Min (0x0UL) /*!< Min enumerator value of ENABLE1 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Max (0x1UL) /*!< Max enumerator value of ENABLE1 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 1 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 1 Read Address Channel */

/* ENABLE2 @Bit 2 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Pos (2UL)   /*!< Position of ENABLE2 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE2_Pos) /*!< Bit mask of ENABLE2 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Min (0x0UL) /*!< Min enumerator value of ENABLE2 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Max (0x1UL) /*!< Max enumerator value of ENABLE2 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 2 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 2 Read Address Channel */

/* ENABLE3 @Bit 3 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Pos (3UL)   /*!< Position of ENABLE3 field.                                           */
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE3_Pos) /*!< Bit mask of ENABLE3 field.     */
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Min (0x0UL) /*!< Min enumerator value of ENABLE3 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Max (0x1UL) /*!< Max enumerator value of ENABLE3 field.                               */
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 3 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 3 Read Address Channel */

