NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ENABLE20 @Bit 20 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Pos (20UL) /*!< Position of ENABLE20 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE20_Pos) /*!< Bit mask of ENABLE20 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Min (0x0UL) /*!< Min enumerator value of ENABLE20 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Max (0x1UL) /*!< Max enumerator value of ENABLE20 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Disable (0x0UL) /*!< Override region n is disabled for master port 20               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Enable (0x1UL) /*!< Override region n is enabled for master port 20                 */

/* ENABLE21 @Bit 21 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Pos (21UL) /*!< Position of ENABLE21 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE21_Pos) /*!< Bit mask of ENABLE21 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Min (0x0UL) /*!< Min enumerator value of ENABLE21 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Max (0x1UL) /*!< Max enumerator value of ENABLE21 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Disable (0x0UL) /*!< Override region n is disabled for master port 21               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Enable (0x1UL) /*!< Override region n is enabled for master port 21                 */

/* ENABLE22 @Bit 22 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Pos (22UL) /*!< Position of ENABLE22 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE22_Pos) /*!< Bit mask of ENABLE22 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Min (0x0UL) /*!< Min enumerator value of ENABLE22 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Max (0x1UL) /*!< Max enumerator value of ENABLE22 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Disable (0x0UL) /*!< Override region n is disabled for master port 22               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Enable (0x1UL) /*!< Override region n is enabled for master port 22                 */

/* ENABLE23 @Bit 23 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Pos (23UL) /*!< Position of ENABLE23 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE23_Pos) /*!< Bit mask of ENABLE23 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Min (0x0UL) /*!< Min enumerator value of ENABLE23 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Max (0x1UL) /*!< Max enumerator value of ENABLE23 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Disable (0x0UL) /*!< Override region n is disabled for master port 23               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Enable (0x1UL) /*!< Override region n is enabled for master port 23                 */

/* ENABLE24 @Bit 24 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Pos (24UL) /*!< Position of ENABLE24 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE24_Pos) /*!< Bit mask of ENABLE24 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Min (0x0UL) /*!< Min enumerator value of ENABLE24 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Max (0x1UL) /*!< Max enumerator value of ENABLE24 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Disable (0x0UL) /*!< Override region n is disabled for master port 24               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Enable (0x1UL) /*!< Override region n is enabled for master port 24                 */

/* ENABLE25 @Bit 25 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Pos (25UL) /*!< Position of ENABLE25 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE25_Pos) /*!< Bit mask of ENABLE25 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Min (0x0UL) /*!< Min enumerator value of ENABLE25 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Max (0x1UL) /*!< Max enumerator value of ENABLE25 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Disable (0x0UL) /*!< Override region n is disabled for master port 25               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Enable (0x1UL) /*!< Override region n is enabled for master port 25                 */

/* ENABLE26 @Bit 26 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Pos (26UL) /*!< Position of ENABLE26 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE26_Pos) /*!< Bit mask of ENABLE26 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Min (0x0UL) /*!< Min enumerator value of ENABLE26 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Max (0x1UL) /*!< Max enumerator value of ENABLE26 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Disable (0x0UL) /*!< Override region n is disabled for master port 26               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Enable (0x1UL) /*!< Override region n is enabled for master port 26                 */

/* ENABLE27 @Bit 27 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Pos (27UL) /*!< Position of ENABLE27 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE27_Pos) /*!< Bit mask of ENABLE27 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Min (0x0UL) /*!< Min enumerator value of ENABLE27 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Max (0x1UL) /*!< Max enumerator value of ENABLE27 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Disable (0x0UL) /*!< Override region n is disabled for master port 27               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Enable (0x1UL) /*!< Override region n is enabled for master port 27                 */

/* ENABLE28 @Bit 28 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Pos (28UL) /*!< Position of ENABLE28 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE28_Pos) /*!< Bit mask of ENABLE28 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Min (0x0UL) /*!< Min enumerator value of ENABLE28 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Max (0x1UL) /*!< Max enumerator value of ENABLE28 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Disable (0x0UL) /*!< Override region n is disabled for master port 28               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Enable (0x1UL) /*!< Override region n is enabled for master port 28                 */

/* ENABLE29 @Bit 29 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Pos (29UL) /*!< Position of ENABLE29 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE29_Pos) /*!< Bit mask of ENABLE29 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Min (0x0UL) /*!< Min enumerator value of ENABLE29 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Max (0x1UL) /*!< Max enumerator value of ENABLE29 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Disable (0x0UL) /*!< Override region n is disabled for master port 29               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Enable (0x1UL) /*!< Override region n is enabled for master port 29                 */

/* ENABLE30 @Bit 30 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Pos (30UL) /*!< Position of ENABLE30 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE30_Pos) /*!< Bit mask of ENABLE30 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Min (0x0UL) /*!< Min enumerator value of ENABLE30 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Max (0x1UL) /*!< Max enumerator value of ENABLE30 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Disable (0x0UL) /*!< Override region n is disabled for master port 30               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Enable (0x1UL) /*!< Override region n is enabled for master port 30                 */

/* ENABLE31 @Bit 31 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Pos (31UL) /*!< Position of ENABLE31 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE31_Pos) /*!< Bit mask of ENABLE31 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Min (0x0UL) /*!< Min enumerator value of ENABLE31 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Max (0x1UL) /*!< Max enumerator value of ENABLE31 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Disable (0x0UL) /*!< Override region n is disabled for master port 31               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Enable (0x1UL) /*!< Override region n is enabled for master port 31                 */


/* ======================================================= Struct MPC ======================================================== */
/**
  * @brief Memory Privilege Controller
  */
  typedef struct {                                   /*!< MPC Structure                                                        */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_MEMACCERR;                 /*!< (@ 0x00000100) Memory Access Error event                             */
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED2[61];
    __IOM NRF_MPC_MEMACCERR_Type MEMACCERR;          /*!< (@ 0x00000400) Memory Access Error status registers                  */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_MPC_GLOBALSLAVE_Type GLOBALSLAVE;      /*!< (@ 0x00000410) Global slave master port connection information       */
    __IOM uint32_t EXTENDCLKREQ;                     /*!< (@ 0x00000418) Extend clock request configuration                    */
    __IM uint32_t RESERVED4;
    __IOM NRF_MPC_RTCHOKE_Type RTCHOKE;              /*!< (@ 0x00000420) Real time choke configuration for AXI master port     */
    __IM uint32_t RESERVED5[64];
    __IOM NRF_MPC_REGION_Type REGION[32];            /*!< (@ 0x00000600) Memory region to slave decoding table                 */
    __IOM NRF_MPC_OVERRIDE_Type OVERRIDE[40];        /*!< (@ 0x00000800) Special privilege tables                              */
  } NRF_MPC_Type;                                    /*!< Size = 3328 (0xD00)                                                  */

/* MPC_EVENTS_MEMACCERR: Memory Access Error event */
  #define MPC_EVENTS_MEMACCERR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MEMACCERR register.                        */

/* EVENTS_MEMACCERR @Bit 0 : Memory Access Error event */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Pos (0UL) /*!< Position of EVENTS_MEMACCERR field.                             */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Msk (0x1UL << MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Pos) /*!< Bit mask of
                                                                            EVENTS_MEMACCERR field.*/
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Min (0x0UL) /*!< Min enumerator value of EVENTS_MEMACCERR field.               */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Max (0x1UL) /*!< Max enumerator value of EVENTS_MEMACCERR field.               */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Generated (0x1UL) /*!< Event generated                                         */


/* MPC_INTEN: Enable or disable interrupt */
  #define MPC_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* MEMACCERR @Bit 0 : Enable or disable interrupt for event MEMACCERR */
  #define MPC_INTEN_MEMACCERR_Pos (0UL)              /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTEN_MEMACCERR_Msk (0x1UL << MPC_INTEN_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                         */
  #define MPC_INTEN_MEMACCERR_Min (0x0UL)            /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTEN_MEMACCERR_Max (0x1UL)            /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTEN_MEMACCERR_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MPC_INTEN_MEMACCERR_Enabled (0x1UL)        /*!< Enable                                                               */


/* MPC_INTENSET: Enable interrupt */
  #define MPC_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* MEMACCERR @Bit 0 : Write '1' to enable interrupt for event MEMACCERR */
  #define MPC_INTENSET_MEMACCERR_Pos (0UL)           /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTENSET_MEMACCERR_Msk (0x1UL << MPC_INTENSET_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                   */
  #define MPC_INTENSET_MEMACCERR_Min (0x0UL)         /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTENSET_MEMACCERR_Max (0x1UL)         /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTENSET_MEMACCERR_Set (0x1UL)         /*!< Enable                                                               */
  #define MPC_INTENSET_MEMACCERR_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MPC_INTENSET_MEMACCERR_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* MPC_INTENCLR: Disable interrupt */
  #define MPC_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* MEMACCERR @Bit 0 : Write '1' to disable interrupt for event MEMACCERR */
  #define MPC_INTENCLR_MEMACCERR_Pos (0UL)           /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTENCLR_MEMACCERR_Msk (0x1UL << MPC_INTENCLR_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                   */
  #define MPC_INTENCLR_MEMACCERR_Min (0x0UL)         /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTENCLR_MEMACCERR_Max (0x1UL)         /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTENCLR_MEMACCERR_Clear (0x1UL)       /*!< Disable                                                              */
  #define MPC_INTENCLR_MEMACCERR_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MPC_INTENCLR_MEMACCERR_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* MPC_EXTENDCLKREQ: Extend clock request configuration */
  #define MPC_EXTENDCLKREQ_ResetValue (0x00000003UL) /*!< Reset value of EXTENDCLKREQ register.                                */

