NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_TRIM_START_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_TRIM_START_KEY_Msk (0xFFFFUL << MRAMC_TRIM_START_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_TRIM_START_KEY_Min (0x0UL)           /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_TRIM_START_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_TRIM_START_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_TRIM_START_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


/* MRAMC_TRIM_READY: Status of shifting the MRAM trim configuration data. */
  #define MRAMC_TRIM_READY_ResetValue (0x00000001UL) /*!< Reset value of READY register.                                       */

/* READY @Bit 0 : Shifting the MRAM trim configuration data is in progress or not. */
  #define MRAMC_TRIM_READY_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define MRAMC_TRIM_READY_READY_Msk (0x1UL << MRAMC_TRIM_READY_READY_Pos) /*!< Bit mask of READY field.                       */
  #define MRAMC_TRIM_READY_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_TRIM_READY_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_TRIM_READY_READY_Busy (0x0UL)        /*!< Shifting the MRAM trim configuration data is in progress.            */
  #define MRAMC_TRIM_READY_READY_Ready (0x1UL)       /*!< Ready for shifting the next MRAM trim configuration data.            */


/* MRAMC_TRIM_DONE: This register is used to indicate to the MRAMC that the whole MRAM trim configuration data write is
                     completed. */

  #define MRAMC_TRIM_DONE_ResetValue (0x00000000UL)  /*!< Reset value of DONE register.                                        */

/* TRIMCOMPLETED @Bits 0..31 : Trim configuration is completed. */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Pos (0UL)    /*!< Position of TRIMCOMPLETED field.                                     */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Msk (0xFFFFFFFFUL << MRAMC_TRIM_DONE_TRIMCOMPLETED_Pos) /*!< Bit mask of TRIMCOMPLETED
                                                                            field.*/
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Min (0x0UL)  /*!< Min enumerator value of TRIMCOMPLETED field.                         */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_Max (0xA66DA66DUL) /*!< Max enumerator value of TRIMCOMPLETED field.                   */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimUnknown (0x00000000UL) /*!< Read: Trim configuration is unknown                    */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimCompleted (0x00000001UL) /*!< Read: Trim configuration data write is completed.    */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_TrimComplete (0xA66DA66DUL) /*!< Write: Trim configuration data write is complete.     */
  #define MRAMC_TRIM_DONE_TRIMCOMPLETED_NoOperation (0x00000000UL) /*!< Write ignored for all other values than 0xA66DA66D.    */



/* ================================================= Struct MRAMC_CONFIGNVR ================================================== */
/**
  * @brief CONFIGNVR [MRAMC_CONFIGNVR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PAGE[4];                           /*!< (@ 0x00000000) Configuration register for NVR page n                 */
} NRF_MRAMC_CONFIGNVR_Type;                          /*!< Size = 16 (0x010)                                                    */

/* MRAMC_CONFIGNVR_PAGE: Configuration register for NVR page n */
  #define MRAMC_CONFIGNVR_PAGE_MaxCount (4UL)        /*!< Max size of PAGE[4] array.                                           */
  #define MRAMC_CONFIGNVR_PAGE_MaxIndex (3UL)        /*!< Max index of PAGE[4] array.                                          */
  #define MRAMC_CONFIGNVR_PAGE_MinIndex (0UL)        /*!< Min index of PAGE[4] array.                                          */
  #define MRAMC_CONFIGNVR_PAGE_ResetValue (0xFFC00000UL) /*!< Reset value of PAGE[4] register.                                 */

/* WEN @Bits 0..1 : Write enable. */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Pos (0UL)         /*!< Position of WEN field.                                               */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Msk (0x3UL << MRAMC_CONFIGNVR_PAGE_WEN_Pos) /*!< Bit mask of WEN field.                     */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Min (0x0UL)       /*!< Min enumerator value of WEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_WEN_Max (0x2UL)       /*!< Max enumerator value of WEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_WEN_DisableWrite (0x0UL) /*!< Write is disabled                                                 */
  #define MRAMC_CONFIGNVR_PAGE_WEN_EnableNormalWrite (0x1UL) /*!< Normal write is enabled                                      */
  #define MRAMC_CONFIGNVR_PAGE_WEN_EnableDirectWrite (0x2UL) /*!< Direct write is enabled                                      */

/* EEN @Bits 4..5 : Erase enable. */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Pos (4UL)         /*!< Position of EEN field.                                               */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Msk (0x3UL << MRAMC_CONFIGNVR_PAGE_EEN_Pos) /*!< Bit mask of EEN field.                     */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Min (0x0UL)       /*!< Min enumerator value of EEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_EEN_Max (0x1UL)       /*!< Max enumerator value of EEN field.                                   */
  #define MRAMC_CONFIGNVR_PAGE_EEN_DisableErase (0x0UL) /*!< Erase is disabled but read is allowed                             */
  #define MRAMC_CONFIGNVR_PAGE_EEN_EnablePageErase (0x1UL) /*!< Erase page and read are allowed                                */

