NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* LOCK @Bit 16 : Enables the lock for this register. */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_Pos (16UL)       /*!< Position of LOCK field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_LockDisabled (0x0UL) /*!< Lock is disabled                                                 */
  #define MRAMC_CONFIGNVR_PAGE_LOCK_LockEnabled (0x1UL) /*!< Lock is enabled                                                   */

/* LREN @Bit 22 : Enable read access to the lower range of the NVR page, as defined by LRSIZE */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Pos (22UL)       /*!< Position of LREN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_LREN_Pos) /*!< Bit mask of LREN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Min (0x0UL)      /*!< Min enumerator value of LREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Max (0x1UL)      /*!< Max enumerator value of LREN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Disabled (0x0UL) /*!< Read is disabled.                                                    */
  #define MRAMC_CONFIGNVR_PAGE_LREN_Enabled (0x1UL)  /*!< Read is enabled                                                      */

/* LWEN @Bit 23 : Enable write access to the lower range of the NVR page, as defined by LWSIZE */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Pos (23UL)       /*!< Position of LWEN field.                                              */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Msk (0x1UL << MRAMC_CONFIGNVR_PAGE_LWEN_Pos) /*!< Bit mask of LWEN field.                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Min (0x0UL)      /*!< Min enumerator value of LWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Max (0x1UL)      /*!< Max enumerator value of LWEN field.                                  */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Disabled (0x0UL) /*!< Write is disabled.                                                   */
  #define MRAMC_CONFIGNVR_PAGE_LWEN_Enabled (0x1UL)  /*!< Write is enabled                                                     */

/* LRSIZE @Bits 24..27 : Size of part of the lower 2KB memory in the NVR page to disable read access */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Pos (24UL)     /*!< Position of LRSIZE field.                                            */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Msk (0xFUL << MRAMC_CONFIGNVR_PAGE_LRSIZE_Pos) /*!< Bit mask of LRSIZE field.            */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Min (0x0UL)    /*!< Min value of LRSIZE field.                                           */
  #define MRAMC_CONFIGNVR_PAGE_LRSIZE_Max (0xFUL)    /*!< Max size of LRSIZE field.                                            */

/* LWSIZE @Bits 28..31 : Size of part of the lower 2KB memory in the NVR page to disable write access */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Pos (28UL)     /*!< Position of LWSIZE field.                                            */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Msk (0xFUL << MRAMC_CONFIGNVR_PAGE_LWSIZE_Pos) /*!< Bit mask of LWSIZE field.            */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Min (0x0UL)    /*!< Min value of LWSIZE field.                                           */
  #define MRAMC_CONFIGNVR_PAGE_LWSIZE_Max (0xFUL)    /*!< Max size of LWSIZE field.                                            */


/* ====================================================== Struct MRAMC ======================================================= */
/**
  * @brief MRAM controller
  */
  typedef struct {                                   /*!< MRAMC Structure                                                      */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Current operation is completed                        */
    __IOM uint32_t EVENTS_READYNEXT;                 /*!< (@ 0x00000104) Ready to accept a new write operation                 */
    __IOM uint32_t EVENTS_ECCERROR;                  /*!< (@ 0x00000108) ECC error detected but not corrected.                 */
    __IM uint32_t RESERVED1;
    __IOM uint32_t EVENTS_TRIMCONFIGREQ;             /*!< (@ 0x00000110) MRAM trim configuration request. The MRAMC is ready for
                                                                         the MRAM trim configuration.*/
    __IM uint32_t RESERVED2[123];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED3[60];
    __IM uint32_t READY;                             /*!< (@ 0x00000400) MRAMC current operation status.                       */
    __IM uint32_t READYNEXT;                         /*!< (@ 0x00000404) Ready next flag.                                      */
    __IM uint32_t RESERVED4[2];
    __IOM NRF_MRAMC_ECC_Type ECC;                    /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED5[57];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000500) Configuration register                                */
    __IOM uint32_t AUTOREADMODE;                     /*!< (@ 0x00000504) Automatically disables the write and erases on timeout
                                                                         and enters into read mode.*/
    __IOM uint32_t WAITSTATES;                       /*!< (@ 0x00000508) Waitstates for MRAM read access                       */
    __IOM uint32_t READYNEXTTIMEOUT;                 /*!< (@ 0x0000050C) Preload timeout value for waiting for a next write    */
    __IOM NRF_MRAMC_LOWAVGCURR_Type LOWAVGCURR;      /*!< (@ 0x00000510) (unspecified)                                         */
    __IM uint32_t RESERVED6;
    __IOM NRF_MRAMC_POWER_Type POWER;                /*!< (@ 0x00000520) (unspecified)                                         */
    __IM uint32_t RESERVED7[2];
    __IOM NRF_MRAMC_TRIM_Type TRIM;                  /*!< (@ 0x00000540) (unspecified)                                         */
    __IM uint32_t RESERVED8[10];
    __IOM NRF_MRAMC_CONFIGNVR_Type CONFIGNVR;        /*!< (@ 0x00000580) (unspecified)                                         */
  } NRF_MRAMC_Type;                                  /*!< Size = 1424 (0x590)                                                  */

/* MRAMC_EVENTS_READY: Current operation is completed */
  #define MRAMC_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                              */

