NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* EVENTS_READY @Bit 0 : Current operation is completed */
  #define MRAMC_EVENTS_READY_EVENTS_READY_Pos (0UL)  /*!< Position of EVENTS_READY field.                                      */
  #define MRAMC_EVENTS_READY_EVENTS_READY_Msk (0x1UL << MRAMC_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY
                                                                            field.*/
  #define MRAMC_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                         */
  #define MRAMC_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                         */
  #define MRAMC_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define MRAMC_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                               */


/* MRAMC_EVENTS_READYNEXT: Ready to accept a new write operation */
  #define MRAMC_EVENTS_READYNEXT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READYNEXT register.                      */

/* EVENTS_READYNEXT @Bit 0 : Ready to accept a new write operation */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Pos (0UL) /*!< Position of EVENTS_READYNEXT field.                           */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Msk (0x1UL << MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Pos) /*!< Bit mask of
                                                                            EVENTS_READYNEXT field.*/
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Min (0x0UL) /*!< Min enumerator value of EVENTS_READYNEXT field.             */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Max (0x1UL) /*!< Max enumerator value of EVENTS_READYNEXT field.             */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define MRAMC_EVENTS_READYNEXT_EVENTS_READYNEXT_Generated (0x1UL) /*!< Event generated                                       */


/* MRAMC_EVENTS_ECCERROR: ECC error detected but not corrected. */
  #define MRAMC_EVENTS_ECCERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ECCERROR register.                        */

/* EVENTS_ECCERROR @Bit 0 : ECC error detected but not corrected. */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Pos (0UL) /*!< Position of EVENTS_ECCERROR field.                              */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Msk (0x1UL << MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_ECCERROR field.*/
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ECCERROR field.                */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ECCERROR field.                */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Generated (0x1UL) /*!< Event generated                                         */


/* MRAMC_EVENTS_TRIMCONFIGREQ: MRAM trim configuration request. The MRAMC is ready for the MRAM trim configuration. */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIMCONFIGREQ register.              */

/* EVENTS_TRIMCONFIGREQ @Bit 0 : MRAM trim configuration request. The MRAMC is ready for the MRAM trim configuration. */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Pos (0UL) /*!< Position of EVENTS_TRIMCONFIGREQ field.               */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Msk (0x1UL << MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Pos)
                                                                            /*!< Bit mask of EVENTS_TRIMCONFIGREQ field.*/
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIMCONFIGREQ field. */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIMCONFIGREQ field. */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define MRAMC_EVENTS_TRIMCONFIGREQ_EVENTS_TRIMCONFIGREQ_Generated (0x1UL) /*!< Event generated                               */


/* MRAMC_INTEN: Enable or disable interrupt */
  #define MRAMC_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define MRAMC_INTEN_READY_Pos (0UL)                /*!< Position of READY field.                                             */
  #define MRAMC_INTEN_READY_Msk (0x1UL << MRAMC_INTEN_READY_Pos) /*!< Bit mask of READY field.                                 */
  #define MRAMC_INTEN_READY_Min (0x0UL)              /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_INTEN_READY_Max (0x1UL)              /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_INTEN_READY_Disabled (0x0UL)         /*!< Disable                                                              */
  #define MRAMC_INTEN_READY_Enabled (0x1UL)          /*!< Enable                                                               */

/* READYNEXT @Bit 1 : Enable or disable interrupt for event READYNEXT */
  #define MRAMC_INTEN_READYNEXT_Pos (1UL)            /*!< Position of READYNEXT field.                                         */
  #define MRAMC_INTEN_READYNEXT_Msk (0x1UL << MRAMC_INTEN_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                     */
  #define MRAMC_INTEN_READYNEXT_Min (0x0UL)          /*!< Min enumerator value of READYNEXT field.                             */
  #define MRAMC_INTEN_READYNEXT_Max (0x1UL)          /*!< Max enumerator value of READYNEXT field.                             */
  #define MRAMC_INTEN_READYNEXT_Disabled (0x0UL)     /*!< Disable                                                              */
  #define MRAMC_INTEN_READYNEXT_Enabled (0x1UL)      /*!< Enable                                                               */

/* ECCERROR @Bit 2 : Enable or disable interrupt for event ECCERROR */
  #define MRAMC_INTEN_ECCERROR_Pos (2UL)             /*!< Position of ECCERROR field.                                          */
  #define MRAMC_INTEN_ECCERROR_Msk (0x1UL << MRAMC_INTEN_ECCERROR_Pos) /*!< Bit mask of ECCERROR field.                        */
  #define MRAMC_INTEN_ECCERROR_Min (0x0UL)           /*!< Min enumerator value of ECCERROR field.                              */
  #define MRAMC_INTEN_ECCERROR_Max (0x1UL)           /*!< Max enumerator value of ECCERROR field.                              */
  #define MRAMC_INTEN_ECCERROR_Disabled (0x0UL)      /*!< Disable                                                              */
  #define MRAMC_INTEN_ECCERROR_Enabled (0x1UL)       /*!< Enable                                                               */

/* TRIMCONFIGREQ @Bit 4 : Enable or disable interrupt for event TRIMCONFIGREQ */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Pos (4UL)        /*!< Position of TRIMCONFIGREQ field.                                     */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Msk (0x1UL << MRAMC_INTEN_TRIMCONFIGREQ_Pos) /*!< Bit mask of TRIMCONFIGREQ field.         */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Min (0x0UL)      /*!< Min enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Max (0x1UL)      /*!< Max enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Disabled (0x0UL) /*!< Disable                                                              */
  #define MRAMC_INTEN_TRIMCONFIGREQ_Enabled (0x1UL)  /*!< Enable                                                               */


