NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MRAMC_INTENSET: Enable interrupt */
  #define MRAMC_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define MRAMC_INTENSET_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define MRAMC_INTENSET_READY_Msk (0x1UL << MRAMC_INTENSET_READY_Pos) /*!< Bit mask of READY field.                           */
  #define MRAMC_INTENSET_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_INTENSET_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_INTENSET_READY_Set (0x1UL)           /*!< Enable                                                               */
  #define MRAMC_INTENSET_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define MRAMC_INTENSET_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 1 : Write '1' to enable interrupt for event READYNEXT */
  #define MRAMC_INTENSET_READYNEXT_Pos (1UL)         /*!< Position of READYNEXT field.                                         */
  #define MRAMC_INTENSET_READYNEXT_Msk (0x1UL << MRAMC_INTENSET_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define MRAMC_INTENSET_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define MRAMC_INTENSET_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define MRAMC_INTENSET_READYNEXT_Set (0x1UL)       /*!< Enable                                                               */
  #define MRAMC_INTENSET_READYNEXT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MRAMC_INTENSET_READYNEXT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ECCERROR @Bit 2 : Write '1' to enable interrupt for event ECCERROR */
  #define MRAMC_INTENSET_ECCERROR_Pos (2UL)          /*!< Position of ECCERROR field.                                          */
  #define MRAMC_INTENSET_ECCERROR_Msk (0x1UL << MRAMC_INTENSET_ECCERROR_Pos) /*!< Bit mask of ECCERROR field.                  */
  #define MRAMC_INTENSET_ECCERROR_Min (0x0UL)        /*!< Min enumerator value of ECCERROR field.                              */
  #define MRAMC_INTENSET_ECCERROR_Max (0x1UL)        /*!< Max enumerator value of ECCERROR field.                              */
  #define MRAMC_INTENSET_ECCERROR_Set (0x1UL)        /*!< Enable                                                               */
  #define MRAMC_INTENSET_ECCERROR_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define MRAMC_INTENSET_ECCERROR_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* TRIMCONFIGREQ @Bit 4 : Write '1' to enable interrupt for event TRIMCONFIGREQ */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Pos (4UL)     /*!< Position of TRIMCONFIGREQ field.                                     */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Msk (0x1UL << MRAMC_INTENSET_TRIMCONFIGREQ_Pos) /*!< Bit mask of TRIMCONFIGREQ field.   */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Min (0x0UL)   /*!< Min enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Max (0x1UL)   /*!< Max enumerator value of TRIMCONFIGREQ field.                         */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Set (0x1UL)   /*!< Enable                                                               */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define MRAMC_INTENSET_TRIMCONFIGREQ_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* MRAMC_INTENCLR: Disable interrupt */
  #define MRAMC_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define MRAMC_INTENCLR_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define MRAMC_INTENCLR_READY_Msk (0x1UL << MRAMC_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                           */
  #define MRAMC_INTENCLR_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define MRAMC_INTENCLR_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define MRAMC_INTENCLR_READY_Clear (0x1UL)         /*!< Disable                                                              */
  #define MRAMC_INTENCLR_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define MRAMC_INTENCLR_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 1 : Write '1' to disable interrupt for event READYNEXT */
  #define MRAMC_INTENCLR_READYNEXT_Pos (1UL)         /*!< Position of READYNEXT field.                                         */
  #define MRAMC_INTENCLR_READYNEXT_Msk (0x1UL << MRAMC_INTENCLR_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define MRAMC_INTENCLR_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define MRAMC_INTENCLR_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define MRAMC_INTENCLR_READYNEXT_Clear (0x1UL)     /*!< Disable                                                              */
  #define MRAMC_INTENCLR_READYNEXT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define MRAMC_INTENCLR_READYNEXT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

