NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* WEN @Bits 0..1 : Write enable. */
  #define MRAMC_CONFIG_WEN_Pos (0UL)                 /*!< Position of WEN field.                                               */
  #define MRAMC_CONFIG_WEN_Msk (0x3UL << MRAMC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field.                                     */
  #define MRAMC_CONFIG_WEN_Min (0x0UL)               /*!< Min enumerator value of WEN field.                                   */
  #define MRAMC_CONFIG_WEN_Max (0x2UL)               /*!< Max enumerator value of WEN field.                                   */
  #define MRAMC_CONFIG_WEN_DisableWrite (0x0UL)      /*!< Write is disabled                                                    */
  #define MRAMC_CONFIG_WEN_EnableNormalWrite (0x1UL) /*!< Normal write is enabled                                              */
  #define MRAMC_CONFIG_WEN_EnableDirectWrite (0x2UL) /*!< Direct write is enabled                                              */

/* EEN @Bits 4..5 : Erase enable. */
  #define MRAMC_CONFIG_EEN_Pos (4UL)                 /*!< Position of EEN field.                                               */
  #define MRAMC_CONFIG_EEN_Msk (0x3UL << MRAMC_CONFIG_EEN_Pos) /*!< Bit mask of EEN field.                                     */
  #define MRAMC_CONFIG_EEN_Min (0x0UL)               /*!< Min enumerator value of EEN field.                                   */
  #define MRAMC_CONFIG_EEN_Max (0x1UL)               /*!< Max enumerator value of EEN field.                                   */
  #define MRAMC_CONFIG_EEN_DisableErase (0x0UL)      /*!< Erase is disabled but read is allowed                                */
  #define MRAMC_CONFIG_EEN_EnablePageErase (0x1UL)   /*!< Erase page and read are allowed                                      */


/* MRAMC_AUTOREADMODE: Automatically disables the write and erases on timeout and enters into read mode. */
  #define MRAMC_AUTOREADMODE_ResetValue (0x00000000UL) /*!< Reset value of AUTOREADMODE register.                              */

/* VALUE @Bits 0..11 : Timeout value to disable write and erase. */
  #define MRAMC_AUTOREADMODE_VALUE_Pos (0UL)         /*!< Position of VALUE field.                                             */
  #define MRAMC_AUTOREADMODE_VALUE_Msk (0xFFFUL << MRAMC_AUTOREADMODE_VALUE_Pos) /*!< Bit mask of VALUE field.                 */
  #define MRAMC_AUTOREADMODE_VALUE_Min (0x000UL)     /*!< Min value of VALUE field.                                            */
  #define MRAMC_AUTOREADMODE_VALUE_Max (0xFFFUL)     /*!< Max size of VALUE field.                                             */


/* MRAMC_WAITSTATES: Waitstates for MRAM read access */
  #define MRAMC_WAITSTATES_ResetValue (0x00000000UL) /*!< Reset value of WAITSTATES register.                                  */

/* WAITSTATENUM @Bits 0..4 : Register to read the current number of waitstate for the MRAM access and set a new value */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Pos (0UL)    /*!< Position of WAITSTATENUM field.                                      */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Msk (0x1FUL << MRAMC_WAITSTATES_WAITSTATENUM_Pos) /*!< Bit mask of WAITSTATENUM field. */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Min (0x03UL) /*!< Min value of WAITSTATENUM field.                                     */
  #define MRAMC_WAITSTATES_WAITSTATENUM_Max (0x1FUL) /*!< Max size of WAITSTATENUM field.                                      */

/* KEY @Bits 16..31 : Key to enable the writing to this register. */
  #define MRAMC_WAITSTATES_KEY_Pos (16UL)            /*!< Position of KEY field.                                               */
  #define MRAMC_WAITSTATES_KEY_Msk (0xFFFFUL << MRAMC_WAITSTATES_KEY_Pos) /*!< Bit mask of KEY field.                          */
  #define MRAMC_WAITSTATES_KEY_Min (0x0UL)           /*!< Min enumerator value of KEY field.                                   */
  #define MRAMC_WAITSTATES_KEY_Max (0xA66DUL)        /*!< Max enumerator value of KEY field.                                   */
  #define MRAMC_WAITSTATES_KEY_Disable (0x0000UL)    /*!< Disable the writing to this register                                 */
  #define MRAMC_WAITSTATES_KEY_Enable (0xA66DUL)     /*!< Enable the writing to this register                                  */


/* MRAMC_READYNEXTTIMEOUT: Preload timeout value for waiting for a next write */
  #define MRAMC_READYNEXTTIMEOUT_ResetValue (0x00000000UL) /*!< Reset value of READYNEXTTIMEOUT register.                      */

/* VALUE @Bits 0..11 : Preload value */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Pos (0UL)     /*!< Position of VALUE field.                                             */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Msk (0xFFFUL << MRAMC_READYNEXTTIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE field.         */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Min (0x000UL) /*!< Min value of VALUE field.                                            */
  #define MRAMC_READYNEXTTIMEOUT_VALUE_Max (0xFFFUL) /*!< Max size of VALUE field.                                             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MUTEX                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct MUTEX ======================================================= */
/**
  * @brief MUTEX
  */
  typedef struct {                                   /*!< MUTEX Structure                                                      */
    __IM uint32_t RESERVED[256];
    __IOM uint32_t MUTEX[32];                        /*!< (@ 0x00000400) Mutex register                                        */
  } NRF_MUTEX_Type;                                  /*!< Size = 1152 (0x480)                                                  */

