NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* MVDMA_EVENTS_SINK_SELECTJOBDONE: Event indicating that a job on the Sink channel with EVENT_ENABLE active has been processed.
                                     */

  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.                */

/* SELECTJOBDONE @Bit 0 : Event indicating that a job on the Sink channel with EVENT_ENABLE active has been processed. */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Pos (0UL) /*!< Position of SELECTJOBDONE field.                        */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Msk (0x1UL << MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Pos) /*!<
                                                                            Bit mask of SELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Min (0x0UL) /*!< Min enumerator value of SELECTJOBDONE field.          */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Max (0x1UL) /*!< Max enumerator value of SELECTJOBDONE field.          */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Generated (0x1UL) /*!< Event generated                                 */



/* =============================================== Struct MVDMA_PUBLISH_SOURCE =============================================== */
/**
  * @brief PUBLISH_SOURCE [MVDMA_PUBLISH_SOURCE] Publish configuration for events
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000004) Publish configuration for event SOURCE.SELECTJOBDONE  */
} NRF_MVDMA_PUBLISH_SOURCE_Type;                     /*!< Size = 8 (0x008)                                                     */

/* MVDMA_PUBLISH_SOURCE_SELECTJOBDONE: Publish configuration for event SOURCE.SELECTJOBDONE */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.             */

/* CHIDX @Bits 0..7 : DPPI channel that event SOURCE.SELECTJOBDONE will publish to */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                     */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                 */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                  */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Pos (31UL) /*!< Position of EN field.                                          */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Msk (0x1UL << MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                             */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                             */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                       */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                         */



/* ================================================ Struct MVDMA_PUBLISH_SINK ================================================ */
/**
  * @brief PUBLISH_SINK [MVDMA_PUBLISH_SINK] Publish configuration for events
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000004) Publish configuration for event SINK.SELECTJOBDONE    */
} NRF_MVDMA_PUBLISH_SINK_Type;                       /*!< Size = 8 (0x008)                                                     */

/* MVDMA_PUBLISH_SINK_SELECTJOBDONE: Publish configuration for event SINK.SELECTJOBDONE */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_ResetValue (0x00000000UL) /*!< Reset value of SELECTJOBDONE register.               */

/* CHIDX @Bits 0..7 : DPPI channel that event SINK.SELECTJOBDONE will publish to */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                       */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                   */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                    */

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Pos (31UL) /*!< Position of EN field.                                            */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Msk (0x1UL << MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Pos) /*!< Bit mask of EN field.*/
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                               */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                               */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Disabled (0x0UL) /*!< Disable publishing                                         */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Enabled (0x1UL) /*!< Enable publishing                                           */



/* =================================================== Struct MVDMA_STATUS =================================================== */
/**
  * @brief STATUS [MVDMA_STATUS] MVDMA status registers.
  */
typedef struct {
  __IM  uint32_t  CRCRESULT;                         /*!< (@ 0x00000000) CRC checksum calculation result                       */
  __IM  uint32_t  FIFO;                              /*!< (@ 0x00000004) Status of intermediate fifo: empty, not empty and full
                                                                         information available.*/
  __IM  uint32_t  ACTIVE;                            /*!< (@ 0x00000008) Status of DMA transfer.                               */
} NRF_MVDMA_STATUS_Type;                             /*!< Size = 12 (0x00C)                                                    */

/* MVDMA_STATUS_CRCRESULT: CRC checksum calculation result */
  #define MVDMA_STATUS_CRCRESULT_ResetValue (0x00000000UL) /*!< Reset value of CRCRESULT register.                             */

/* CRC @Bits 0..31 : Result */
  #define MVDMA_STATUS_CRCRESULT_CRC_Pos (0UL)       /*!< Position of CRC field.                                               */
  #define MVDMA_STATUS_CRCRESULT_CRC_Msk (0xFFFFFFFFUL << MVDMA_STATUS_CRCRESULT_CRC_Pos) /*!< Bit mask of CRC field.          */


/* MVDMA_STATUS_FIFO: Status of intermediate fifo: empty, not empty and full information available. */
  #define MVDMA_STATUS_FIFO_ResetValue (0x00000000UL) /*!< Reset value of FIFO register.                                       */

/* FIFOSTATUS @Bits 0..1 : Result */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Pos (0UL)     /*!< Position of FIFOSTATUS field.                                        */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Msk (0x3UL << MVDMA_STATUS_FIFO_FIFOSTATUS_Pos) /*!< Bit mask of FIFOSTATUS field.      */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Min (0x0UL)   /*!< Min enumerator value of FIFOSTATUS field.                            */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Max (0x2UL)   /*!< Max enumerator value of FIFOSTATUS field.                            */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Empty (0x0UL) /*!< Fifo is empty.                                                       */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_NotEmpty (0x1UL) /*!< Fifo contains data.                                               */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Full (0x2UL)  /*!< Fifo is full.                                                        */


