NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task SENSE will subscribe to */
  #define NFCT_SUBSCRIBE_SENSE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_SENSE_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_SENSE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define NFCT_SUBSCRIBE_SENSE_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_SENSE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_SENSE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_SENSE_EN_Msk (0x1UL << NFCT_SUBSCRIBE_SENSE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define NFCT_SUBSCRIBE_SENSE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_SENSE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_SENSE_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_SENSE_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_STARTTX: Subscribe configuration for task STARTTX */
  #define NFCT_SUBSCRIBE_STARTTX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STARTTX register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task STARTTX will subscribe to */
  #define NFCT_SUBSCRIBE_STARTTX_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_STARTTX_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_STARTTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define NFCT_SUBSCRIBE_STARTTX_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_STARTTX_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Msk (0x1UL << NFCT_SUBSCRIBE_STARTTX_EN_Pos) /*!< Bit mask of EN field.                    */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_STARTTX_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_STOPTX: Subscribe configuration for task STOPTX */
  #define NFCT_SUBSCRIBE_STOPTX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOPTX register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that task STOPTX will subscribe to */
  #define NFCT_SUBSCRIBE_STOPTX_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_STOPTX_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_STOPTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define NFCT_SUBSCRIBE_STOPTX_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_STOPTX_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Msk (0x1UL << NFCT_SUBSCRIBE_STOPTX_EN_Pos) /*!< Bit mask of EN field.                      */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_STOPTX_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* NFCT_SUBSCRIBE_ENABLERXDATA: Subscribe configuration for task ENABLERXDATA */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_ENABLERXDATA register.           */

/* CHIDX @Bits 0..7 : DPPI channel that task ENABLERXDATA will subscribe to */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_ENABLERXDATA_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define NFCT_SUBSCRIBE_ENABLERXDATA_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_EN_Msk (0x1UL << NFCT_SUBSCRIBE_ENABLERXDATA_EN_Pos) /*!< Bit mask of EN field.          */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define NFCT_SUBSCRIBE_ENABLERXDATA_EN_Enabled (0x1UL) /*!< Enable subscription                                              */


/* NFCT_SUBSCRIBE_GOIDLE: Subscribe configuration for task GOIDLE */
  #define NFCT_SUBSCRIBE_GOIDLE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_GOIDLE register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that task GOIDLE will subscribe to */
  #define NFCT_SUBSCRIBE_GOIDLE_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_GOIDLE_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_GOIDLE_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define NFCT_SUBSCRIBE_GOIDLE_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_GOIDLE_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_GOIDLE_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_GOIDLE_EN_Msk (0x1UL << NFCT_SUBSCRIBE_GOIDLE_EN_Pos) /*!< Bit mask of EN field.                      */
  #define NFCT_SUBSCRIBE_GOIDLE_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_GOIDLE_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_GOIDLE_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_GOIDLE_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


