NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RXFRAMEEND @Bit 6 : Write '1' to enable interrupt for event RXFRAMEEND */
  #define NFCT_INTENSET_RXFRAMEEND_Pos (6UL)         /*!< Position of RXFRAMEEND field.                                        */
  #define NFCT_INTENSET_RXFRAMEEND_Msk (0x1UL << NFCT_INTENSET_RXFRAMEEND_Pos) /*!< Bit mask of RXFRAMEEND field.              */
  #define NFCT_INTENSET_RXFRAMEEND_Min (0x0UL)       /*!< Min enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTENSET_RXFRAMEEND_Max (0x1UL)       /*!< Max enumerator value of RXFRAMEEND field.                            */
  #define NFCT_INTENSET_RXFRAMEEND_Set (0x1UL)       /*!< Enable                                                               */
  #define NFCT_INTENSET_RXFRAMEEND_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_RXFRAMEEND_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ERROR @Bit 7 : Write '1' to enable interrupt for event ERROR */
  #define NFCT_INTENSET_ERROR_Pos (7UL)              /*!< Position of ERROR field.                                             */
  #define NFCT_INTENSET_ERROR_Msk (0x1UL << NFCT_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define NFCT_INTENSET_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define NFCT_INTENSET_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define NFCT_INTENSET_ERROR_Set (0x1UL)            /*!< Enable                                                               */
  #define NFCT_INTENSET_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RXERROR @Bit 10 : Write '1' to enable interrupt for event RXERROR */
  #define NFCT_INTENSET_RXERROR_Pos (10UL)           /*!< Position of RXERROR field.                                           */
  #define NFCT_INTENSET_RXERROR_Msk (0x1UL << NFCT_INTENSET_RXERROR_Pos) /*!< Bit mask of RXERROR field.                       */
  #define NFCT_INTENSET_RXERROR_Min (0x0UL)          /*!< Min enumerator value of RXERROR field.                               */
  #define NFCT_INTENSET_RXERROR_Max (0x1UL)          /*!< Max enumerator value of RXERROR field.                               */
  #define NFCT_INTENSET_RXERROR_Set (0x1UL)          /*!< Enable                                                               */
  #define NFCT_INTENSET_RXERROR_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_RXERROR_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ENDRX @Bit 11 : Write '1' to enable interrupt for event ENDRX */
  #define NFCT_INTENSET_ENDRX_Pos (11UL)             /*!< Position of ENDRX field.                                             */
  #define NFCT_INTENSET_ENDRX_Msk (0x1UL << NFCT_INTENSET_ENDRX_Pos) /*!< Bit mask of ENDRX field.                             */
  #define NFCT_INTENSET_ENDRX_Min (0x0UL)            /*!< Min enumerator value of ENDRX field.                                 */
  #define NFCT_INTENSET_ENDRX_Max (0x1UL)            /*!< Max enumerator value of ENDRX field.                                 */
  #define NFCT_INTENSET_ENDRX_Set (0x1UL)            /*!< Enable                                                               */
  #define NFCT_INTENSET_ENDRX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_ENDRX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* ENDTX @Bit 12 : Write '1' to enable interrupt for event ENDTX */
  #define NFCT_INTENSET_ENDTX_Pos (12UL)             /*!< Position of ENDTX field.                                             */
  #define NFCT_INTENSET_ENDTX_Msk (0x1UL << NFCT_INTENSET_ENDTX_Pos) /*!< Bit mask of ENDTX field.                             */
  #define NFCT_INTENSET_ENDTX_Min (0x0UL)            /*!< Min enumerator value of ENDTX field.                                 */
  #define NFCT_INTENSET_ENDTX_Max (0x1UL)            /*!< Max enumerator value of ENDTX field.                                 */
  #define NFCT_INTENSET_ENDTX_Set (0x1UL)            /*!< Enable                                                               */
  #define NFCT_INTENSET_ENDTX_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_ENDTX_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* AUTOCOLRESSTARTED @Bit 14 : Write '1' to enable interrupt for event AUTOCOLRESSTARTED */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Pos (14UL) /*!< Position of AUTOCOLRESSTARTED field.                                 */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Msk (0x1UL << NFCT_INTENSET_AUTOCOLRESSTARTED_Pos) /*!< Bit mask of AUTOCOLRESSTARTED
                                                                            field.*/
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Min (0x0UL) /*!< Min enumerator value of AUTOCOLRESSTARTED field.                    */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Max (0x1UL) /*!< Max enumerator value of AUTOCOLRESSTARTED field.                    */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Set (0x1UL) /*!< Enable                                                              */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                 */
  #define NFCT_INTENSET_AUTOCOLRESSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                   */

/* COLLISION @Bit 18 : Write '1' to enable interrupt for event COLLISION */
  #define NFCT_INTENSET_COLLISION_Pos (18UL)         /*!< Position of COLLISION field.                                         */
  #define NFCT_INTENSET_COLLISION_Msk (0x1UL << NFCT_INTENSET_COLLISION_Pos) /*!< Bit mask of COLLISION field.                 */
  #define NFCT_INTENSET_COLLISION_Min (0x0UL)        /*!< Min enumerator value of COLLISION field.                             */
  #define NFCT_INTENSET_COLLISION_Max (0x1UL)        /*!< Max enumerator value of COLLISION field.                             */
  #define NFCT_INTENSET_COLLISION_Set (0x1UL)        /*!< Enable                                                               */
  #define NFCT_INTENSET_COLLISION_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_COLLISION_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* SELECTED @Bit 19 : Write '1' to enable interrupt for event SELECTED */
  #define NFCT_INTENSET_SELECTED_Pos (19UL)          /*!< Position of SELECTED field.                                          */
  #define NFCT_INTENSET_SELECTED_Msk (0x1UL << NFCT_INTENSET_SELECTED_Pos) /*!< Bit mask of SELECTED field.                    */
  #define NFCT_INTENSET_SELECTED_Min (0x0UL)         /*!< Min enumerator value of SELECTED field.                              */
  #define NFCT_INTENSET_SELECTED_Max (0x1UL)         /*!< Max enumerator value of SELECTED field.                              */
  #define NFCT_INTENSET_SELECTED_Set (0x1UL)         /*!< Enable                                                               */
  #define NFCT_INTENSET_SELECTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_SELECTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

