NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define OTPC_INTEN_READY_Pos (0UL)                 /*!< Position of READY field.                                             */
  #define OTPC_INTEN_READY_Msk (0x1UL << OTPC_INTEN_READY_Pos) /*!< Bit mask of READY field.                                   */
  #define OTPC_INTEN_READY_Min (0x0UL)               /*!< Min enumerator value of READY field.                                 */
  #define OTPC_INTEN_READY_Max (0x1UL)               /*!< Max enumerator value of READY field.                                 */
  #define OTPC_INTEN_READY_Disabled (0x0UL)          /*!< Disable                                                              */
  #define OTPC_INTEN_READY_Enabled (0x1UL)           /*!< Enable                                                               */

/* READYNEXT @Bit 1 : Enable or disable interrupt for event READYNEXT */
  #define OTPC_INTEN_READYNEXT_Pos (1UL)             /*!< Position of READYNEXT field.                                         */
  #define OTPC_INTEN_READYNEXT_Msk (0x1UL << OTPC_INTEN_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                       */
  #define OTPC_INTEN_READYNEXT_Min (0x0UL)           /*!< Min enumerator value of READYNEXT field.                             */
  #define OTPC_INTEN_READYNEXT_Max (0x1UL)           /*!< Max enumerator value of READYNEXT field.                             */
  #define OTPC_INTEN_READYNEXT_Disabled (0x0UL)      /*!< Disable                                                              */
  #define OTPC_INTEN_READYNEXT_Enabled (0x1UL)       /*!< Enable                                                               */


/* OTPC_INTENSET: Enable interrupt */
  #define OTPC_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define OTPC_INTENSET_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define OTPC_INTENSET_READY_Msk (0x1UL << OTPC_INTENSET_READY_Pos) /*!< Bit mask of READY field.                             */
  #define OTPC_INTENSET_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define OTPC_INTENSET_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define OTPC_INTENSET_READY_Set (0x1UL)            /*!< Enable                                                               */
  #define OTPC_INTENSET_READY_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define OTPC_INTENSET_READY_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 1 : Write '1' to enable interrupt for event READYNEXT */
  #define OTPC_INTENSET_READYNEXT_Pos (1UL)          /*!< Position of READYNEXT field.                                         */
  #define OTPC_INTENSET_READYNEXT_Msk (0x1UL << OTPC_INTENSET_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                 */
  #define OTPC_INTENSET_READYNEXT_Min (0x0UL)        /*!< Min enumerator value of READYNEXT field.                             */
  #define OTPC_INTENSET_READYNEXT_Max (0x1UL)        /*!< Max enumerator value of READYNEXT field.                             */
  #define OTPC_INTENSET_READYNEXT_Set (0x1UL)        /*!< Enable                                                               */
  #define OTPC_INTENSET_READYNEXT_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define OTPC_INTENSET_READYNEXT_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* OTPC_INTENCLR: Disable interrupt */
  #define OTPC_INTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define OTPC_INTENCLR_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define OTPC_INTENCLR_READY_Msk (0x1UL << OTPC_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                             */
  #define OTPC_INTENCLR_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define OTPC_INTENCLR_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define OTPC_INTENCLR_READY_Clear (0x1UL)          /*!< Disable                                                              */
  #define OTPC_INTENCLR_READY_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define OTPC_INTENCLR_READY_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 1 : Write '1' to disable interrupt for event READYNEXT */
  #define OTPC_INTENCLR_READYNEXT_Pos (1UL)          /*!< Position of READYNEXT field.                                         */
  #define OTPC_INTENCLR_READYNEXT_Msk (0x1UL << OTPC_INTENCLR_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                 */
  #define OTPC_INTENCLR_READYNEXT_Min (0x0UL)        /*!< Min enumerator value of READYNEXT field.                             */
  #define OTPC_INTENCLR_READYNEXT_Max (0x1UL)        /*!< Max enumerator value of READYNEXT field.                             */
  #define OTPC_INTENCLR_READYNEXT_Clear (0x1UL)      /*!< Disable                                                              */
  #define OTPC_INTENCLR_READYNEXT_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define OTPC_INTENCLR_READYNEXT_Enabled (0x1UL)    /*!< Read: Enabled                                                        */


/* OTPC_INTPEND: Pending interrupts */
  #define OTPC_INTPEND_ResetValue (0x00000000UL)     /*!< Reset value of INTPEND register.                                     */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define OTPC_INTPEND_READY_Pos (0UL)               /*!< Position of READY field.                                             */
  #define OTPC_INTPEND_READY_Msk (0x1UL << OTPC_INTPEND_READY_Pos) /*!< Bit mask of READY field.                               */
  #define OTPC_INTPEND_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define OTPC_INTPEND_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define OTPC_INTPEND_READY_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define OTPC_INTPEND_READY_Pending (0x1UL)         /*!< Read: Pending                                                        */

