NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* READYNEXT @Bit 1 : Read pending status of interrupt for event READYNEXT */
  #define OTPC_INTPEND_READYNEXT_Pos (1UL)           /*!< Position of READYNEXT field.                                         */
  #define OTPC_INTPEND_READYNEXT_Msk (0x1UL << OTPC_INTPEND_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                   */
  #define OTPC_INTPEND_READYNEXT_Min (0x0UL)         /*!< Min enumerator value of READYNEXT field.                             */
  #define OTPC_INTPEND_READYNEXT_Max (0x1UL)         /*!< Max enumerator value of READYNEXT field.                             */
  #define OTPC_INTPEND_READYNEXT_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define OTPC_INTPEND_READYNEXT_Pending (0x1UL)     /*!< Read: Pending                                                        */


/* OTPC_READY: OTPC status. */
  #define OTPC_READY_ResetValue (0x00000001UL)       /*!< Reset value of READY register.                                       */

/* READY @Bit 0 : The OTPC is ready or busy */
  #define OTPC_READY_READY_Pos (0UL)                 /*!< Position of READY field.                                             */
  #define OTPC_READY_READY_Msk (0x1UL << OTPC_READY_READY_Pos) /*!< Bit mask of READY field.                                   */
  #define OTPC_READY_READY_Min (0x0UL)               /*!< Min enumerator value of READY field.                                 */
  #define OTPC_READY_READY_Max (0x1UL)               /*!< Max enumerator value of READY field.                                 */
  #define OTPC_READY_READY_Busy (0x0UL)              /*!< OTPC is busy.                                                        */
  #define OTPC_READY_READY_Ready (0x1UL)             /*!< Current operation is completed and OTPC is ready.                    */


/* OTPC_READYNEXT: Ready next flag. */
  #define OTPC_READYNEXT_ResetValue (0x00000001UL)   /*!< Reset value of READYNEXT register.                                   */

/* READYNEXT @Bit 0 : OTPC can accept a new write operation. */
  #define OTPC_READYNEXT_READYNEXT_Pos (0UL)         /*!< Position of READYNEXT field.                                         */
  #define OTPC_READYNEXT_READYNEXT_Msk (0x1UL << OTPC_READYNEXT_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define OTPC_READYNEXT_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define OTPC_READYNEXT_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define OTPC_READYNEXT_READYNEXT_Busy (0x0UL)      /*!< OTPC cannot accept any write operation.                              */
  #define OTPC_READYNEXT_READYNEXT_Ready (0x1UL)     /*!< OTPC is ready to accept a new write operation.                       */


/* OTPC_CONFIG: Configuration register. */
  #define OTPC_CONFIG_ResetValue (0x00000000UL)      /*!< Reset value of CONFIG register.                                      */

/* WEN @Bit 0 : When the write is enabled, the writes to OTP are allowed, otherwise the write is ignored. The OTP read is
                allowed regardless of WEN setting. */

  #define OTPC_CONFIG_WEN_Pos (0UL)                  /*!< Position of WEN field.                                               */
  #define OTPC_CONFIG_WEN_Msk (0x1UL << OTPC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field.                                       */
  #define OTPC_CONFIG_WEN_Min (0x0UL)                /*!< Min enumerator value of WEN field.                                   */
  #define OTPC_CONFIG_WEN_Max (0x1UL)                /*!< Max enumerator value of WEN field.                                   */
  #define OTPC_CONFIG_WEN_DisableWrite (0x0UL)       /*!< Write is disabled.                                                   */
  #define OTPC_CONFIG_WEN_EnableWrite (0x1UL)        /*!< Write is enabled.                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct PDM_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [PDM_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) This event is generated if an error occurs during the
                                                                         bus transfer.*/
} NRF_PDM_EVENTS_DMA_Type;                           /*!< Size = 4 (0x004)                                                     */

/* PDM_EVENTS_DMA_BUSERROR: This event is generated if an error occurs during the bus transfer. */
  #define PDM_EVENTS_DMA_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                             */

/* BUSERROR @Bit 0 : This event is generated if an error occurs during the bus transfer. */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                          */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Msk (0x1UL << PDM_EVENTS_DMA_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR field.*/
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                            */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                            */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define PDM_EVENTS_DMA_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                              */



/* ================================================= Struct PDM_PUBLISH_DMA ================================================== */
/**
  * @brief PUBLISH_DMA [PDM_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) Publish configuration for event DMA.BUSERROR          */
} NRF_PDM_PUBLISH_DMA_Type;                          /*!< Size = 4 (0x004)                                                     */

/* PDM_PUBLISH_DMA_BUSERROR: Publish configuration for event DMA.BUSERROR */
  #define PDM_PUBLISH_DMA_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event DMA.BUSERROR will publish to */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Msk (0xFFUL << PDM_PUBLISH_DMA_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define PDM_PUBLISH_DMA_BUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Msk (0x1UL << PDM_PUBLISH_DMA_BUSERROR_EN_Pos) /*!< Bit mask of EN field.                */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define PDM_PUBLISH_DMA_BUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */



/* ===================================================== Struct PDM_PSEL ===================================================== */
/**
  * @brief PSEL [PDM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CLK;                               /*!< (@ 0x00000000) Pin number configuration for PDM CLK signal           */
  __IOM uint32_t  DIN;                               /*!< (@ 0x00000004) Pin number configuration for PDM DIN signal           */
} NRF_PDM_PSEL_Type;                                 /*!< Size = 8 (0x008)                                                     */

/* PDM_PSEL_CLK: Pin number configuration for PDM CLK signal */
  #define PDM_PSEL_CLK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of CLK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define PDM_PSEL_CLK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define PDM_PSEL_CLK_PIN_Msk (0x1FUL << PDM_PSEL_CLK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define PDM_PSEL_CLK_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define PDM_PSEL_CLK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define PDM_PSEL_CLK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define PDM_PSEL_CLK_PORT_Msk (0xFUL << PDM_PSEL_CLK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define PDM_PSEL_CLK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define PDM_PSEL_CLK_PORT_Max (0xFUL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define PDM_PSEL_CLK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define PDM_PSEL_CLK_CONNECT_Msk (0x1UL << PDM_PSEL_CLK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define PDM_PSEL_CLK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define PDM_PSEL_CLK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define PDM_PSEL_CLK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define PDM_PSEL_CLK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


