NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PDM_MCLKCONFIG: Master clock generator configuration */
  #define PDM_MCLKCONFIG_ResetValue (0x00000000UL)   /*!< Reset value of MCLKCONFIG register.                                  */

/* SRC @Bit 0 : Master clock source selection */
  #define PDM_MCLKCONFIG_SRC_Pos (0UL)               /*!< Position of SRC field.                                               */
  #define PDM_MCLKCONFIG_SRC_Msk (0x1UL << PDM_MCLKCONFIG_SRC_Pos) /*!< Bit mask of SRC field.                                 */
  #define PDM_MCLKCONFIG_SRC_Min (0x0UL)             /*!< Min enumerator value of SRC field.                                   */
  #define PDM_MCLKCONFIG_SRC_Max (0x1UL)             /*!< Max enumerator value of SRC field.                                   */
  #define PDM_MCLKCONFIG_SRC_PCLK32M (0x0UL)         /*!< 32 MHz peripheral clock                                              */
  #define PDM_MCLKCONFIG_SRC_ACLK (0x1UL)            /*!< Audio PLL clock                                                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           PPIB                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct PPIB_OVERFLOW =================================================== */
/**
  * @brief OVERFLOW [PPIB_OVERFLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEND;                              /*!< (@ 0x00000000) The task overflow for SEND tasks using SUBSCRIBE_SEND.
                                                                         Write 0 to clear.*/
} NRF_PPIB_OVERFLOW_Type;                            /*!< Size = 4 (0x004)                                                     */

/* PPIB_OVERFLOW_SEND: The task overflow for SEND tasks using SUBSCRIBE_SEND. Write 0 to clear. */
  #define PPIB_OVERFLOW_SEND_ResetValue (0x00000000UL) /*!< Reset value of SEND register.                                      */

/* SEND0 @Bit 0 : The status for tasks overflow at SUBSCRIBE_SEND[0]. */
  #define PPIB_OVERFLOW_SEND_SEND0_Pos (0UL)         /*!< Position of SEND0 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND0_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND0_Pos) /*!< Bit mask of SEND0 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND0_Min (0x0UL)       /*!< Min enumerator value of SEND0 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND0_Max (0x1UL)       /*!< Max enumerator value of SEND0 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND0_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND0_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND1 @Bit 1 : The status for tasks overflow at SUBSCRIBE_SEND[1]. */
  #define PPIB_OVERFLOW_SEND_SEND1_Pos (1UL)         /*!< Position of SEND1 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND1_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND1_Pos) /*!< Bit mask of SEND1 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND1_Min (0x0UL)       /*!< Min enumerator value of SEND1 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND1_Max (0x1UL)       /*!< Max enumerator value of SEND1 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND1_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND1_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND2 @Bit 2 : The status for tasks overflow at SUBSCRIBE_SEND[2]. */
  #define PPIB_OVERFLOW_SEND_SEND2_Pos (2UL)         /*!< Position of SEND2 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND2_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND2_Pos) /*!< Bit mask of SEND2 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND2_Min (0x0UL)       /*!< Min enumerator value of SEND2 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND2_Max (0x1UL)       /*!< Max enumerator value of SEND2 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND2_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND2_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND3 @Bit 3 : The status for tasks overflow at SUBSCRIBE_SEND[3]. */
  #define PPIB_OVERFLOW_SEND_SEND3_Pos (3UL)         /*!< Position of SEND3 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND3_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND3_Pos) /*!< Bit mask of SEND3 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND3_Min (0x0UL)       /*!< Min enumerator value of SEND3 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND3_Max (0x1UL)       /*!< Max enumerator value of SEND3 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND3_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND3_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND4 @Bit 4 : The status for tasks overflow at SUBSCRIBE_SEND[4]. */
  #define PPIB_OVERFLOW_SEND_SEND4_Pos (4UL)         /*!< Position of SEND4 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND4_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND4_Pos) /*!< Bit mask of SEND4 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND4_Min (0x0UL)       /*!< Min enumerator value of SEND4 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND4_Max (0x1UL)       /*!< Max enumerator value of SEND4 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND4_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND4_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

