NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* SEND5 @Bit 5 : The status for tasks overflow at SUBSCRIBE_SEND[5]. */
  #define PPIB_OVERFLOW_SEND_SEND5_Pos (5UL)         /*!< Position of SEND5 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND5_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND5_Pos) /*!< Bit mask of SEND5 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND5_Min (0x0UL)       /*!< Min enumerator value of SEND5 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND5_Max (0x1UL)       /*!< Max enumerator value of SEND5 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND5_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND5_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND6 @Bit 6 : The status for tasks overflow at SUBSCRIBE_SEND[6]. */
  #define PPIB_OVERFLOW_SEND_SEND6_Pos (6UL)         /*!< Position of SEND6 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND6_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND6_Pos) /*!< Bit mask of SEND6 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND6_Min (0x0UL)       /*!< Min enumerator value of SEND6 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND6_Max (0x1UL)       /*!< Max enumerator value of SEND6 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND6_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND6_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND7 @Bit 7 : The status for tasks overflow at SUBSCRIBE_SEND[7]. */
  #define PPIB_OVERFLOW_SEND_SEND7_Pos (7UL)         /*!< Position of SEND7 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND7_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND7_Pos) /*!< Bit mask of SEND7 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND7_Min (0x0UL)       /*!< Min enumerator value of SEND7 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND7_Max (0x1UL)       /*!< Max enumerator value of SEND7 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND7_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND7_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND8 @Bit 8 : The status for tasks overflow at SUBSCRIBE_SEND[8]. */
  #define PPIB_OVERFLOW_SEND_SEND8_Pos (8UL)         /*!< Position of SEND8 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND8_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND8_Pos) /*!< Bit mask of SEND8 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND8_Min (0x0UL)       /*!< Min enumerator value of SEND8 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND8_Max (0x1UL)       /*!< Max enumerator value of SEND8 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND8_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND8_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND9 @Bit 9 : The status for tasks overflow at SUBSCRIBE_SEND[9]. */
  #define PPIB_OVERFLOW_SEND_SEND9_Pos (9UL)         /*!< Position of SEND9 field.                                             */
  #define PPIB_OVERFLOW_SEND_SEND9_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND9_Pos) /*!< Bit mask of SEND9 field.                   */
  #define PPIB_OVERFLOW_SEND_SEND9_Min (0x0UL)       /*!< Min enumerator value of SEND9 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND9_Max (0x1UL)       /*!< Max enumerator value of SEND9 field.                                 */
  #define PPIB_OVERFLOW_SEND_SEND9_Overflow (0x1UL)  /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND9_NoOverflow (0x0UL) /*!< No task overflow has happened.                                      */

/* SEND10 @Bit 10 : The status for tasks overflow at SUBSCRIBE_SEND[10]. */
  #define PPIB_OVERFLOW_SEND_SEND10_Pos (10UL)       /*!< Position of SEND10 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND10_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND10_Pos) /*!< Bit mask of SEND10 field.                */
  #define PPIB_OVERFLOW_SEND_SEND10_Min (0x0UL)      /*!< Min enumerator value of SEND10 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND10_Max (0x1UL)      /*!< Max enumerator value of SEND10 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND10_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND10_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND11 @Bit 11 : The status for tasks overflow at SUBSCRIBE_SEND[11]. */
  #define PPIB_OVERFLOW_SEND_SEND11_Pos (11UL)       /*!< Position of SEND11 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND11_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND11_Pos) /*!< Bit mask of SEND11 field.                */
  #define PPIB_OVERFLOW_SEND_SEND11_Min (0x0UL)      /*!< Min enumerator value of SEND11 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND11_Max (0x1UL)      /*!< Max enumerator value of SEND11 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND11_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND11_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND12 @Bit 12 : The status for tasks overflow at SUBSCRIBE_SEND[12]. */
  #define PPIB_OVERFLOW_SEND_SEND12_Pos (12UL)       /*!< Position of SEND12 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND12_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND12_Pos) /*!< Bit mask of SEND12 field.                */
  #define PPIB_OVERFLOW_SEND_SEND12_Min (0x0UL)      /*!< Min enumerator value of SEND12 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND12_Max (0x1UL)      /*!< Max enumerator value of SEND12 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND12_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND12_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND13 @Bit 13 : The status for tasks overflow at SUBSCRIBE_SEND[13]. */
  #define PPIB_OVERFLOW_SEND_SEND13_Pos (13UL)       /*!< Position of SEND13 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND13_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND13_Pos) /*!< Bit mask of SEND13 field.                */
  #define PPIB_OVERFLOW_SEND_SEND13_Min (0x0UL)      /*!< Min enumerator value of SEND13 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND13_Max (0x1UL)      /*!< Max enumerator value of SEND13 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND13_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND13_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND14 @Bit 14 : The status for tasks overflow at SUBSCRIBE_SEND[14]. */
  #define PPIB_OVERFLOW_SEND_SEND14_Pos (14UL)       /*!< Position of SEND14 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND14_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND14_Pos) /*!< Bit mask of SEND14 field.                */
  #define PPIB_OVERFLOW_SEND_SEND14_Min (0x0UL)      /*!< Min enumerator value of SEND14 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND14_Max (0x1UL)      /*!< Max enumerator value of SEND14 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND14_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND14_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND15 @Bit 15 : The status for tasks overflow at SUBSCRIBE_SEND[15]. */
  #define PPIB_OVERFLOW_SEND_SEND15_Pos (15UL)       /*!< Position of SEND15 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND15_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND15_Pos) /*!< Bit mask of SEND15 field.                */
  #define PPIB_OVERFLOW_SEND_SEND15_Min (0x0UL)      /*!< Min enumerator value of SEND15 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND15_Max (0x1UL)      /*!< Max enumerator value of SEND15 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND15_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND15_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND16 @Bit 16 : The status for tasks overflow at SUBSCRIBE_SEND[16]. */
  #define PPIB_OVERFLOW_SEND_SEND16_Pos (16UL)       /*!< Position of SEND16 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND16_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND16_Pos) /*!< Bit mask of SEND16 field.                */
  #define PPIB_OVERFLOW_SEND_SEND16_Min (0x0UL)      /*!< Min enumerator value of SEND16 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND16_Max (0x1UL)      /*!< Max enumerator value of SEND16 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND16_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND16_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND17 @Bit 17 : The status for tasks overflow at SUBSCRIBE_SEND[17]. */
  #define PPIB_OVERFLOW_SEND_SEND17_Pos (17UL)       /*!< Position of SEND17 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND17_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND17_Pos) /*!< Bit mask of SEND17 field.                */
  #define PPIB_OVERFLOW_SEND_SEND17_Min (0x0UL)      /*!< Min enumerator value of SEND17 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND17_Max (0x1UL)      /*!< Max enumerator value of SEND17 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND17_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND17_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND18 @Bit 18 : The status for tasks overflow at SUBSCRIBE_SEND[18]. */
  #define PPIB_OVERFLOW_SEND_SEND18_Pos (18UL)       /*!< Position of SEND18 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND18_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND18_Pos) /*!< Bit mask of SEND18 field.                */
  #define PPIB_OVERFLOW_SEND_SEND18_Min (0x0UL)      /*!< Min enumerator value of SEND18 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND18_Max (0x1UL)      /*!< Max enumerator value of SEND18 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND18_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND18_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

/* SEND19 @Bit 19 : The status for tasks overflow at SUBSCRIBE_SEND[19]. */
  #define PPIB_OVERFLOW_SEND_SEND19_Pos (19UL)       /*!< Position of SEND19 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND19_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND19_Pos) /*!< Bit mask of SEND19 field.                */
  #define PPIB_OVERFLOW_SEND_SEND19_Min (0x0UL)      /*!< Min enumerator value of SEND19 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND19_Max (0x1UL)      /*!< Max enumerator value of SEND19 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND19_Overflow (0x1UL) /*!< Task overflow has happened.                                          */
  #define PPIB_OVERFLOW_SEND_SEND19_NoOverflow (0x0UL) /*!< No task overflow has happened.                                     */

