NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ======================================================= Struct PPIB ======================================================= */
/**
  * @brief PPIB registers
  */
  typedef struct {                                   /*!< PPIB Structure                                                       */
    __OM uint32_t TASKS_SEND[32];                    /*!< (@ 0x00000000) Enabling SUBSCRIBE_SEND[n] allows an event on the
                                                                         hardwired DPPIC channel to trigger a signal on PPIB
                                                                         channel n. Direct writes to the SEND[n] task are
                                                                         ignored.*/
    __IOM uint32_t SUBSCRIBE_SEND[32];               /*!< (@ 0x00000080) Subscribe configuration for task SEND[n]              */
    __IOM uint32_t EVENTS_RECEIVE[32];               /*!< (@ 0x00000100) Enabling PUBLISH_RECEIVE[n] allows a signal on PPIB
                                                                         channel n to trigger an event on the hardwired DPPIC
                                                                         channel. Direct reads from the RECEIVE[n] event are
                                                                         ignored.*/
    __IOM uint32_t PUBLISH_RECEIVE[32];              /*!< (@ 0x00000180) Publish configuration for event RECEIVE[n]            */
    __IM uint32_t RESERVED[128];
    __IOM NRF_PPIB_OVERFLOW_Type OVERFLOW;           /*!< (@ 0x00000400) (unspecified)                                         */
  } NRF_PPIB_Type;                                   /*!< Size = 1028 (0x404)                                                  */

/* PPIB_TASKS_SEND: Enabling SUBSCRIBE_SEND[n] allows an event on the hardwired DPPIC channel to trigger a signal on PPIB
                     channel n. Direct writes to the SEND[n] task are ignored. */

  #define PPIB_TASKS_SEND_MaxCount (32UL)            /*!< Max size of TASKS_SEND[32] array.                                    */
  #define PPIB_TASKS_SEND_MaxIndex (31UL)            /*!< Max index of TASKS_SEND[32] array.                                   */
  #define PPIB_TASKS_SEND_MinIndex (0UL)             /*!< Min index of TASKS_SEND[32] array.                                   */
  #define PPIB_TASKS_SEND_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_SEND[32] register.                              */

/* TASKS_SEND @Bit 0 : Enabling SUBSCRIBE_SEND[n] allows an event on the hardwired DPPIC channel to trigger a signal on PPIB
                       channel n. Direct writes to the SEND[n] task are ignored. */

  #define PPIB_TASKS_SEND_TASKS_SEND_Pos (0UL)       /*!< Position of TASKS_SEND field.                                        */
  #define PPIB_TASKS_SEND_TASKS_SEND_Msk (0x1UL << PPIB_TASKS_SEND_TASKS_SEND_Pos) /*!< Bit mask of TASKS_SEND field.          */
  #define PPIB_TASKS_SEND_TASKS_SEND_Min (0x1UL)     /*!< Min enumerator value of TASKS_SEND field.                            */
  #define PPIB_TASKS_SEND_TASKS_SEND_Max (0x1UL)     /*!< Max enumerator value of TASKS_SEND field.                            */
  #define PPIB_TASKS_SEND_TASKS_SEND_Trigger (0x1UL) /*!< Trigger task                                                         */


/* PPIB_SUBSCRIBE_SEND: Subscribe configuration for task SEND[n] */
  #define PPIB_SUBSCRIBE_SEND_MaxCount (32UL)        /*!< Max size of SUBSCRIBE_SEND[32] array.                                */
  #define PPIB_SUBSCRIBE_SEND_MaxIndex (31UL)        /*!< Max index of SUBSCRIBE_SEND[32] array.                               */
  #define PPIB_SUBSCRIBE_SEND_MinIndex (0UL)         /*!< Min index of SUBSCRIBE_SEND[32] array.                               */
  #define PPIB_SUBSCRIBE_SEND_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SEND[32] register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that task SEND[n] will subscribe to */
  #define PPIB_SUBSCRIBE_SEND_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define PPIB_SUBSCRIBE_SEND_CHIDX_Msk (0xFFUL << PPIB_SUBSCRIBE_SEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define PPIB_SUBSCRIBE_SEND_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define PPIB_SUBSCRIBE_SEND_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PPIB_SUBSCRIBE_SEND_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define PPIB_SUBSCRIBE_SEND_EN_Msk (0x1UL << PPIB_SUBSCRIBE_SEND_EN_Pos) /*!< Bit mask of EN field.                          */
  #define PPIB_SUBSCRIBE_SEND_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define PPIB_SUBSCRIBE_SEND_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define PPIB_SUBSCRIBE_SEND_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define PPIB_SUBSCRIBE_SEND_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* PPIB_EVENTS_RECEIVE: Enabling PUBLISH_RECEIVE[n] allows a signal on PPIB channel n to trigger an event on the hardwired DPPIC
                         channel. Direct reads from the RECEIVE[n] event are ignored. */

  #define PPIB_EVENTS_RECEIVE_MaxCount (32UL)        /*!< Max size of EVENTS_RECEIVE[32] array.                                */
  #define PPIB_EVENTS_RECEIVE_MaxIndex (31UL)        /*!< Max index of EVENTS_RECEIVE[32] array.                               */
  #define PPIB_EVENTS_RECEIVE_MinIndex (0UL)         /*!< Min index of EVENTS_RECEIVE[32] array.                               */
  #define PPIB_EVENTS_RECEIVE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RECEIVE[32] register.                       */

