NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* EVENTS_RECEIVE @Bit 0 : Enabling PUBLISH_RECEIVE[n] allows a signal on PPIB channel n to trigger an event on the hardwired
                           DPPIC channel. Direct reads from the RECEIVE[n] event are ignored. */

  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos (0UL) /*!< Position of EVENTS_RECEIVE field.                                  */
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Msk (0x1UL << PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos) /*!< Bit mask of
                                                                            EVENTS_RECEIVE field.*/
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Min (0x0UL) /*!< Min enumerator value of EVENTS_RECEIVE field.                    */
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Max (0x1UL) /*!< Max enumerator value of EVENTS_RECEIVE field.                    */
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Generated (0x1UL) /*!< Event generated                                            */


/* PPIB_PUBLISH_RECEIVE: Publish configuration for event RECEIVE[n] */
  #define PPIB_PUBLISH_RECEIVE_MaxCount (32UL)       /*!< Max size of PUBLISH_RECEIVE[32] array.                               */
  #define PPIB_PUBLISH_RECEIVE_MaxIndex (31UL)       /*!< Max index of PUBLISH_RECEIVE[32] array.                              */
  #define PPIB_PUBLISH_RECEIVE_MinIndex (0UL)        /*!< Min index of PUBLISH_RECEIVE[32] array.                              */
  #define PPIB_PUBLISH_RECEIVE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RECEIVE[32] register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << PPIB_PUBLISH_RECEIVE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PPIB_PUBLISH_RECEIVE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define PPIB_PUBLISH_RECEIVE_EN_Msk (0x1UL << PPIB_PUBLISH_RECEIVE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define PPIB_PUBLISH_RECEIVE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define PPIB_PUBLISH_RECEIVE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define PPIB_PUBLISH_RECEIVE_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define PPIB_PUBLISH_RECEIVE_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PWM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct PWM_TASKS_DMA_SEQ ================================================= */
/**
  * @brief SEQ [PWM_TASKS_DMA_SEQ] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event.*/
} NRF_PWM_TASKS_DMA_SEQ_Type;                        /*!< Size = 8 (0x008)                                                     */
  #define PWM_TASKS_DMA_SEQ_MaxCount (2UL)           /*!< Size of SEQ[2] array.                                                */
  #define PWM_TASKS_DMA_SEQ_MaxIndex (1UL)           /*!< Max index of SEQ[2] array.                                           */
  #define PWM_TASKS_DMA_SEQ_MinIndex (0UL)           /*!< Min index of SEQ[2] array.                                           */

/* PWM_TASKS_DMA_SEQ_START: Starts operation using easyDMA to load the values. See peripheral description for operation using
                             easyDMA. */

  #define PWM_TASKS_DMA_SEQ_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                */

/* START @Bit 0 : Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA. */
  #define PWM_TASKS_DMA_SEQ_START_START_Pos (0UL)    /*!< Position of START field.                                             */
  #define PWM_TASKS_DMA_SEQ_START_START_Msk (0x1UL << PWM_TASKS_DMA_SEQ_START_START_Pos) /*!< Bit mask of START field.         */
  #define PWM_TASKS_DMA_SEQ_START_START_Min (0x1UL)  /*!< Min enumerator value of START field.                                 */
  #define PWM_TASKS_DMA_SEQ_START_START_Max (0x1UL)  /*!< Max enumerator value of START field.                                 */
  #define PWM_TASKS_DMA_SEQ_START_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* PWM_TASKS_DMA_SEQ_STOP: Stops operation using easyDMA. This does not trigger an END event. */
  #define PWM_TASKS_DMA_SEQ_STOP_ResetValue (0x00000000UL) /*!< Reset value of STOP register.                                  */

/* STOP @Bit 0 : Stops operation using easyDMA. This does not trigger an END event. */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Pos (0UL)      /*!< Position of STOP field.                                              */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Msk (0x1UL << PWM_TASKS_DMA_SEQ_STOP_STOP_Pos) /*!< Bit mask of STOP field.              */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Min (0x1UL)    /*!< Min enumerator value of STOP field.                                  */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Max (0x1UL)    /*!< Max enumerator value of STOP field.                                  */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */



