NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ===================================================== Struct PWM_SEQ ====================================================== */
/**
  * @brief SEQ [PWM_SEQ] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  REFRESH;                           /*!< (@ 0x00000008) Number of additional PWM periods between samples loaded
                                                                         into compare register*/
  __IOM uint32_t  ENDDELAY;                          /*!< (@ 0x0000000C) Time added after the sequence                         */
  __IM  uint32_t  RESERVED1[4];
} NRF_PWM_SEQ_Type;                                  /*!< Size = 32 (0x020)                                                    */
  #define PWM_SEQ_MaxCount (2UL)                     /*!< Size of SEQ[2] array.                                                */
  #define PWM_SEQ_MaxIndex (1UL)                     /*!< Max index of SEQ[2] array.                                           */
  #define PWM_SEQ_MinIndex (0UL)                     /*!< Min index of SEQ[2] array.                                           */

/* PWM_SEQ_REFRESH: Number of additional PWM periods between samples loaded into compare register */
  #define PWM_SEQ_REFRESH_ResetValue (0x00000001UL)  /*!< Reset value of REFRESH register.                                     */

/* CNT @Bits 0..23 : Number of additional PWM periods between samples loaded into compare register (load every REFRESH.CNT+1 PWM
                     periods) */

  #define PWM_SEQ_REFRESH_CNT_Pos (0UL)              /*!< Position of CNT field.                                               */
  #define PWM_SEQ_REFRESH_CNT_Msk (0xFFFFFFUL << PWM_SEQ_REFRESH_CNT_Pos) /*!< Bit mask of CNT field.                          */
  #define PWM_SEQ_REFRESH_CNT_Min (0x0UL)            /*!< Min enumerator value of CNT field.                                   */
  #define PWM_SEQ_REFRESH_CNT_Max (0x0UL)            /*!< Max enumerator value of CNT field.                                   */
  #define PWM_SEQ_REFRESH_CNT_Continuous (0x000000UL) /*!< Update every PWM period                                             */


/* PWM_SEQ_ENDDELAY: Time added after the sequence */
  #define PWM_SEQ_ENDDELAY_ResetValue (0x00000000UL) /*!< Reset value of ENDDELAY register.                                    */

/* CNT @Bits 0..23 : Time added after the sequence in PWM periods */
  #define PWM_SEQ_ENDDELAY_CNT_Pos (0UL)             /*!< Position of CNT field.                                               */
  #define PWM_SEQ_ENDDELAY_CNT_Msk (0xFFFFFFUL << PWM_SEQ_ENDDELAY_CNT_Pos) /*!< Bit mask of CNT field.                        */



/* ===================================================== Struct PWM_PSEL ===================================================== */
/**
  * @brief PSEL [PWM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OUT[4];                            /*!< (@ 0x00000000) Output pin select for PWM channel n                   */
} NRF_PWM_PSEL_Type;                                 /*!< Size = 16 (0x010)                                                    */

/* PWM_PSEL_OUT: Output pin select for PWM channel n */
  #define PWM_PSEL_OUT_MaxCount (4UL)                /*!< Max size of OUT[4] array.                                            */
  #define PWM_PSEL_OUT_MaxIndex (3UL)                /*!< Max index of OUT[4] array.                                           */
  #define PWM_PSEL_OUT_MinIndex (0UL)                /*!< Min index of OUT[4] array.                                           */
  #define PWM_PSEL_OUT_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of OUT[4] register.                                      */

/* PIN @Bits 0..4 : Pin number */
  #define PWM_PSEL_OUT_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define PWM_PSEL_OUT_PIN_Msk (0x1FUL << PWM_PSEL_OUT_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define PWM_PSEL_OUT_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define PWM_PSEL_OUT_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define PWM_PSEL_OUT_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define PWM_PSEL_OUT_PORT_Msk (0xFUL << PWM_PSEL_OUT_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define PWM_PSEL_OUT_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define PWM_PSEL_OUT_PORT_Max (0xFUL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define PWM_PSEL_OUT_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define PWM_PSEL_OUT_CONNECT_Msk (0x1UL << PWM_PSEL_OUT_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define PWM_PSEL_OUT_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define PWM_PSEL_OUT_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define PWM_PSEL_OUT_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define PWM_PSEL_OUT_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */



/* =================================================== Struct PWM_DMA_SEQ ==================================================== */
/**
  * @brief SEQ [PWM_DMA_SEQ] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) RAM buffer start address                              */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of bytes in channel buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event.*/
  __IM  uint32_t  CURRENTAMOUNT;                     /*!< (@ 0x00000010) Number of bytes transferred in the current transaction*/
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_PWM_DMA_SEQ_Type;                              /*!< Size = 36 (0x024)                                                    */
  #define PWM_DMA_SEQ_MaxCount (2UL)                 /*!< Size of SEQ[2] array.                                                */
  #define PWM_DMA_SEQ_MaxIndex (1UL)                 /*!< Max index of SEQ[2] array.                                           */
  #define PWM_DMA_SEQ_MinIndex (0UL)                 /*!< Min index of SEQ[2] array.                                           */

/* PWM_DMA_SEQ_PTR: RAM buffer start address */
  #define PWM_DMA_SEQ_PTR_ResetValue (0x00000000UL)  /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define PWM_DMA_SEQ_PTR_PTR_Pos (0UL)              /*!< Position of PTR field.                                               */
  #define PWM_DMA_SEQ_PTR_PTR_Msk (0xFFFFFFFFUL << PWM_DMA_SEQ_PTR_PTR_Pos) /*!< Bit mask of PTR field.                        */


/* PWM_DMA_SEQ_MAXCNT: Maximum number of bytes in channel buffer */
  #define PWM_DMA_SEQ_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                    */

/* MAXCNT @Bits 0..15 : Maximum number of bytes in channel buffer */
  #define PWM_DMA_SEQ_MAXCNT_MAXCNT_Pos (0UL)        /*!< Position of MAXCNT field.                                            */
  #define PWM_DMA_SEQ_MAXCNT_MAXCNT_Msk (0xFFFFUL << PWM_DMA_SEQ_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.             */
  #define PWM_DMA_SEQ_MAXCNT_MAXCNT_Min (0x0001UL)   /*!< Min value of MAXCNT field.                                           */
  #define PWM_DMA_SEQ_MAXCNT_MAXCNT_Max (0xFFFFUL)   /*!< Max size of MAXCNT field.                                            */


