NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ROLE @Bit 2 : Role as a Initiator or Reflector. */
  #define RADIO_RTT_CONFIG_ROLE_Pos (2UL)            /*!< Position of ROLE field.                                              */
  #define RADIO_RTT_CONFIG_ROLE_Msk (0x1UL << RADIO_RTT_CONFIG_ROLE_Pos) /*!< Bit mask of ROLE field.                          */
  #define RADIO_RTT_CONFIG_ROLE_Min (0x0UL)          /*!< Min enumerator value of ROLE field.                                  */
  #define RADIO_RTT_CONFIG_ROLE_Max (0x1UL)          /*!< Max enumerator value of ROLE field.                                  */
  #define RADIO_RTT_CONFIG_ROLE_Initiator (0x0UL)    /*!< Initiator                                                            */
  #define RADIO_RTT_CONFIG_ROLE_Reflector (0x1UL)    /*!< Reflector                                                            */

/* NUMSEGMENTS @Bits 3..6 : Number of 16bit payload segments available for ToA detection. Allowed values are 0, 2, 4, 6 and 8. */
  #define RADIO_RTT_CONFIG_NUMSEGMENTS_Pos (3UL)     /*!< Position of NUMSEGMENTS field.                                       */
  #define RADIO_RTT_CONFIG_NUMSEGMENTS_Msk (0xFUL << RADIO_RTT_CONFIG_NUMSEGMENTS_Pos) /*!< Bit mask of NUMSEGMENTS field.     */

/* EFSDELAY @Bits 8..16 : Early Frame Sync Delay, i.e., number of cycles to wait for access address to anchor correctly. For
                          2MBPSBLE mode, the EFSDELAY value is 64 (2us) and for 1MBPSBLE mode, it can be 256 (8us). */

  #define RADIO_RTT_CONFIG_EFSDELAY_Pos (8UL)        /*!< Position of EFSDELAY field.                                          */
  #define RADIO_RTT_CONFIG_EFSDELAY_Msk (0x1FFUL << RADIO_RTT_CONFIG_EFSDELAY_Pos) /*!< Bit mask of EFSDELAY field.            */


/* RADIO_RTT_SEGMENT01: RTT segments 0 and 1 */
  #define RADIO_RTT_SEGMENT01_ResetValue (0x00000000UL) /*!< Reset value of SEGMENT01 register.                                */

/* DATA @Bits 0..31 : Data Bits 31 - 0 */
  #define RADIO_RTT_SEGMENT01_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define RADIO_RTT_SEGMENT01_DATA_Msk (0xFFFFFFFFUL << RADIO_RTT_SEGMENT01_DATA_Pos) /*!< Bit mask of DATA field.             */


/* RADIO_RTT_SEGMENT23: RTT segments 2 and 3 */
  #define RADIO_RTT_SEGMENT23_ResetValue (0x00000000UL) /*!< Reset value of SEGMENT23 register.                                */

/* DATA @Bits 0..31 : Data Bits 63 - 32 */
  #define RADIO_RTT_SEGMENT23_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define RADIO_RTT_SEGMENT23_DATA_Msk (0xFFFFFFFFUL << RADIO_RTT_SEGMENT23_DATA_Pos) /*!< Bit mask of DATA field.             */


/* RADIO_RTT_SEGMENT45: RTT segments 4 and 5 */
  #define RADIO_RTT_SEGMENT45_ResetValue (0x00000000UL) /*!< Reset value of SEGMENT45 register.                                */

/* DATA @Bits 0..31 : Data Bits 95 - 64 */
  #define RADIO_RTT_SEGMENT45_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define RADIO_RTT_SEGMENT45_DATA_Msk (0xFFFFFFFFUL << RADIO_RTT_SEGMENT45_DATA_Pos) /*!< Bit mask of DATA field.             */


/* RADIO_RTT_SEGMENT67: RTT segments 6 and 7 */
  #define RADIO_RTT_SEGMENT67_ResetValue (0x00000000UL) /*!< Reset value of SEGMENT67 register.                                */

/* DATA @Bits 0..31 : Data Bits 127 - 96 */
  #define RADIO_RTT_SEGMENT67_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define RADIO_RTT_SEGMENT67_DATA_Msk (0xFFFFFFFFUL << RADIO_RTT_SEGMENT67_DATA_Pos) /*!< Bit mask of DATA field.             */


/* ====================================================== Struct RADIO ======================================================= */
/**
  * @brief 2.4 GHz radio
  */
  typedef struct {                                   /*!< RADIO Structure                                                      */
    __OM uint32_t TASKS_TXEN;                        /*!< (@ 0x00000000) Enable RADIO in TX mode                               */
    __OM uint32_t TASKS_RXEN;                        /*!< (@ 0x00000004) Enable RADIO in RX mode                               */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000008) Start RADIO                                           */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x0000000C) Stop RADIO                                            */
    __OM uint32_t TASKS_DISABLE;                     /*!< (@ 0x00000010) Disable RADIO                                         */
    __OM uint32_t TASKS_RSSISTART;                   /*!< (@ 0x00000014) Start the RSSI and take one single sample of the
                                                                         receive signal strength*/
    __OM uint32_t TASKS_BCSTART;                     /*!< (@ 0x00000018) Start the bit counter                                 */
    __OM uint32_t TASKS_BCSTOP;                      /*!< (@ 0x0000001C) Stop the bit counter                                  */
    __OM uint32_t TASKS_EDSTART;                     /*!< (@ 0x00000020) Start the energy detect measurement used in IEEE
                                                                         802.15.4 mode*/
    __OM uint32_t TASKS_EDSTOP;                      /*!< (@ 0x00000024) Stop the energy detect measurement                    */
    __OM uint32_t TASKS_CCASTART;                    /*!< (@ 0x00000028) Start the clear channel assessment used in IEEE
                                                                         802.15.4 mode*/
    __OM uint32_t TASKS_CCASTOP;                     /*!< (@ 0x0000002C) Stop the clear channel assessment                     */
    __IM uint32_t RESERVED[29];
    __OM uint32_t TASKS_SOFTRESET;                   /*!< (@ 0x000000A4) Reset all public registers, but with these exceptions:
                                                                         DMA registers and EVENT/INTEN/SUBSCRIBE/PUBLISH
                                                                         registers. Only to be used in DISABLED state.*/
    __IM uint32_t RESERVED1[22];
    __IOM uint32_t SUBSCRIBE_TXEN;                   /*!< (@ 0x00000100) Subscribe configuration for task TXEN                 */
    __IOM uint32_t SUBSCRIBE_RXEN;                   /*!< (@ 0x00000104) Subscribe configuration for task RXEN                 */
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000108) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x0000010C) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_DISABLE;                /*!< (@ 0x00000110) Subscribe configuration for task DISABLE              */
    __IOM uint32_t SUBSCRIBE_RSSISTART;              /*!< (@ 0x00000114) Subscribe configuration for task RSSISTART            */
    __IOM uint32_t SUBSCRIBE_BCSTART;                /*!< (@ 0x00000118) Subscribe configuration for task BCSTART              */
    __IOM uint32_t SUBSCRIBE_BCSTOP;                 /*!< (@ 0x0000011C) Subscribe configuration for task BCSTOP               */
    __IOM uint32_t SUBSCRIBE_EDSTART;                /*!< (@ 0x00000120) Subscribe configuration for task EDSTART              */
    __IOM uint32_t SUBSCRIBE_EDSTOP;                 /*!< (@ 0x00000124) Subscribe configuration for task EDSTOP               */
    __IOM uint32_t SUBSCRIBE_CCASTART;               /*!< (@ 0x00000128) Subscribe configuration for task CCASTART             */
    __IOM uint32_t SUBSCRIBE_CCASTOP;                /*!< (@ 0x0000012C) Subscribe configuration for task CCASTOP              */
    __IM uint32_t RESERVED2[29];
    __IOM uint32_t SUBSCRIBE_SOFTRESET;              /*!< (@ 0x000001A4) Subscribe configuration for task SOFTRESET            */
    __IM uint32_t RESERVED3[22];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000200) RADIO has ramped up and is ready to be started        */
    __IOM uint32_t EVENTS_TXREADY;                   /*!< (@ 0x00000204) RADIO has ramped up and is ready to be started TX path*/
    __IOM uint32_t EVENTS_RXREADY;                   /*!< (@ 0x00000208) RADIO has ramped up and is ready to be started RX path*/
    __IOM uint32_t EVENTS_ADDRESS;                   /*!< (@ 0x0000020C) Address sent or received                              */
    __IOM uint32_t EVENTS_FRAMESTART;                /*!< (@ 0x00000210) IEEE 802.15.4 length field received                   */
    __IOM uint32_t EVENTS_PAYLOAD;                   /*!< (@ 0x00000214) Packet payload sent or received                       */
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000218) Memory access for packet data has been completed      */
    __IOM uint32_t EVENTS_PHYEND;                    /*!< (@ 0x0000021C) The last bit is sent on air or last bit is received   */
    __IOM uint32_t EVENTS_DISABLED;                  /*!< (@ 0x00000220) RADIO has been disabled                               */
    __IOM uint32_t EVENTS_DEVMATCH;                  /*!< (@ 0x00000224) A device address match occurred on the last received
                                                                         packet*/
    __IOM uint32_t EVENTS_DEVMISS;                   /*!< (@ 0x00000228) No device address match occurred on the last received
                                                                         packet*/
    __IOM uint32_t EVENTS_CRCOK;                     /*!< (@ 0x0000022C) Packet received with CRC ok                           */
    __IOM uint32_t EVENTS_CRCERROR;                  /*!< (@ 0x00000230) Packet received with CRC error                        */
    __IM uint32_t RESERVED4;
    __IOM uint32_t EVENTS_BCMATCH;                   /*!< (@ 0x00000238) Bit counter reached bit count value                   */
    __IOM uint32_t EVENTS_EDEND;                     /*!< (@ 0x0000023C) Sampling of energy detection complete (a new ED sample
                                                                         is ready for readout from the RADIO.EDSAMPLE register)*/
    __IOM uint32_t EVENTS_EDSTOPPED;                 /*!< (@ 0x00000240) The sampling of energy detection has stopped          */
    __IOM uint32_t EVENTS_CCAIDLE;                   /*!< (@ 0x00000244) Wireless medium in idle - clear to send               */
    __IOM uint32_t EVENTS_CCABUSY;                   /*!< (@ 0x00000248) Wireless medium busy - do not send                    */
    __IOM uint32_t EVENTS_CCASTOPPED;                /*!< (@ 0x0000024C) The CCA has stopped                                   */
    __IOM uint32_t EVENTS_RATEBOOST;                 /*!< (@ 0x00000250) Ble_LR CI field received, receive mode is changed from
                                                                         Ble_LR125Kbit to Ble_LR500Kbit*/
    __IOM uint32_t EVENTS_MHRMATCH;                  /*!< (@ 0x00000254) MAC header match found                                */
    __IOM uint32_t EVENTS_SYNC;                      /*!< (@ 0x00000258) Initial sync detected                                 */
    __IOM uint32_t EVENTS_CTEPRESENT;                /*!< (@ 0x0000025C) CTEInfo byte is received                              */
    __IM uint32_t RESERVED5[40];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000300) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_TXREADY;                  /*!< (@ 0x00000304) Publish configuration for event TXREADY               */
    __IOM uint32_t PUBLISH_RXREADY;                  /*!< (@ 0x00000308) Publish configuration for event RXREADY               */
    __IOM uint32_t PUBLISH_ADDRESS;                  /*!< (@ 0x0000030C) Publish configuration for event ADDRESS               */
    __IOM uint32_t PUBLISH_FRAMESTART;               /*!< (@ 0x00000310) Publish configuration for event FRAMESTART            */
    __IOM uint32_t PUBLISH_PAYLOAD;                  /*!< (@ 0x00000314) Publish configuration for event PAYLOAD               */
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000318) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_PHYEND;                   /*!< (@ 0x0000031C) Publish configuration for event PHYEND                */
    __IOM uint32_t PUBLISH_DISABLED;                 /*!< (@ 0x00000320) Publish configuration for event DISABLED              */
    __IOM uint32_t PUBLISH_DEVMATCH;                 /*!< (@ 0x00000324) Publish configuration for event DEVMATCH              */
    __IOM uint32_t PUBLISH_DEVMISS;                  /*!< (@ 0x00000328) Publish configuration for event DEVMISS               */
    __IOM uint32_t PUBLISH_CRCOK;                    /*!< (@ 0x0000032C) Publish configuration for event CRCOK                 */
    __IOM uint32_t PUBLISH_CRCERROR;                 /*!< (@ 0x00000330) Publish configuration for event CRCERROR              */
    __IM uint32_t RESERVED6;
    __IOM uint32_t PUBLISH_BCMATCH;                  /*!< (@ 0x00000338) Publish configuration for event BCMATCH               */
    __IOM uint32_t PUBLISH_EDEND;                    /*!< (@ 0x0000033C) Publish configuration for event EDEND                 */
    __IOM uint32_t PUBLISH_EDSTOPPED;                /*!< (@ 0x00000340) Publish configuration for event EDSTOPPED             */
    __IOM uint32_t PUBLISH_CCAIDLE;                  /*!< (@ 0x00000344) Publish configuration for event CCAIDLE               */
    __IOM uint32_t PUBLISH_CCABUSY;                  /*!< (@ 0x00000348) Publish configuration for event CCABUSY               */
    __IOM uint32_t PUBLISH_CCASTOPPED;               /*!< (@ 0x0000034C) Publish configuration for event CCASTOPPED            */
    __IOM uint32_t PUBLISH_RATEBOOST;                /*!< (@ 0x00000350) Publish configuration for event RATEBOOST             */
    __IOM uint32_t PUBLISH_MHRMATCH;                 /*!< (@ 0x00000354) Publish configuration for event MHRMATCH              */
    __IOM uint32_t PUBLISH_SYNC;                     /*!< (@ 0x00000358) Publish configuration for event SYNC                  */
    __IOM uint32_t PUBLISH_CTEPRESENT;               /*!< (@ 0x0000035C) Publish configuration for event CTEPRESENT            */
    __IM uint32_t RESERVED7[40];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000400) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED8[33];
    __IOM uint32_t INTENSET00;                       /*!< (@ 0x00000488) Enable interrupt                                      */
    __IM uint32_t RESERVED9;
    __IOM uint32_t INTENCLR00;                       /*!< (@ 0x00000490) Disable interrupt                                     */
    __IM uint32_t RESERVED10[5];
    __IOM uint32_t INTENSET10;                       /*!< (@ 0x000004A8) Enable interrupt                                      */
    __IM uint32_t RESERVED11;
    __IOM uint32_t INTENCLR10;                       /*!< (@ 0x000004B0) Disable interrupt                                     */
    __IM uint32_t RESERVED12[19];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000500) Data rate and modulation                              */
    __IM uint32_t RESERVED13[7];
    __IM uint32_t STATE;                             /*!< (@ 0x00000520) Current radio state                                   */
    __IM uint32_t RESERVED14[3];
    __IOM uint32_t EDCTRL;                           /*!< (@ 0x00000530) IEEE 802.15.4 energy detect control                   */
    __IM uint32_t EDSAMPLE;                          /*!< (@ 0x00000534) IEEE 802.15.4 energy detect level                     */
    __IOM uint32_t CCACTRL;                          /*!< (@ 0x00000538) IEEE 802.15.4 clear channel assessment control        */
    __IM uint32_t RESERVED15;
    __IOM uint32_t DATAWHITEIV;                      /*!< (@ 0x00000540) Data whitening initial value                          */
    __IM uint32_t RESERVED16[112];
    __IOM uint32_t TIMING;                           /*!< (@ 0x00000704) Timing                                                */
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000708) Frequency                                             */
    __IM uint32_t RESERVED17;
    __IOM uint32_t TXPOWER;                          /*!< (@ 0x00000710) Output power                                          */
    __IOM uint32_t TIFS;                             /*!< (@ 0x00000714) Interframe spacing in us                              */
    __IM uint32_t RSSISAMPLE;                        /*!< (@ 0x00000718) RSSI sample                                           */
    __IM uint32_t RESERVED18[123];
    __IOM uint32_t FECONFIG;                         /*!< (@ 0x00000908) Config register                                       */
    __IM uint32_t RESERVED19[253];
    __IOM uint32_t DFEMODE;                          /*!< (@ 0x00000D00) Whether to use Angle-of-Arrival (AOA) or
                                                                         Angle-of-Departure (AOD)*/
    __IM uint32_t DFESTATUS;                         /*!< (@ 0x00000D04) DFE status information                                */
    __IM uint32_t RESERVED20[2];
    __IOM uint32_t DFECTRL1;                         /*!< (@ 0x00000D10) Various configuration for Direction finding           */
    __IOM uint32_t DFECTRL2;                         /*!< (@ 0x00000D14) Start offset for Direction finding                    */
    __IM uint32_t RESERVED21[4];
    __IOM uint32_t SWITCHPATTERN;                    /*!< (@ 0x00000D28) GPIO patterns to be used for each antenna             */
    __OM uint32_t CLEARPATTERN;                      /*!< (@ 0x00000D2C) Clear the GPIO pattern array for antenna control      */
    __IOM NRF_RADIO_PSEL_Type PSEL;                  /*!< (@ 0x00000D30) (unspecified)                                         */
    __IOM NRF_RADIO_DFEPACKET_Type DFEPACKET;        /*!< (@ 0x00000D50) DFE packet EasyDMA channel                            */
    __IM uint32_t RESERVED22[43];
    __IM uint32_t CRCSTATUS;                         /*!< (@ 0x00000E0C) CRC status                                            */
    __IM uint32_t RXMATCH;                           /*!< (@ 0x00000E10) Received address                                      */
    __IM uint32_t RXCRC;                             /*!< (@ 0x00000E14) CRC field of previously received packet               */
    __IM uint32_t DAI;                               /*!< (@ 0x00000E18) Device address match index                            */
    __IM uint32_t PDUSTAT;                           /*!< (@ 0x00000E1C) Payload status                                        */
    __IOM uint32_t PCNF0;                            /*!< (@ 0x00000E20) Packet configuration register 0                       */
    __IM uint32_t RESERVED23;
    __IOM uint32_t PCNF1;                            /*!< (@ 0x00000E28) Packet configuration register 1                       */
    __IOM uint32_t BASE0;                            /*!< (@ 0x00000E2C) Base address 0                                        */
    __IOM uint32_t BASE1;                            /*!< (@ 0x00000E30) Base address 1                                        */
    __IOM uint32_t PREFIX0;                          /*!< (@ 0x00000E34) Prefixes bytes for logical addresses 0-3              */
    __IOM uint32_t PREFIX1;                          /*!< (@ 0x00000E38) Prefixes bytes for logical addresses 4-7              */
    __IOM uint32_t TXADDRESS;                        /*!< (@ 0x00000E3C) Transmit address select                               */
    __IOM uint32_t RXADDRESSES;                      /*!< (@ 0x00000E40) Receive address select                                */
    __IOM uint32_t CRCCNF;                           /*!< (@ 0x00000E44) CRC configuration                                     */
    __IOM uint32_t CRCPOLY;                          /*!< (@ 0x00000E48) CRC polynomial                                        */
    __IOM uint32_t CRCINIT;                          /*!< (@ 0x00000E4C) CRC initial value                                     */
    __IOM uint32_t DAB[8];                           /*!< (@ 0x00000E50) Device address base segment n                         */
    __IOM uint32_t DAP[8];                           /*!< (@ 0x00000E70) Device address prefix n                               */
    __IOM uint32_t DACNF;                            /*!< (@ 0x00000E90) Device address match configuration                    */
    __IOM uint32_t BCC;                              /*!< (@ 0x00000E94) Bit counter compare                                   */
    __IM uint32_t RESERVED24[3];
    __IM uint32_t CTESTATUS;                         /*!< (@ 0x00000EA4) CTEInfo parsed from received packet                   */
    __IM uint32_t RESERVED25[3];
    __IOM uint32_t MHRMATCHCONF;                     /*!< (@ 0x00000EB4) Search pattern configuration                          */
    __IOM uint32_t MHRMATCHMASK;                     /*!< (@ 0x00000EB8) Pattern mask                                          */
    __IOM uint32_t SFD;                              /*!< (@ 0x00000EBC) IEEE 802.15.4 start of frame delimiter                */
    __IOM uint32_t CTEINLINECONF;                    /*!< (@ 0x00000EC0) Configuration for CTE inline mode                     */
    __IM uint32_t RESERVED26[3];
    __IOM uint32_t PACKETPTR;                        /*!< (@ 0x00000ED0) Packet pointer                                        */
    __IM uint32_t RESERVED27[75];
    __IOM NRF_RADIO_CSTONES_Type CSTONES;            /*!< (@ 0x00001000) (unspecified)                                         */
    __IOM NRF_RADIO_RTT_Type RTT;                    /*!< (@ 0x00001050) (unspecified)                                         */
  } NRF_RADIO_Type;                                  /*!< Size = 4196 (0x1064)                                                 */

/* RADIO_TASKS_TXEN: Enable RADIO in TX mode */
  #define RADIO_TASKS_TXEN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TXEN register.                                  */

