NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* LPCOMP @Bit 17 : Reset due to wakeup from System OFF mode when wakeup is triggered by LPCOMP (Low Power Comparator). */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Pos (17UL) /*!< Position of LPCOMP field.                                          */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_LPCOMP_Pos) /*!< Bit mask of LPCOMP field.*/
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Min (0x0UL) /*!< Min enumerator value of LPCOMP field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Max (0x1UL) /*!< Max enumerator value of LPCOMP field.                             */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_NotDetected (0x0UL) /*!< Not detected                                              */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Detected (0x1UL) /*!< Detected                                                     */

/* DIF @Bit 18 : Reset due to wakeup from System OFF mode when wakeup is triggered by entering the debug interface mode. */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Pos (18UL)  /*!< Position of DIF field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_DIF_Pos) /*!< Bit mask of DIF field.         */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Min (0x0UL) /*!< Min enumerator value of DIF field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Max (0x1UL) /*!< Max enumerator value of DIF field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Detected (0x1UL) /*!< Detected                                                        */

/* GRTC @Bit 19 : Reset due to wakeup from System OFF mode when wakeup is triggered by GRTC interrupt. */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Pos (19UL) /*!< Position of GRTC field.                                              */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_GRTC_Pos) /*!< Bit mask of GRTC field.      */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Min (0x0UL) /*!< Min enumerator value of GRTC field.                                 */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Max (0x1UL) /*!< Max enumerator value of GRTC field.                                 */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_NotDetected (0x0UL) /*!< Not detected                                                */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Detected (0x1UL) /*!< Detected                                                       */

/* NFC @Bit 20 : Reset due to wakeup from System OFF mode when wakeup is triggered by NFC field detection in sense mode. */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Pos (20UL)  /*!< Position of NFC field.                                               */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_NFC_Pos) /*!< Bit mask of NFC field.         */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Min (0x0UL) /*!< Min enumerator value of NFC field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Max (0x1UL) /*!< Max enumerator value of NFC field.                                   */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Detected (0x1UL) /*!< Detected                                                        */

/* VUSB @Bit 21 : Reset after wakeup from System OFF mode due to VBUS rising into valid range. */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Pos (21UL) /*!< Position of VUSB field.                                              */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_VUSB_Pos) /*!< Bit mask of VUSB field.      */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Min (0x0UL) /*!< Min enumerator value of VUSB field.                                 */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Max (0x1UL) /*!< Max enumerator value of VUSB field.                                 */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_NotDetected (0x0UL) /*!< Not detected                                                */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Detected (0x1UL) /*!< Detected                                                       */


/* RESETINFO_RESETREAS_LOCAL: Local reset reason. */
  #define RESETINFO_RESETREAS_LOCAL_ResetValue (0x00000000UL) /*!< Reset value of LOCAL register.                              */

/* WDT0 @Bit 0 : Reset from the local watchdog timer 0 detected */
  #define RESETINFO_RESETREAS_LOCAL_WDT0_Pos (0UL)   /*!< Position of WDT0 field.                                              */
  #define RESETINFO_RESETREAS_LOCAL_WDT0_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_WDT0_Pos) /*!< Bit mask of WDT0 field.        */
  #define RESETINFO_RESETREAS_LOCAL_WDT0_Min (0x0UL) /*!< Min enumerator value of WDT0 field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_WDT0_Max (0x1UL) /*!< Max enumerator value of WDT0 field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_WDT0_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_LOCAL_WDT0_Detected (0x1UL) /*!< Detected                                                        */

/* WDT1 @Bit 1 : Reset from the local watchdog timer 1 detected */
  #define RESETINFO_RESETREAS_LOCAL_WDT1_Pos (1UL)   /*!< Position of WDT1 field.                                              */
  #define RESETINFO_RESETREAS_LOCAL_WDT1_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_WDT1_Pos) /*!< Bit mask of WDT1 field.        */
  #define RESETINFO_RESETREAS_LOCAL_WDT1_Min (0x0UL) /*!< Min enumerator value of WDT1 field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_WDT1_Max (0x1UL) /*!< Max enumerator value of WDT1 field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_WDT1_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_LOCAL_WDT1_Detected (0x1UL) /*!< Detected                                                        */

/* SREQ @Bit 2 : Reset from the local soft reset request detected. */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Pos (2UL)   /*!< Position of SREQ field.                                              */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_SREQ_Pos) /*!< Bit mask of SREQ field.        */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Min (0x0UL) /*!< Min enumerator value of SREQ field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Max (0x1UL) /*!< Max enumerator value of SREQ field.                                  */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_NotDetected (0x0UL) /*!< Not detected                                                 */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Detected (0x1UL) /*!< Detected                                                        */

