NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* LOCKUP @Bit 3 : Reset from local CPU lockup detected */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Pos (3UL) /*!< Position of LOCKUP field.                                            */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_LOCKUP_Pos) /*!< Bit mask of LOCKUP field.  */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Min (0x0UL) /*!< Min enumerator value of LOCKUP field.                              */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Max (0x1UL) /*!< Max enumerator value of LOCKUP field.                              */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_NotDetected (0x0UL) /*!< Not detected                                               */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Detected (0x1UL) /*!< Detected                                                      */

/* UNRETAINEDWAKE @Bit 4 : Reset due to wake from unretained state. */
  #define RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Pos (4UL) /*!< Position of UNRETAINEDWAKE field.                            */
  #define RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Pos) /*!< Bit mask of
                                                                            UNRETAINEDWAKE field.*/



/* ================================================= Struct RESETINFO_ERROR ================================================== */
/**
  * @brief ERROR [RESETINFO_ERROR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000000) Reset error status.                                   */
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000004) Reset error address.                                  */
} NRF_RESETINFO_ERROR_Type;                          /*!< Size = 8 (0x008)                                                     */

/* RESETINFO_ERROR_STATUS: Reset error status. */
  #define RESETINFO_ERROR_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                                */

/* ERRORSTATUS @Bits 0..3 : Error status */
  #define RESETINFO_ERROR_STATUS_ERRORSTATUS_Pos (0UL) /*!< Position of ERRORSTATUS field.                                     */
  #define RESETINFO_ERROR_STATUS_ERRORSTATUS_Msk (0xFUL << RESETINFO_ERROR_STATUS_ERRORSTATUS_Pos) /*!< Bit mask of ERRORSTATUS
                                                                            field.*/


/* RESETINFO_ERROR_ADDRESS: Reset error address. */
  #define RESETINFO_ERROR_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                              */

/* ERRORADDRESS @Bits 0..31 : Error address */
  #define RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Pos (0UL) /*!< Position of ERRORADDRESS field.                                  */
  #define RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Msk (0xFFFFFFFFUL << RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Pos) /*!< Bit mask of
                                                                            ERRORADDRESS field.*/


/* ==================================================== Struct RESETINFO ===================================================== */
/**
  * @brief RESETINFO
  */
  typedef struct {                                   /*!< RESETINFO Structure                                                  */
    __IM uint32_t RESERVED[296];
    __IOM NRF_RESETINFO_RESETREAS_Type RESETREAS;    /*!< (@ 0x000004A0) (unspecified)                                         */
    __IOM NRF_RESETINFO_ERROR_Type ERROR;            /*!< (@ 0x000004A8) (unspecified)                                         */
    __IM uint32_t RESERVED1[4];
    __IOM uint32_t RESTOREVALID;                     /*!< (@ 0x000004C0) Valid restore image is present in RAM.                */
  } NRF_RESETINFO_Type;                              /*!< Size = 1220 (0x4C4)                                                  */

/* RESETINFO_RESTOREVALID: Valid restore image is present in RAM. */
  #define RESETINFO_RESTOREVALID_ResetValue (0x00000000UL) /*!< Reset value of RESTOREVALID register.                          */

/* RESTOREVALID @Bit 0 : Valid restore image is present in RAM. */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Pos (0UL) /*!< Position of RESTOREVALID field.                                   */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Msk (0x1UL << RESETINFO_RESTOREVALID_RESTOREVALID_Pos) /*!< Bit mask of
                                                                            RESTOREVALID field.*/
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Min (0x0UL) /*!< Min enumerator value of RESTOREVALID field.                     */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Max (0x1UL) /*!< Max enumerator value of RESTOREVALID field.                     */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_NotPreset (0x0UL) /*!< Not present                                               */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Present (0x1UL) /*!< Present                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct RTC ======================================================== */
/**
  * @brief Real-time counter
  */
  typedef struct {                                   /*!< RTC Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start RTC counter                                     */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop RTC counter                                      */
    __OM uint32_t TASKS_CLEAR;                       /*!< (@ 0x00000008) Clear RTC counter                                     */
    __OM uint32_t TASKS_TRIGOVRFLW;                  /*!< (@ 0x0000000C) Set counter to: maximum value - 0xF                   */
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_CAPTURE[8];                  /*!< (@ 0x00000040) Capture RTC counter to CC[n] register                 */
    __IM uint32_t RESERVED1[8];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_CLEAR;                  /*!< (@ 0x00000088) Subscribe configuration for task CLEAR                */
    __IOM uint32_t SUBSCRIBE_TRIGOVRFLW;             /*!< (@ 0x0000008C) Subscribe configuration for task TRIGOVRFLW           */
    __IM uint32_t RESERVED2[12];
    __IOM uint32_t SUBSCRIBE_CAPTURE[8];             /*!< (@ 0x000000C0) Subscribe configuration for task CAPTURE[n]           */
    __IM uint32_t RESERVED3[8];
    __IOM uint32_t EVENTS_TICK;                      /*!< (@ 0x00000100) Event on counter increment                            */
    __IOM uint32_t EVENTS_OVRFLW;                    /*!< (@ 0x00000104) Event on counter overflow                             */
    __IM uint32_t RESERVED4[14];
    __IOM uint32_t EVENTS_COMPARE[8];                /*!< (@ 0x00000140) Compare event on CC[n] match                          */
    __IM uint32_t RESERVED5[8];
    __IOM uint32_t PUBLISH_TICK;                     /*!< (@ 0x00000180) Publish configuration for event TICK                  */
    __IOM uint32_t PUBLISH_OVRFLW;                   /*!< (@ 0x00000184) Publish configuration for event OVRFLW                */
    __IM uint32_t RESERVED6[14];
    __IOM uint32_t PUBLISH_COMPARE[8];               /*!< (@ 0x000001C0) Publish configuration for event COMPARE[n]            */
    __IM uint32_t RESERVED7[8];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED8[64];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED9[13];
    __IOM uint32_t EVTEN;                            /*!< (@ 0x00000340) Enable or disable event routing                       */
    __IOM uint32_t EVTENSET;                         /*!< (@ 0x00000344) Enable event routing                                  */
    __IOM uint32_t EVTENCLR;                         /*!< (@ 0x00000348) Disable event routing                                 */
    __IM uint32_t RESERVED10[110];
    __IM uint32_t COUNTER;                           /*!< (@ 0x00000504) Current counter value                                 */
    __IOM uint32_t PRESCALER;                        /*!< (@ 0x00000508) 12-bit prescaler for counter frequency (32768 /
                                                                         (PRESCALER + 1)). Must be written when RTC is stopped.*/
    __IM uint32_t RESERVED11[13];
    __IOM uint32_t CC[8];                            /*!< (@ 0x00000540) Compare register n                                    */
  } NRF_RTC_Type;                                    /*!< Size = 1376 (0x560)                                                  */

/* RTC_TASKS_START: Start RTC counter */
  #define RTC_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start RTC counter */
  #define RTC_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define RTC_TASKS_START_TASKS_START_Msk (0x1UL << RTC_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define RTC_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define RTC_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define RTC_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RTC_TASKS_STOP: Stop RTC counter */
  #define RTC_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop RTC counter */
  #define RTC_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define RTC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << RTC_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define RTC_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define RTC_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define RTC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* RTC_TASKS_CLEAR: Clear RTC counter */
  #define RTC_TASKS_CLEAR_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_CLEAR register.                                 */

/* TASKS_CLEAR @Bit 0 : Clear RTC counter */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Pos (0UL)      /*!< Position of TASKS_CLEAR field.                                       */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Msk (0x1UL << RTC_TASKS_CLEAR_TASKS_CLEAR_Pos) /*!< Bit mask of TASKS_CLEAR field.       */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Min (0x1UL)    /*!< Min enumerator value of TASKS_CLEAR field.                           */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Max (0x1UL)    /*!< Max enumerator value of TASKS_CLEAR field.                           */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RTC_TASKS_TRIGOVRFLW: Set counter to: maximum value - 0xF */
  #define RTC_TASKS_TRIGOVRFLW_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGOVRFLW register.                        */

/* TASKS_TRIGOVRFLW @Bit 0 : Set counter to: maximum value - 0xF */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos (0UL) /*!< Position of TASKS_TRIGOVRFLW field.                             */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Msk (0x1UL << RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGOVRFLW field.*/
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGOVRFLW field.               */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGOVRFLW field.               */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Trigger (0x1UL) /*!< Trigger task                                              */


/* RTC_TASKS_CAPTURE: Capture RTC counter to CC[n] register */
  #define RTC_TASKS_CAPTURE_MaxCount (8UL)           /*!< Max size of TASKS_CAPTURE[8] array.                                  */
  #define RTC_TASKS_CAPTURE_MaxIndex (7UL)           /*!< Max index of TASKS_CAPTURE[8] array.                                 */
  #define RTC_TASKS_CAPTURE_MinIndex (0UL)           /*!< Min index of TASKS_CAPTURE[8] array.                                 */
  #define RTC_TASKS_CAPTURE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CAPTURE[8] register.                           */

