NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* RTC_SUBSCRIBE_CAPTURE: Subscribe configuration for task CAPTURE[n] */
  #define RTC_SUBSCRIBE_CAPTURE_MaxCount (8UL)       /*!< Max size of SUBSCRIBE_CAPTURE[8] array.                              */
  #define RTC_SUBSCRIBE_CAPTURE_MaxIndex (7UL)       /*!< Max index of SUBSCRIBE_CAPTURE[8] array.                             */
  #define RTC_SUBSCRIBE_CAPTURE_MinIndex (0UL)       /*!< Min index of SUBSCRIBE_CAPTURE[8] array.                             */
  #define RTC_SUBSCRIBE_CAPTURE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CAPTURE[8] register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that task CAPTURE[n] will subscribe to */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_CAPTURE_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Msk (0x1UL << RTC_SUBSCRIBE_CAPTURE_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* RTC_EVENTS_TICK: Event on counter increment */
  #define RTC_EVENTS_TICK_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_TICK register.                                 */

/* EVENTS_TICK @Bit 0 : Event on counter increment */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Pos (0UL)      /*!< Position of EVENTS_TICK field.                                       */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Msk (0x1UL << RTC_EVENTS_TICK_EVENTS_TICK_Pos) /*!< Bit mask of EVENTS_TICK field.       */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Min (0x0UL)    /*!< Min enumerator value of EVENTS_TICK field.                           */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Max (0x1UL)    /*!< Max enumerator value of EVENTS_TICK field.                           */
  #define RTC_EVENTS_TICK_EVENTS_TICK_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Generated (0x1UL) /*!< Event generated                                                   */


/* RTC_EVENTS_OVRFLW: Event on counter overflow */
  #define RTC_EVENTS_OVRFLW_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_OVRFLW register.                              */

/* EVENTS_OVRFLW @Bit 0 : Event on counter overflow */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos (0UL)  /*!< Position of EVENTS_OVRFLW field.                                     */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Msk (0x1UL << RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos) /*!< Bit mask of EVENTS_OVRFLW
                                                                            field.*/
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Min (0x0UL) /*!< Min enumerator value of EVENTS_OVRFLW field.                        */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Max (0x1UL) /*!< Max enumerator value of EVENTS_OVRFLW field.                        */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Generated (0x1UL) /*!< Event generated                                               */


/* RTC_EVENTS_COMPARE: Compare event on CC[n] match */
  #define RTC_EVENTS_COMPARE_MaxCount (8UL)          /*!< Max size of EVENTS_COMPARE[8] array.                                 */
  #define RTC_EVENTS_COMPARE_MaxIndex (7UL)          /*!< Max index of EVENTS_COMPARE[8] array.                                */
  #define RTC_EVENTS_COMPARE_MinIndex (0UL)          /*!< Min index of EVENTS_COMPARE[8] array.                                */
  #define RTC_EVENTS_COMPARE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_COMPARE[8] register.                         */

/* EVENTS_COMPARE @Bit 0 : Compare event on CC[n] match */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL) /*!< Position of EVENTS_COMPARE field.                                   */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of EVENTS_COMPARE
                                                                            field.*/
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Min (0x0UL) /*!< Min enumerator value of EVENTS_COMPARE field.                     */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Max (0x1UL) /*!< Max enumerator value of EVENTS_COMPARE field.                     */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Generated (0x1UL) /*!< Event generated                                             */


/* RTC_PUBLISH_TICK: Publish configuration for event TICK */
  #define RTC_PUBLISH_TICK_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TICK register.                                */

/* CHIDX @Bits 0..7 : DPPI channel that event TICK will publish to */
  #define RTC_PUBLISH_TICK_CHIDX_Pos (0UL)           /*!< Position of CHIDX field.                                             */
  #define RTC_PUBLISH_TICK_CHIDX_Msk (0xFFUL << RTC_PUBLISH_TICK_CHIDX_Pos) /*!< Bit mask of CHIDX field.                      */
  #define RTC_PUBLISH_TICK_CHIDX_Min (0x00UL)        /*!< Min value of CHIDX field.                                            */
  #define RTC_PUBLISH_TICK_CHIDX_Max (0xFFUL)        /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_TICK_EN_Pos (31UL)             /*!< Position of EN field.                                                */
  #define RTC_PUBLISH_TICK_EN_Msk (0x1UL << RTC_PUBLISH_TICK_EN_Pos) /*!< Bit mask of EN field.                                */
  #define RTC_PUBLISH_TICK_EN_Min (0x0UL)            /*!< Min enumerator value of EN field.                                    */
  #define RTC_PUBLISH_TICK_EN_Max (0x1UL)            /*!< Max enumerator value of EN field.                                    */
  #define RTC_PUBLISH_TICK_EN_Disabled (0x0UL)       /*!< Disable publishing                                                   */
  #define RTC_PUBLISH_TICK_EN_Enabled (0x1UL)        /*!< Enable publishing                                                    */


/* RTC_PUBLISH_OVRFLW: Publish configuration for event OVRFLW */
  #define RTC_PUBLISH_OVRFLW_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_OVRFLW register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event OVRFLW will publish to */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Msk (0xFFUL << RTC_PUBLISH_OVRFLW_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_OVRFLW_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define RTC_PUBLISH_OVRFLW_EN_Msk (0x1UL << RTC_PUBLISH_OVRFLW_EN_Pos) /*!< Bit mask of EN field.                            */
  #define RTC_PUBLISH_OVRFLW_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define RTC_PUBLISH_OVRFLW_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define RTC_PUBLISH_OVRFLW_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define RTC_PUBLISH_OVRFLW_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* RTC_PUBLISH_COMPARE: Publish configuration for event COMPARE[n] */
  #define RTC_PUBLISH_COMPARE_MaxCount (8UL)         /*!< Max size of PUBLISH_COMPARE[8] array.                                */
  #define RTC_PUBLISH_COMPARE_MaxIndex (7UL)         /*!< Max index of PUBLISH_COMPARE[8] array.                               */
  #define RTC_PUBLISH_COMPARE_MinIndex (0UL)         /*!< Min index of PUBLISH_COMPARE[8] array.                               */
  #define RTC_PUBLISH_COMPARE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_COMPARE[8] register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that event COMPARE[n] will publish to */
  #define RTC_PUBLISH_COMPARE_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define RTC_PUBLISH_COMPARE_CHIDX_Msk (0xFFUL << RTC_PUBLISH_COMPARE_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define RTC_PUBLISH_COMPARE_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define RTC_PUBLISH_COMPARE_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_COMPARE_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define RTC_PUBLISH_COMPARE_EN_Msk (0x1UL << RTC_PUBLISH_COMPARE_EN_Pos) /*!< Bit mask of EN field.                          */
  #define RTC_PUBLISH_COMPARE_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define RTC_PUBLISH_COMPARE_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define RTC_PUBLISH_COMPARE_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define RTC_PUBLISH_COMPARE_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* RTC_SHORTS: Shortcuts between local events and tasks */
  #define RTC_SHORTS_ResetValue (0x00000000UL)       /*!< Reset value of SHORTS register.                                      */

/* COMPARE0_CLEAR @Bit 0 : Shortcut between event COMPARE[0] and task CLEAR */
  #define RTC_SHORTS_COMPARE0_CLEAR_Pos (0UL)        /*!< Position of COMPARE0_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE0_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE0_CLEAR_Pos) /*!< Bit mask of COMPARE0_CLEAR field.        */
  #define RTC_SHORTS_COMPARE0_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE0_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE0_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE0_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE0_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE0_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE1_CLEAR @Bit 1 : Shortcut between event COMPARE[1] and task CLEAR */
  #define RTC_SHORTS_COMPARE1_CLEAR_Pos (1UL)        /*!< Position of COMPARE1_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE1_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE1_CLEAR_Pos) /*!< Bit mask of COMPARE1_CLEAR field.        */
  #define RTC_SHORTS_COMPARE1_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE1_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE1_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE1_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE1_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE1_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE2_CLEAR @Bit 2 : Shortcut between event COMPARE[2] and task CLEAR */
  #define RTC_SHORTS_COMPARE2_CLEAR_Pos (2UL)        /*!< Position of COMPARE2_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE2_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE2_CLEAR_Pos) /*!< Bit mask of COMPARE2_CLEAR field.        */
  #define RTC_SHORTS_COMPARE2_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE2_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE2_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE2_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE2_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE2_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE3_CLEAR @Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
  #define RTC_SHORTS_COMPARE3_CLEAR_Pos (3UL)        /*!< Position of COMPARE3_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE3_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE3_CLEAR_Pos) /*!< Bit mask of COMPARE3_CLEAR field.        */
  #define RTC_SHORTS_COMPARE3_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE3_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE3_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE3_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE3_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE3_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE4_CLEAR @Bit 4 : Shortcut between event COMPARE[4] and task CLEAR */
  #define RTC_SHORTS_COMPARE4_CLEAR_Pos (4UL)        /*!< Position of COMPARE4_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE4_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE4_CLEAR_Pos) /*!< Bit mask of COMPARE4_CLEAR field.        */
  #define RTC_SHORTS_COMPARE4_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE4_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE4_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE4_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE4_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE4_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE5_CLEAR @Bit 5 : Shortcut between event COMPARE[5] and task CLEAR */
  #define RTC_SHORTS_COMPARE5_CLEAR_Pos (5UL)        /*!< Position of COMPARE5_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE5_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE5_CLEAR_Pos) /*!< Bit mask of COMPARE5_CLEAR field.        */
  #define RTC_SHORTS_COMPARE5_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE5_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE5_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE5_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE5_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE5_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE6_CLEAR @Bit 6 : Shortcut between event COMPARE[6] and task CLEAR */
  #define RTC_SHORTS_COMPARE6_CLEAR_Pos (6UL)        /*!< Position of COMPARE6_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE6_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE6_CLEAR_Pos) /*!< Bit mask of COMPARE6_CLEAR field.        */
  #define RTC_SHORTS_COMPARE6_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE6_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE6_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE6_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE6_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE6_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE7_CLEAR @Bit 7 : Shortcut between event COMPARE[7] and task CLEAR */
  #define RTC_SHORTS_COMPARE7_CLEAR_Pos (7UL)        /*!< Position of COMPARE7_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE7_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE7_CLEAR_Pos) /*!< Bit mask of COMPARE7_CLEAR field.        */
  #define RTC_SHORTS_COMPARE7_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE7_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE7_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE7_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE7_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE7_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */


/* RTC_INTENSET: Enable interrupt */
  #define RTC_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* TICK @Bit 0 : Write '1' to enable interrupt for event TICK */
  #define RTC_INTENSET_TICK_Pos (0UL)                /*!< Position of TICK field.                                              */
  #define RTC_INTENSET_TICK_Msk (0x1UL << RTC_INTENSET_TICK_Pos) /*!< Bit mask of TICK field.                                  */
  #define RTC_INTENSET_TICK_Min (0x0UL)              /*!< Min enumerator value of TICK field.                                  */
  #define RTC_INTENSET_TICK_Max (0x1UL)              /*!< Max enumerator value of TICK field.                                  */
  #define RTC_INTENSET_TICK_Set (0x1UL)              /*!< Enable                                                               */
  #define RTC_INTENSET_TICK_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define RTC_INTENSET_TICK_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

