NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* SPIM_PSEL_MISO: Pin select for MISO signal */
  #define SPIM_PSEL_MISO_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of MISO register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_MISO_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define SPIM_PSEL_MISO_PIN_Msk (0x1FUL << SPIM_PSEL_MISO_PIN_Pos) /*!< Bit mask of PIN field.                                */
  #define SPIM_PSEL_MISO_PIN_Min (0x00UL)            /*!< Min value of PIN field.                                              */
  #define SPIM_PSEL_MISO_PIN_Max (0x1FUL)            /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_MISO_PORT_Pos (5UL)              /*!< Position of PORT field.                                              */
  #define SPIM_PSEL_MISO_PORT_Msk (0xFUL << SPIM_PSEL_MISO_PORT_Pos) /*!< Bit mask of PORT field.                              */
  #define SPIM_PSEL_MISO_PORT_Min (0x0UL)            /*!< Min value of PORT field.                                             */
  #define SPIM_PSEL_MISO_PORT_Max (0xFUL)            /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_MISO_CONNECT_Pos (31UL)          /*!< Position of CONNECT field.                                           */
  #define SPIM_PSEL_MISO_CONNECT_Msk (0x1UL << SPIM_PSEL_MISO_CONNECT_Pos) /*!< Bit mask of CONNECT field.                     */
  #define SPIM_PSEL_MISO_CONNECT_Min (0x0UL)         /*!< Min enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_MISO_CONNECT_Max (0x1UL)         /*!< Max enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_MISO_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                          */
  #define SPIM_PSEL_MISO_CONNECT_Connected (0x0UL)   /*!< Connect                                                              */


/* SPIM_PSEL_DCX: Pin select for DCX signal */
  #define SPIM_PSEL_DCX_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of DCX register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_DCX_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define SPIM_PSEL_DCX_PIN_Msk (0x1FUL << SPIM_PSEL_DCX_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define SPIM_PSEL_DCX_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define SPIM_PSEL_DCX_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_DCX_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define SPIM_PSEL_DCX_PORT_Msk (0xFUL << SPIM_PSEL_DCX_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define SPIM_PSEL_DCX_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define SPIM_PSEL_DCX_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_DCX_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define SPIM_PSEL_DCX_CONNECT_Msk (0x1UL << SPIM_PSEL_DCX_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define SPIM_PSEL_DCX_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_DCX_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_DCX_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define SPIM_PSEL_DCX_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* SPIM_PSEL_CSN: Pin select for CSN */
  #define SPIM_PSEL_CSN_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of CSN register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_CSN_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define SPIM_PSEL_CSN_PIN_Msk (0x1FUL << SPIM_PSEL_CSN_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define SPIM_PSEL_CSN_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define SPIM_PSEL_CSN_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_CSN_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define SPIM_PSEL_CSN_PORT_Msk (0xFUL << SPIM_PSEL_CSN_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define SPIM_PSEL_CSN_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define SPIM_PSEL_CSN_PORT_Max (0xFUL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_CSN_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define SPIM_PSEL_CSN_CONNECT_Msk (0x1UL << SPIM_PSEL_CSN_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define SPIM_PSEL_CSN_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_CSN_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define SPIM_PSEL_CSN_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define SPIM_PSEL_CSN_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */



/* ================================================ Struct SPIM_DMA_RX_MATCH ================================================= */
/**
  * @brief MATCH [SPIM_DMA_RX_MATCH] Registers to control the behavior of the pattern matcher engine
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Configure individual match events                     */
  __IOM uint32_t  CANDIDATE[4];                      /*!< (@ 0x00000004) The data to look for - any match will trigger the
                                                                         MATCH[n] event, if enabled.*/
} NRF_SPIM_DMA_RX_MATCH_Type;                        /*!< Size = 20 (0x014)                                                    */

/* SPIM_DMA_RX_MATCH_CONFIG: Configure individual match events */
  #define SPIM_DMA_RX_MATCH_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                              */

