NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Pos (8UL) /*!< Position of LOCK field.                                    */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Pos) /*!< Bit mask
                                                                            of LOCK field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                      */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                      */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                  */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next
                                                                         reset*/

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Pos (16UL) /*!< Position of OWNERID field.                             */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Pos) /*!<
                                                                            Bit mask of OWNERID field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Min (0x0UL) /*!< Min value of OWNERID field.                           */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Max (0xFUL) /*!< Max size of OWNERID field.                            */



/* ================================================ Struct SPU_FEATURE_BELLS ================================================= */
/**
  * @brief BELLS [SPU_FEATURE_BELLS] (unspecified)
  */
typedef struct {
  __IOM NRF_SPU_FEATURE_BELLS_PROCESSOR_Type PROCESSOR[8]; /*!< (@ 0x00000000) (unspecified)                                   */
} NRF_SPU_FEATURE_BELLS_Type;                        /*!< Size = 1536 (0x600)                                                  */


/* =================================================== Struct SPU_FEATURE ==================================================== */
/**
  * @brief FEATURE [SPU_FEATURE] (unspecified)
  */
typedef union {
  struct {
    __IOM NRF_SPU_FEATURE_IPCT_Type IPCT;            /*!< (@ 0x00000000) (unspecified)                                         */
    __IOM NRF_SPU_FEATURE_DPPIC_Type DPPIC;          /*!< (@ 0x00000080) (unspecified)                                         */
    __IOM NRF_SPU_FEATURE_GPIOTE_Type GPIOTE[1];     /*!< (@ 0x00000100) (unspecified)                                         */
    __IM uint32_t RESERVED[48];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_SPU_FEATURE_GPIO_Type GPIO[10];      /*!< (@ 0x00000200) (unspecified)                                         */
      struct {
        __IOM NRF_SPU_FEATURE_GRTC_Type GRTC;        /*!< (@ 0x00000200) (unspecified)                                         */
      };
      struct {
        __IM uint32_t RESERVED1[256];
        __IOM NRF_SPU_FEATURE_MRAMC_Type MRAMC[2];   /*!< (@ 0x00000600) (unspecified)                                         */
      };
      __IM uint32_t RESERVED2[320];
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
  };
  __IOM NRF_SPU_FEATURE_BELLS_Type BELLS;            /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED3[448];
} NRF_SPU_FEATURE_Type;                              /*!< Size = 1792 (0x700)                                                  */

/* ======================================================= Struct SPU ======================================================== */
/**
  * @brief System protection unit
  */
  typedef struct {                                   /*!< SPU Structure                                                        */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_PERIPHACCERR;              /*!< (@ 0x00000100) A security violation has been detected on one or
                                                                         several peripherals*/
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[61];
    __IOM NRF_SPU_PERIPHACCERR_Type PERIPHACCERR;    /*!< (@ 0x00000404) (unspecified)                                         */
    __IM uint32_t RESERVED3[61];
    __IOM NRF_SPU_PERIPH_Type PERIPH[32];            /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED4[32];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM uint32_t FEATURES[576];                  /*!< (@ 0x00000600) Configuration of split security feature [n]           */
      __IOM NRF_SPU_FEATURE_Type FEATURE;            /*!< (@ 0x00000600) (unspecified)                                         */
      __IM uint32_t RESERVED5[576];
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
  } NRF_SPU_Type;                                    /*!< Size = 3840 (0xF00)                                                  */

/* SPU_EVENTS_PERIPHACCERR: A security violation has been detected on one or several peripherals */
  #define SPU_EVENTS_PERIPHACCERR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PERIPHACCERR register.                  */

