NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* EVENTS_PERIPHACCERR @Bit 0 : A security violation has been detected on one or several peripherals */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Pos (0UL) /*!< Position of EVENTS_PERIPHACCERR field.                    */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Msk (0x1UL << SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Pos) /*!< Bit
                                                                            mask of EVENTS_PERIPHACCERR field.*/
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Min (0x0UL) /*!< Min enumerator value of EVENTS_PERIPHACCERR field.      */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Max (0x1UL) /*!< Max enumerator value of EVENTS_PERIPHACCERR field.      */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Generated (0x1UL) /*!< Event generated                                   */


/* SPU_INTEN: Enable or disable interrupt */
  #define SPU_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* PERIPHACCERR @Bit 0 : Enable or disable interrupt for event PERIPHACCERR */
  #define SPU_INTEN_PERIPHACCERR_Pos (0UL)           /*!< Position of PERIPHACCERR field.                                      */
  #define SPU_INTEN_PERIPHACCERR_Msk (0x1UL << SPU_INTEN_PERIPHACCERR_Pos) /*!< Bit mask of PERIPHACCERR field.                */
  #define SPU_INTEN_PERIPHACCERR_Min (0x0UL)         /*!< Min enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTEN_PERIPHACCERR_Max (0x1UL)         /*!< Max enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTEN_PERIPHACCERR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SPU_INTEN_PERIPHACCERR_Enabled (0x1UL)     /*!< Enable                                                               */


/* SPU_INTENSET: Enable interrupt */
  #define SPU_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* PERIPHACCERR @Bit 0 : Write '1' to enable interrupt for event PERIPHACCERR */
  #define SPU_INTENSET_PERIPHACCERR_Pos (0UL)        /*!< Position of PERIPHACCERR field.                                      */
  #define SPU_INTENSET_PERIPHACCERR_Msk (0x1UL << SPU_INTENSET_PERIPHACCERR_Pos) /*!< Bit mask of PERIPHACCERR field.          */
  #define SPU_INTENSET_PERIPHACCERR_Min (0x0UL)      /*!< Min enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTENSET_PERIPHACCERR_Max (0x1UL)      /*!< Max enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTENSET_PERIPHACCERR_Set (0x1UL)      /*!< Enable                                                               */
  #define SPU_INTENSET_PERIPHACCERR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SPU_INTENSET_PERIPHACCERR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* SPU_INTENCLR: Disable interrupt */
  #define SPU_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* PERIPHACCERR @Bit 0 : Write '1' to disable interrupt for event PERIPHACCERR */
  #define SPU_INTENCLR_PERIPHACCERR_Pos (0UL)        /*!< Position of PERIPHACCERR field.                                      */
  #define SPU_INTENCLR_PERIPHACCERR_Msk (0x1UL << SPU_INTENCLR_PERIPHACCERR_Pos) /*!< Bit mask of PERIPHACCERR field.          */
  #define SPU_INTENCLR_PERIPHACCERR_Min (0x0UL)      /*!< Min enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTENCLR_PERIPHACCERR_Max (0x1UL)      /*!< Max enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTENCLR_PERIPHACCERR_Clear (0x1UL)    /*!< Disable                                                              */
  #define SPU_INTENCLR_PERIPHACCERR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SPU_INTENCLR_PERIPHACCERR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* SPU_INTPEND: Pending interrupts */
  #define SPU_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* PERIPHACCERR @Bit 0 : Read pending status of interrupt for event PERIPHACCERR */
  #define SPU_INTPEND_PERIPHACCERR_Pos (0UL)         /*!< Position of PERIPHACCERR field.                                      */
  #define SPU_INTPEND_PERIPHACCERR_Msk (0x1UL << SPU_INTPEND_PERIPHACCERR_Pos) /*!< Bit mask of PERIPHACCERR field.            */
  #define SPU_INTPEND_PERIPHACCERR_Min (0x0UL)       /*!< Min enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTPEND_PERIPHACCERR_Max (0x1UL)       /*!< Max enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTPEND_PERIPHACCERR_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define SPU_INTPEND_PERIPHACCERR_Pending (0x1UL)   /*!< Read: Pending                                                        */


/* SPU_FEATURES: Configuration of split security feature [n] */
  #define SPU_FEATURES_MaxCount (576UL)              /*!< Max size of FEATURES[576] array.                                     */
  #define SPU_FEATURES_MaxIndex (575UL)              /*!< Max index of FEATURES[576] array.                                    */
  #define SPU_FEATURES_MinIndex (0UL)                /*!< Min index of FEATURES[576] array.                                    */
  #define SPU_FEATURES_ResetValue (0x00000000UL)     /*!< Reset value of FEATURES[576] register.                               */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURES_SECATTR_Pos (4UL)             /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURES_SECATTR_Msk (0x1UL << SPU_FEATURES_SECATTR_Pos) /*!< Bit mask of SECATTR field.                         */
  #define SPU_FEATURES_SECATTR_Min (0x0UL)           /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURES_SECATTR_Max (0x1UL)           /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURES_SECATTR_NonSecure (0x0UL)     /*!< Feature is available for non-secure usage                            */
  #define SPU_FEATURES_SECATTR_Secure (0x1UL)        /*!< Feature is reserved for secure usage                                 */

