NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURES_LOCK_Pos (8UL)                /*!< Position of LOCK field.                                              */
  #define SPU_FEATURES_LOCK_Msk (0x1UL << SPU_FEATURES_LOCK_Pos) /*!< Bit mask of LOCK field.                                  */
  #define SPU_FEATURES_LOCK_Min (0x0UL)              /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURES_LOCK_Max (0x1UL)              /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURES_LOCK_Unlocked (0x0UL)         /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURES_LOCK_Locked (0x1UL)           /*!< Feature permissions can not be changed until the next reset          */

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURES_OWNERID_Pos (16UL)            /*!< Position of OWNERID field.                                           */
  #define SPU_FEATURES_OWNERID_Msk (0xFUL << SPU_FEATURES_OWNERID_Pos) /*!< Bit mask of OWNERID field.                         */
  #define SPU_FEATURES_OWNERID_Min (0x0UL)           /*!< Min value of OWNERID field.                                          */
  #define SPU_FEATURES_OWNERID_Max (0xFUL)           /*!< Max size of OWNERID field.                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            STM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct STM ======================================================== */
/**
  * @brief System Trace Macrocell
  */
  typedef struct {                                   /*!< STM Structure                                                        */
    __IM uint32_t RESERVED[772];
    __IOM uint32_t DMACTLR;                          /*!< (@ 0x00000C10) Controls the DMA transfer request mechanism.          */
    __IM uint32_t RESERVED1[120];
    __IM uint32_t HEMASTR;                           /*!< (@ 0x00000DF4) Indicates the STPv2 master number of hardware event
                                                                         trace. This number is the master number presented in
                                                                         STPv2.*/
    __IM uint32_t HEFEAT1R;                          /*!< (@ 0x00000DF8) Indicates the features of the STM.                    */
    __IM uint32_t HEIDR;                             /*!< (@ 0x00000DFC) Indicates the features of hardware event tracing in the
                                                                         STM.*/
    __IM uint32_t RESERVED2[32];
    __IOM uint32_t TCSR;                             /*!< (@ 0x00000E80) Controls the STM settings.                            */
    __IM uint32_t RESERVED3[4];
    __IOM uint32_t AUXCR;                            /*!< (@ 0x00000E94) Used for implementation defined STM controls.         */
    __IM uint32_t RESERVED4[2];
    __IOM uint32_t SPFEAT1R;                         /*!< (@ 0x00000EA0) Indicates the features of the STM.                    */
    __IOM uint32_t SPFEAT2R;                         /*!< (@ 0x00000EA4) Indicates the features of the STM.                    */
    __IOM uint32_t SPFEAT3R;                         /*!< (@ 0x00000EA8) Indicates the features of the STM.                    */
    __IM uint32_t RESERVED5[15];
    __OM uint32_t ITTRIGGER;                         /*!< (@ 0x00000EE8) Integration Test for Cross-Trigger Outputs Register.  */
    __OM uint32_t ITATBDATA0;                        /*!< (@ 0x00000EEC) Controls the value of the ATDATAM output in integration
                                                                         mode.*/
    __OM uint32_t ITATBCTR2;                         /*!< (@ 0x00000EF0) Controls the value of the ATDATAM output in integration
                                                                         mode.*/
    __OM uint32_t ITATBID;                           /*!< (@ 0x00000EF4) Controls the value of the ATIDM output in integration
                                                                         mode.*/
    __OM uint32_t ITATBCTR0;                         /*!< (@ 0x00000EF8) Controls the value of the ATVALIDM, AFREADYM, and
                                                                         ATBYTESM outputs in integration mode.*/
    __IM uint32_t RESERVED6;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) Used to enable topology detection. This register
                                                                         enables the component to switch from a functional mode,
                                                                         the default behavior, to integration mode where the
                                                                         inputs and outputs of the component can be directly
                                                                         controlled for integration testing and topology
                                                                         solving.*/
    __IM uint32_t RESERVED7[43];
    __IOM uint32_t LAR;                              /*!< (@ 0x00000FB0) This is used to enable write access to device
                                                                         registers.*/
    __IOM uint32_t LSR;                              /*!< (@ 0x00000FB4) This indicates the status of the lock control
                                                                         mechanism. This lock prevents accidental writes by code
                                                                         under debug. Accesses to the extended stimulus port
                                                                         registers are not affected by the lock mechanism. This
                                                                         register must always be present although there might
                                                                         not be any lock access control mechanism. The lock
                                                                         mechanism, where present and locked, must block write
                                                                         accesses to any control register, except the Lock
                                                                         Access Register. For most components this covers all
                                                                         registers except for the Lock Access Register.*/
    __IOM uint32_t AUTHSTATUS;                       /*!< (@ 0x00000FB8) Indicates the current level of tracing permitted by the
                                                                         system*/
    __IM uint32_t RESERVED8[3];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Indicates the capabilities of the STM.                */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) Controls the single-shot comparator.                  */
    __IOM uint32_t PIDR4;                            /*!< (@ 0x00000FD0) Coresight peripheral identification registers.        */
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t PIDR0;                            /*!< (@ 0x00000FE0) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR1;                            /*!< (@ 0x00000FE4) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR2;                            /*!< (@ 0x00000FE8) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR3;                            /*!< (@ 0x00000FEC) Coresight peripheral identification registers.        */
    __IOM uint32_t CIDR0;                            /*!< (@ 0x00000FF0) Coresight component identification registers.         */
    __IOM uint32_t CIDR1;                            /*!< (@ 0x00000FF4) Coresight component identification registers.         */
    __IOM uint32_t CIDR2;                            /*!< (@ 0x00000FF8) Coresight component identification registers.         */
    __IOM uint32_t CIDR3;                            /*!< (@ 0x00000FFC) Coresight component identification registers.         */
  } NRF_STM_Type;                                    /*!< Size = 4096 (0x1000)                                                 */

/* STM_DMACTLR: Controls the DMA transfer request mechanism. */
  #define STM_DMACTLR_ResetValue (0x00000000UL)      /*!< Reset value of DMACTLR register.                                     */

/* SENS @Bits 2..3 : Determines the sensitivity of the DMA request to the current buffer level in the STM */
  #define STM_DMACTLR_SENS_Pos (2UL)                 /*!< Position of SENS field.                                              */
  #define STM_DMACTLR_SENS_Msk (0x3UL << STM_DMACTLR_SENS_Pos) /*!< Bit mask of SENS field.                                    */
  #define STM_DMACTLR_SENS_Min (0x0UL)               /*!< Min enumerator value of SENS field.                                  */
  #define STM_DMACTLR_SENS_Max (0x3UL)               /*!< Max enumerator value of SENS field.                                  */
  #define STM_DMACTLR_SENS_LT25 (0x0UL)              /*!< Buffer is <25 percent full.                                          */
  #define STM_DMACTLR_SENS_LT50 (0x1UL)              /*!< Buffer is <50 percent full.                                          */
  #define STM_DMACTLR_SENS_LT75 (0x2UL)              /*!< Buffer is <75 percent full.                                          */
  #define STM_DMACTLR_SENS_LT100 (0x3UL)             /*!< Buffer is <100 percent full.                                         */


