NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ATDATAM31_W @Bit 4 : Sets the value of the ATDATAM[31]. */
  #define STM_ITATBDATA0_ATDATAM31_W_Pos (4UL)       /*!< Position of ATDATAM31_W field.                                       */
  #define STM_ITATBDATA0_ATDATAM31_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM31_W_Pos) /*!< Bit mask of ATDATAM31_W field.         */
  #define STM_ITATBDATA0_ATDATAM31_W_Min (0x0UL)     /*!< Min enumerator value of ATDATAM31_W field.                           */
  #define STM_ITATBDATA0_ATDATAM31_W_Max (0x1UL)     /*!< Max enumerator value of ATDATAM31_W field.                           */
  #define STM_ITATBDATA0_ATDATAM31_W_Low (0x0UL)     /*!< Drive logic 0 on output.                                             */
  #define STM_ITATBDATA0_ATDATAM31_W_High (0x1UL)    /*!< Drive logic 1 on output.                                             */


/* STM_ITATBCTR2: Controls the value of the ATDATAM output in integration mode. */
  #define STM_ITATBCTR2_ResetValue (0x00000000UL)    /*!< Reset value of ITATBCTR2 register.                                   */

/* ATREADYM_R @Bit 0 : Reads the value of the ATREADYM input. */
  #define STM_ITATBCTR2_ATREADYM_R_Pos (0UL)         /*!< Position of ATREADYM_R field.                                        */
  #define STM_ITATBCTR2_ATREADYM_R_Msk (0x1UL << STM_ITATBCTR2_ATREADYM_R_Pos) /*!< Bit mask of ATREADYM_R field.              */
  #define STM_ITATBCTR2_ATREADYM_R_Min (0x0UL)       /*!< Min enumerator value of ATREADYM_R field.                            */
  #define STM_ITATBCTR2_ATREADYM_R_Max (0x1UL)       /*!< Max enumerator value of ATREADYM_R field.                            */
  #define STM_ITATBCTR2_ATREADYM_R_Low (0x0UL)       /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR2_ATREADYM_R_High (0x1UL)      /*!< Pin is at logic 1.                                                   */

/* AFVALIDM_R @Bit 1 : Reads the value of the AFVALIDM input. */
  #define STM_ITATBCTR2_AFVALIDM_R_Pos (1UL)         /*!< Position of AFVALIDM_R field.                                        */
  #define STM_ITATBCTR2_AFVALIDM_R_Msk (0x1UL << STM_ITATBCTR2_AFVALIDM_R_Pos) /*!< Bit mask of AFVALIDM_R field.              */
  #define STM_ITATBCTR2_AFVALIDM_R_Min (0x0UL)       /*!< Min enumerator value of AFVALIDM_R field.                            */
  #define STM_ITATBCTR2_AFVALIDM_R_Max (0x1UL)       /*!< Max enumerator value of AFVALIDM_R field.                            */
  #define STM_ITATBCTR2_AFVALIDM_R_Low (0x0UL)       /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR2_AFVALIDM_R_High (0x1UL)      /*!< Pin is at logic 1.                                                   */


/* STM_ITATBID: Controls the value of the ATIDM output in integration mode. */
  #define STM_ITATBID_ResetValue (0x00000000UL)      /*!< Reset value of ITATBID register.                                     */

/* ATIDM_W0 @Bit 0 : Sets the value of pin 0 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W0_Pos (0UL)             /*!< Position of ATIDM_W0 field.                                          */
  #define STM_ITATBID_ATIDM_W0_Msk (0x1UL << STM_ITATBID_ATIDM_W0_Pos) /*!< Bit mask of ATIDM_W0 field.                        */
  #define STM_ITATBID_ATIDM_W0_Min (0x0UL)           /*!< Min enumerator value of ATIDM_W0 field.                              */
  #define STM_ITATBID_ATIDM_W0_Max (0x1UL)           /*!< Max enumerator value of ATIDM_W0 field.                              */
  #define STM_ITATBID_ATIDM_W0_Low (0x0UL)           /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBID_ATIDM_W0_High (0x1UL)          /*!< Pin is at logic 1.                                                   */

/* ATIDM_W1 @Bit 1 : Sets the value of pin 1 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W1_Pos (1UL)             /*!< Position of ATIDM_W1 field.                                          */
  #define STM_ITATBID_ATIDM_W1_Msk (0x1UL << STM_ITATBID_ATIDM_W1_Pos) /*!< Bit mask of ATIDM_W1 field.                        */
  #define STM_ITATBID_ATIDM_W1_Min (0x0UL)           /*!< Min enumerator value of ATIDM_W1 field.                              */
  #define STM_ITATBID_ATIDM_W1_Max (0x1UL)           /*!< Max enumerator value of ATIDM_W1 field.                              */
  #define STM_ITATBID_ATIDM_W1_Low (0x0UL)           /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBID_ATIDM_W1_High (0x1UL)          /*!< Pin is at logic 1.                                                   */

/* ATIDM_W2 @Bit 2 : Sets the value of pin 2 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W2_Pos (2UL)             /*!< Position of ATIDM_W2 field.                                          */
  #define STM_ITATBID_ATIDM_W2_Msk (0x1UL << STM_ITATBID_ATIDM_W2_Pos) /*!< Bit mask of ATIDM_W2 field.                        */
  #define STM_ITATBID_ATIDM_W2_Min (0x0UL)           /*!< Min enumerator value of ATIDM_W2 field.                              */
  #define STM_ITATBID_ATIDM_W2_Max (0x1UL)           /*!< Max enumerator value of ATIDM_W2 field.                              */
  #define STM_ITATBID_ATIDM_W2_Low (0x0UL)           /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBID_ATIDM_W2_High (0x1UL)          /*!< Pin is at logic 1.                                                   */

/* ATIDM_W3 @Bit 3 : Sets the value of pin 3 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W3_Pos (3UL)             /*!< Position of ATIDM_W3 field.                                          */
  #define STM_ITATBID_ATIDM_W3_Msk (0x1UL << STM_ITATBID_ATIDM_W3_Pos) /*!< Bit mask of ATIDM_W3 field.                        */
  #define STM_ITATBID_ATIDM_W3_Min (0x0UL)           /*!< Min enumerator value of ATIDM_W3 field.                              */
  #define STM_ITATBID_ATIDM_W3_Max (0x1UL)           /*!< Max enumerator value of ATIDM_W3 field.                              */
  #define STM_ITATBID_ATIDM_W3_Low (0x0UL)           /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBID_ATIDM_W3_High (0x1UL)          /*!< Pin is at logic 1.                                                   */

/* ATIDM_W4 @Bit 4 : Sets the value of pin 4 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W4_Pos (4UL)             /*!< Position of ATIDM_W4 field.                                          */
  #define STM_ITATBID_ATIDM_W4_Msk (0x1UL << STM_ITATBID_ATIDM_W4_Pos) /*!< Bit mask of ATIDM_W4 field.                        */
  #define STM_ITATBID_ATIDM_W4_Min (0x0UL)           /*!< Min enumerator value of ATIDM_W4 field.                              */
  #define STM_ITATBID_ATIDM_W4_Max (0x1UL)           /*!< Max enumerator value of ATIDM_W4 field.                              */
  #define STM_ITATBID_ATIDM_W4_Low (0x0UL)           /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBID_ATIDM_W4_High (0x1UL)          /*!< Pin is at logic 1.                                                   */

/* ATIDM_W5 @Bit 5 : Sets the value of pin 5 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W5_Pos (5UL)             /*!< Position of ATIDM_W5 field.                                          */
  #define STM_ITATBID_ATIDM_W5_Msk (0x1UL << STM_ITATBID_ATIDM_W5_Pos) /*!< Bit mask of ATIDM_W5 field.                        */
  #define STM_ITATBID_ATIDM_W5_Min (0x0UL)           /*!< Min enumerator value of ATIDM_W5 field.                              */
  #define STM_ITATBID_ATIDM_W5_Max (0x1UL)           /*!< Max enumerator value of ATIDM_W5 field.                              */
  #define STM_ITATBID_ATIDM_W5_Low (0x0UL)           /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBID_ATIDM_W5_High (0x1UL)          /*!< Pin is at logic 1.                                                   */

/* ATIDM_W6 @Bit 6 : Sets the value of pin 6 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W6_Pos (6UL)             /*!< Position of ATIDM_W6 field.                                          */
  #define STM_ITATBID_ATIDM_W6_Msk (0x1UL << STM_ITATBID_ATIDM_W6_Pos) /*!< Bit mask of ATIDM_W6 field.                        */
  #define STM_ITATBID_ATIDM_W6_Min (0x0UL)           /*!< Min enumerator value of ATIDM_W6 field.                              */
  #define STM_ITATBID_ATIDM_W6_Max (0x1UL)           /*!< Max enumerator value of ATIDM_W6 field.                              */
  #define STM_ITATBID_ATIDM_W6_Low (0x0UL)           /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBID_ATIDM_W6_High (0x1UL)          /*!< Pin is at logic 1.                                                   */


/* STM_ITATBCTR0: Controls the value of the ATVALIDM, AFREADYM, and ATBYTESM outputs in integration mode. */
  #define STM_ITATBCTR0_ResetValue (0x00000000UL)    /*!< Reset value of ITATBCTR0 register.                                   */

/* ATVALIDM_W @Bit 0 : Sets the value of the ATVALIDM output. */
  #define STM_ITATBCTR0_ATVALIDM_W_Pos (0UL)         /*!< Position of ATVALIDM_W field.                                        */
  #define STM_ITATBCTR0_ATVALIDM_W_Msk (0x1UL << STM_ITATBCTR0_ATVALIDM_W_Pos) /*!< Bit mask of ATVALIDM_W field.              */
  #define STM_ITATBCTR0_ATVALIDM_W_Min (0x0UL)       /*!< Min enumerator value of ATVALIDM_W field.                            */
  #define STM_ITATBCTR0_ATVALIDM_W_Max (0x1UL)       /*!< Max enumerator value of ATVALIDM_W field.                            */
  #define STM_ITATBCTR0_ATVALIDM_W_Low (0x0UL)       /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR0_ATVALIDM_W_High (0x1UL)      /*!< Pin is at logic 1.                                                   */

