NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* AFREADYM_W @Bit 1 : Sets the value of the AFREADYM_W output. */
  #define STM_ITATBCTR0_AFREADYM_W_Pos (1UL)         /*!< Position of AFREADYM_W field.                                        */
  #define STM_ITATBCTR0_AFREADYM_W_Msk (0x1UL << STM_ITATBCTR0_AFREADYM_W_Pos) /*!< Bit mask of AFREADYM_W field.              */
  #define STM_ITATBCTR0_AFREADYM_W_Min (0x0UL)       /*!< Min enumerator value of AFREADYM_W field.                            */
  #define STM_ITATBCTR0_AFREADYM_W_Max (0x1UL)       /*!< Max enumerator value of AFREADYM_W field.                            */
  #define STM_ITATBCTR0_AFREADYM_W_Low (0x0UL)       /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR0_AFREADYM_W_High (0x1UL)      /*!< Pin is at logic 1.                                                   */

/* ATBYTESM_W0 @Bit 8 : Sets the value of pin 0 of the ATBYTESM output. */
  #define STM_ITATBCTR0_ATBYTESM_W0_Pos (8UL)        /*!< Position of ATBYTESM_W0 field.                                       */
  #define STM_ITATBCTR0_ATBYTESM_W0_Msk (0x1UL << STM_ITATBCTR0_ATBYTESM_W0_Pos) /*!< Bit mask of ATBYTESM_W0 field.           */
  #define STM_ITATBCTR0_ATBYTESM_W0_Min (0x0UL)      /*!< Min enumerator value of ATBYTESM_W0 field.                           */
  #define STM_ITATBCTR0_ATBYTESM_W0_Max (0x1UL)      /*!< Max enumerator value of ATBYTESM_W0 field.                           */
  #define STM_ITATBCTR0_ATBYTESM_W0_Low (0x0UL)      /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR0_ATBYTESM_W0_High (0x1UL)     /*!< Pin is at logic 1.                                                   */

/* ATBYTESM_W1 @Bit 9 : Sets the value of pin 1 of the ATBYTESM output. */
  #define STM_ITATBCTR0_ATBYTESM_W1_Pos (9UL)        /*!< Position of ATBYTESM_W1 field.                                       */
  #define STM_ITATBCTR0_ATBYTESM_W1_Msk (0x1UL << STM_ITATBCTR0_ATBYTESM_W1_Pos) /*!< Bit mask of ATBYTESM_W1 field.           */
  #define STM_ITATBCTR0_ATBYTESM_W1_Min (0x0UL)      /*!< Min enumerator value of ATBYTESM_W1 field.                           */
  #define STM_ITATBCTR0_ATBYTESM_W1_Max (0x1UL)      /*!< Max enumerator value of ATBYTESM_W1 field.                           */
  #define STM_ITATBCTR0_ATBYTESM_W1_Low (0x0UL)      /*!< Pin is at logic 0.                                                   */
  #define STM_ITATBCTR0_ATBYTESM_W1_High (0x1UL)     /*!< Pin is at logic 1.                                                   */


/* STM_ITCTRL: Used to enable topology detection. This register enables the component to switch from a functional mode, the
                default behavior, to integration mode where the inputs and outputs of the component can be directly controlled
                for integration testing and topology solving. */

  #define STM_ITCTRL_ResetValue (0x00000000UL)       /*!< Reset value of ITCTRL register.                                      */

/* INTEGRATIONMODE @Bit 0 : Enables the component to switch from functional mode to integration mode and back. If no integration
                            functionality is implemented, this register must read as zero. */

  #define STM_ITCTRL_INTEGRATIONMODE_Pos (0UL)       /*!< Position of INTEGRATIONMODE field.                                   */
  #define STM_ITCTRL_INTEGRATIONMODE_Msk (0x1UL << STM_ITCTRL_INTEGRATIONMODE_Pos) /*!< Bit mask of INTEGRATIONMODE field.     */
  #define STM_ITCTRL_INTEGRATIONMODE_Min (0x0UL)     /*!< Min enumerator value of INTEGRATIONMODE field.                       */
  #define STM_ITCTRL_INTEGRATIONMODE_Max (0x1UL)     /*!< Max enumerator value of INTEGRATIONMODE field.                       */
  #define STM_ITCTRL_INTEGRATIONMODE_Disabled (0x0UL) /*!< Integration mode is disabled.                                       */
  #define STM_ITCTRL_INTEGRATIONMODE_Enabled (0x1UL) /*!< Integration mode is Enabled.                                         */


/* STM_LAR: This is used to enable write access to device registers. */
  #define STM_LAR_ResetValue (0x00000000UL)          /*!< Reset value of LAR register.                                         */

/* ACCESS @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.
                        */

  #define STM_LAR_ACCESS_Pos (0UL)                   /*!< Position of ACCESS field.                                            */
  #define STM_LAR_ACCESS_Msk (0xFFFFFFFFUL << STM_LAR_ACCESS_Pos) /*!< Bit mask of ACCESS field.                               */
  #define STM_LAR_ACCESS_Min (0xC5ACCE55UL)          /*!< Min enumerator value of ACCESS field.                                */
  #define STM_LAR_ACCESS_Max (0xC5ACCE55UL)          /*!< Max enumerator value of ACCESS field.                                */
  #define STM_LAR_ACCESS_UnLock (0xC5ACCE55UL)       /*!< Unlock register interface.                                           */


/* STM_LSR: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under debug.
             Accesses to the extended stimulus port registers are not affected by the lock mechanism. This register must always
             be present although there might not be any lock access control mechanism. The lock mechanism, where present and
             locked, must block write accesses to any control register, except the Lock Access Register. For most components
             this covers all registers except for the Lock Access Register. */

  #define STM_LSR_ResetValue (0x00000000UL)          /*!< Reset value of LSR register.                                         */

/* PRESENT @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define STM_LSR_PRESENT_Pos (0UL)                  /*!< Position of PRESENT field.                                           */
  #define STM_LSR_PRESENT_Msk (0x1UL << STM_LSR_PRESENT_Pos) /*!< Bit mask of PRESENT field.                                   */
  #define STM_LSR_PRESENT_Min (0x0UL)                /*!< Min enumerator value of PRESENT field.                               */
  #define STM_LSR_PRESENT_Max (0x1UL)                /*!< Max enumerator value of PRESENT field.                               */
  #define STM_LSR_PRESENT_NotImplemented (0x0UL)     /*!< No lock control mechanism exists, writes to the Lock Access Register
                                                          are ignored.*/
  #define STM_LSR_PRESENT_Implemented (0x1UL)        /*!< Lock control mechanism is present.                                   */

/* LOCKED @Bit 1 : Returns the current status of the Lock. */
  #define STM_LSR_LOCKED_Pos (1UL)                   /*!< Position of LOCKED field.                                            */
  #define STM_LSR_LOCKED_Msk (0x1UL << STM_LSR_LOCKED_Pos) /*!< Bit mask of LOCKED field.                                      */
  #define STM_LSR_LOCKED_Min (0x0UL)                 /*!< Min enumerator value of LOCKED field.                                */
  #define STM_LSR_LOCKED_Max (0x1UL)                 /*!< Max enumerator value of LOCKED field.                                */
  #define STM_LSR_LOCKED_UnLocked (0x0UL)            /*!< Write access is allowed to this device.                              */
  #define STM_LSR_LOCKED_Locked (0x1UL)              /*!< Write access to the component is blocked. All writes to control
                                                          registers are ignored. Reads are permitted.*/

/* TYPE @Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
  #define STM_LSR_TYPE_Pos (2UL)                     /*!< Position of TYPE field.                                              */
  #define STM_LSR_TYPE_Msk (0x1UL << STM_LSR_TYPE_Pos) /*!< Bit mask of TYPE field.                                            */
  #define STM_LSR_TYPE_Min (0x0UL)                   /*!< Min enumerator value of TYPE field.                                  */
  #define STM_LSR_TYPE_Max (0x1UL)                   /*!< Max enumerator value of TYPE field.                                  */
  #define STM_LSR_TYPE_Bits32 (0x0UL)                /*!< This component implements a 32-bit Lock Access Register.             */
  #define STM_LSR_TYPE_Bits8 (0x1UL)                 /*!< This component implements an 8-bit Lock Access Register.             */


/* STM_AUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define STM_AUTHSTATUS_ResetValue (0x00000000UL)   /*!< Reset value of AUTHSTATUS register.                                  */

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define STM_AUTHSTATUS_NSID_Pos (0UL)              /*!< Position of NSID field.                                              */
  #define STM_AUTHSTATUS_NSID_Msk (0x3UL << STM_AUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                              */
  #define STM_AUTHSTATUS_NSID_Min (0x0UL)            /*!< Min enumerator value of NSID field.                                  */
  #define STM_AUTHSTATUS_NSID_Max (0x1UL)            /*!< Max enumerator value of NSID field.                                  */
  #define STM_AUTHSTATUS_NSID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                      */
  #define STM_AUTHSTATUS_NSID_Implemented (0x1UL)    /*!< The feature is implemented.                                          */

