NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* FULL @Bit 1 : Enable or disable interrupt for event FULL */
  #define TBM_INTEN_FULL_Pos (1UL)                   /*!< Position of FULL field.                                              */
  #define TBM_INTEN_FULL_Msk (0x1UL << TBM_INTEN_FULL_Pos) /*!< Bit mask of FULL field.                                        */
  #define TBM_INTEN_FULL_Min (0x0UL)                 /*!< Min enumerator value of FULL field.                                  */
  #define TBM_INTEN_FULL_Max (0x1UL)                 /*!< Max enumerator value of FULL field.                                  */
  #define TBM_INTEN_FULL_Disabled (0x0UL)            /*!< Disable                                                              */
  #define TBM_INTEN_FULL_Enabled (0x1UL)             /*!< Enable                                                               */

/* FLUSH @Bit 2 : Enable or disable interrupt for event FLUSH */
  #define TBM_INTEN_FLUSH_Pos (2UL)                  /*!< Position of FLUSH field.                                             */
  #define TBM_INTEN_FLUSH_Msk (0x1UL << TBM_INTEN_FLUSH_Pos) /*!< Bit mask of FLUSH field.                                     */
  #define TBM_INTEN_FLUSH_Min (0x0UL)                /*!< Min enumerator value of FLUSH field.                                 */
  #define TBM_INTEN_FLUSH_Max (0x1UL)                /*!< Max enumerator value of FLUSH field.                                 */
  #define TBM_INTEN_FLUSH_Disabled (0x0UL)           /*!< Disable                                                              */
  #define TBM_INTEN_FLUSH_Enabled (0x1UL)            /*!< Enable                                                               */


/* TBM_INTENSET: Enable interrupt */
  #define TBM_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* HALFFULL @Bit 0 : Write '1' to enable interrupt for event HALFFULL */
  #define TBM_INTENSET_HALFFULL_Pos (0UL)            /*!< Position of HALFFULL field.                                          */
  #define TBM_INTENSET_HALFFULL_Msk (0x1UL << TBM_INTENSET_HALFFULL_Pos) /*!< Bit mask of HALFFULL field.                      */
  #define TBM_INTENSET_HALFFULL_Min (0x0UL)          /*!< Min enumerator value of HALFFULL field.                              */
  #define TBM_INTENSET_HALFFULL_Max (0x1UL)          /*!< Max enumerator value of HALFFULL field.                              */
  #define TBM_INTENSET_HALFFULL_Set (0x1UL)          /*!< Enable                                                               */
  #define TBM_INTENSET_HALFFULL_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TBM_INTENSET_HALFFULL_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* FULL @Bit 1 : Write '1' to enable interrupt for event FULL */
  #define TBM_INTENSET_FULL_Pos (1UL)                /*!< Position of FULL field.                                              */
  #define TBM_INTENSET_FULL_Msk (0x1UL << TBM_INTENSET_FULL_Pos) /*!< Bit mask of FULL field.                                  */
  #define TBM_INTENSET_FULL_Min (0x0UL)              /*!< Min enumerator value of FULL field.                                  */
  #define TBM_INTENSET_FULL_Max (0x1UL)              /*!< Max enumerator value of FULL field.                                  */
  #define TBM_INTENSET_FULL_Set (0x1UL)              /*!< Enable                                                               */
  #define TBM_INTENSET_FULL_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define TBM_INTENSET_FULL_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* FLUSH @Bit 2 : Write '1' to enable interrupt for event FLUSH */
  #define TBM_INTENSET_FLUSH_Pos (2UL)               /*!< Position of FLUSH field.                                             */
  #define TBM_INTENSET_FLUSH_Msk (0x1UL << TBM_INTENSET_FLUSH_Pos) /*!< Bit mask of FLUSH field.                               */
  #define TBM_INTENSET_FLUSH_Min (0x0UL)             /*!< Min enumerator value of FLUSH field.                                 */
  #define TBM_INTENSET_FLUSH_Max (0x1UL)             /*!< Max enumerator value of FLUSH field.                                 */
  #define TBM_INTENSET_FLUSH_Set (0x1UL)             /*!< Enable                                                               */
  #define TBM_INTENSET_FLUSH_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define TBM_INTENSET_FLUSH_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* TBM_INTENCLR: Disable interrupt */
  #define TBM_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* HALFFULL @Bit 0 : Write '1' to disable interrupt for event HALFFULL */
  #define TBM_INTENCLR_HALFFULL_Pos (0UL)            /*!< Position of HALFFULL field.                                          */
  #define TBM_INTENCLR_HALFFULL_Msk (0x1UL << TBM_INTENCLR_HALFFULL_Pos) /*!< Bit mask of HALFFULL field.                      */
  #define TBM_INTENCLR_HALFFULL_Min (0x0UL)          /*!< Min enumerator value of HALFFULL field.                              */
  #define TBM_INTENCLR_HALFFULL_Max (0x1UL)          /*!< Max enumerator value of HALFFULL field.                              */
  #define TBM_INTENCLR_HALFFULL_Clear (0x1UL)        /*!< Disable                                                              */
  #define TBM_INTENCLR_HALFFULL_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TBM_INTENCLR_HALFFULL_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* FULL @Bit 1 : Write '1' to disable interrupt for event FULL */
  #define TBM_INTENCLR_FULL_Pos (1UL)                /*!< Position of FULL field.                                              */
  #define TBM_INTENCLR_FULL_Msk (0x1UL << TBM_INTENCLR_FULL_Pos) /*!< Bit mask of FULL field.                                  */
  #define TBM_INTENCLR_FULL_Min (0x0UL)              /*!< Min enumerator value of FULL field.                                  */
  #define TBM_INTENCLR_FULL_Max (0x1UL)              /*!< Max enumerator value of FULL field.                                  */
  #define TBM_INTENCLR_FULL_Clear (0x1UL)            /*!< Disable                                                              */
  #define TBM_INTENCLR_FULL_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define TBM_INTENCLR_FULL_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* FLUSH @Bit 2 : Write '1' to disable interrupt for event FLUSH */
  #define TBM_INTENCLR_FLUSH_Pos (2UL)               /*!< Position of FLUSH field.                                             */
  #define TBM_INTENCLR_FLUSH_Msk (0x1UL << TBM_INTENCLR_FLUSH_Pos) /*!< Bit mask of FLUSH field.                               */
  #define TBM_INTENCLR_FLUSH_Min (0x0UL)             /*!< Min enumerator value of FLUSH field.                                 */
  #define TBM_INTENCLR_FLUSH_Max (0x1UL)             /*!< Max enumerator value of FLUSH field.                                 */
  #define TBM_INTENCLR_FLUSH_Clear (0x1UL)           /*!< Disable                                                              */
  #define TBM_INTENCLR_FLUSH_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define TBM_INTENCLR_FLUSH_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


