NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TBM_INTPEND: Pending interrupts */
  #define TBM_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* HALFFULL @Bit 0 : Read pending status of interrupt for event HALFFULL */
  #define TBM_INTPEND_HALFFULL_Pos (0UL)             /*!< Position of HALFFULL field.                                          */
  #define TBM_INTPEND_HALFFULL_Msk (0x1UL << TBM_INTPEND_HALFFULL_Pos) /*!< Bit mask of HALFFULL field.                        */
  #define TBM_INTPEND_HALFFULL_Min (0x0UL)           /*!< Min enumerator value of HALFFULL field.                              */
  #define TBM_INTPEND_HALFFULL_Max (0x1UL)           /*!< Max enumerator value of HALFFULL field.                              */
  #define TBM_INTPEND_HALFFULL_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define TBM_INTPEND_HALFFULL_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* FULL @Bit 1 : Read pending status of interrupt for event FULL */
  #define TBM_INTPEND_FULL_Pos (1UL)                 /*!< Position of FULL field.                                              */
  #define TBM_INTPEND_FULL_Msk (0x1UL << TBM_INTPEND_FULL_Pos) /*!< Bit mask of FULL field.                                    */
  #define TBM_INTPEND_FULL_Min (0x0UL)               /*!< Min enumerator value of FULL field.                                  */
  #define TBM_INTPEND_FULL_Max (0x1UL)               /*!< Max enumerator value of FULL field.                                  */
  #define TBM_INTPEND_FULL_NotPending (0x0UL)        /*!< Read: Not pending                                                    */
  #define TBM_INTPEND_FULL_Pending (0x1UL)           /*!< Read: Pending                                                        */

/* FLUSH @Bit 2 : Read pending status of interrupt for event FLUSH */
  #define TBM_INTPEND_FLUSH_Pos (2UL)                /*!< Position of FLUSH field.                                             */
  #define TBM_INTPEND_FLUSH_Msk (0x1UL << TBM_INTPEND_FLUSH_Pos) /*!< Bit mask of FLUSH field.                                 */
  #define TBM_INTPEND_FLUSH_Min (0x0UL)              /*!< Min enumerator value of FLUSH field.                                 */
  #define TBM_INTPEND_FLUSH_Max (0x1UL)              /*!< Max enumerator value of FLUSH field.                                 */
  #define TBM_INTPEND_FLUSH_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define TBM_INTPEND_FLUSH_Pending (0x1UL)          /*!< Read: Pending                                                        */


/* TBM_BUFFERSIZE: System RAM trace buffer total size in bytes */
  #define TBM_BUFFERSIZE_ResetValue (0x00000400UL)   /*!< Reset value of BUFFERSIZE register.                                  */

/* BUFFERSIZE @Bits 0..12 : Must only be configured in STOP mode. Must be programmed to multiple of 16 bytes to make half-buffer
                            size always 64 bit word aligned. Typical minimum BUFFERSIZE value 0x010 i.e. 16 bytes, typical
                            maximum value 0x1000 i.e. 4096 bytes. */

  #define TBM_BUFFERSIZE_BUFFERSIZE_Pos (0UL)        /*!< Position of BUFFERSIZE field.                                        */
  #define TBM_BUFFERSIZE_BUFFERSIZE_Msk (0x1FFFUL << TBM_BUFFERSIZE_BUFFERSIZE_Pos) /*!< Bit mask of BUFFERSIZE field.         */
  #define TBM_BUFFERSIZE_BUFFERSIZE_Zero (0x0000UL)  /*!< 0 bytes                                                              */
  #define TBM_BUFFERSIZE_BUFFERSIZE_Min (0x0010UL)   /*!< 16 bytes                                                             */
  #define TBM_BUFFERSIZE_BUFFERSIZE_Max (0x1000UL)   /*!< 4096 bytes                                                           */


/* TBM_COUNT: Counter current value */
  #define TBM_COUNT_ResetValue (0x00000000UL)        /*!< Reset value of COUNT register.                                       */

/* COUNT @Bits 0..12 : Counter current value. Only writable when counter is in stopped state. Writing when not in stopped state
                       will generate a bus fault. */

  #define TBM_COUNT_COUNT_Pos (0UL)                  /*!< Position of COUNT field.                                             */
  #define TBM_COUNT_COUNT_Msk (0x1FFFUL << TBM_COUNT_COUNT_Pos) /*!< Bit mask of COUNT field.                                  */


/* TBM_COUNTSNAPSHOT: Copy of the current COUNT value */
  #define TBM_COUNTSNAPSHOT_ResetValue (0x00000000UL) /*!< Reset value of COUNTSNAPSHOT register.                              */

/* COUNTSNAPSHOT @Bits 0..12 : TASKS_FLUSH will copy the current COUNT value to this register. */
  #define TBM_COUNTSNAPSHOT_COUNTSNAPSHOT_Pos (0UL)  /*!< Position of COUNTSNAPSHOT field.                                     */
  #define TBM_COUNTSNAPSHOT_COUNTSNAPSHOT_Msk (0x1FFFUL << TBM_COUNTSNAPSHOT_COUNTSNAPSHOT_Pos) /*!< Bit mask of COUNTSNAPSHOT
                                                                            field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          TDDCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ===================================================== Struct TDDCONF ====================================================== */
/**
  * @brief TDDCONF
  */
  typedef struct {                                   /*!< TDDCONF Structure                                                    */
    __IM uint32_t RESERVED[256];
    __IOM uint32_t SYSPWRUPREQ;                      /*!< (@ 0x00000400) System power-up request                               */
    __IOM uint32_t DBGPWRUPREQ;                      /*!< (@ 0x00000404) Debug power-up request                                */
    __IOM uint32_t TRACEPORTSPEED;                   /*!< (@ 0x00000408) Trace port trace clock speed                          */
    __IM uint32_t DEBUGPOWERREQSTATUS;               /*!< (@ 0x0000040C) Combined effective system status of both SWJ-DP and
                                                                         TDDCONF registers originated power requests*/
  } NRF_TDDCONF_Type;                                /*!< Size = 1040 (0x410)                                                  */

/* TDDCONF_SYSPWRUPREQ: System power-up request */
  #define TDDCONF_SYSPWRUPREQ_ResetValue (0x00000000UL) /*!< Reset value of SYSPWRUPREQ register.                              */

/* ACTIVE @Bit 0 : Activate power-up request */
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Pos (0UL)       /*!< Position of ACTIVE field.                                            */
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Msk (0x1UL << TDDCONF_SYSPWRUPREQ_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.              */
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Min (0x0UL)     /*!< Min enumerator value of ACTIVE field.                                */
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Max (0x1UL)     /*!< Max enumerator value of ACTIVE field.                                */
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_NotActive (0x0UL) /*!< Power-up request not active                                        */
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Active (0x1UL)  /*!< Power-up request active                                              */


