NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TDM_CONFIG_CHANNEL_MASK: Select which channels are to be used. */
  #define TDM_CONFIG_CHANNEL_MASK_ResetValue (0x00FF00FFUL) /*!< Reset value of MASK register.                                 */

/* Rx0Enable @Bit 0 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Pos (0UL) /*!< Position of Rx0Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Pos) /*!< Bit mask of Rx0Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Min (0x0UL) /*!< Min enumerator value of Rx0Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Max (0x1UL) /*!< Max enumerator value of Rx0Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx0Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx1Enable @Bit 1 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Pos (1UL) /*!< Position of Rx1Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Pos) /*!< Bit mask of Rx1Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Min (0x0UL) /*!< Min enumerator value of Rx1Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Max (0x1UL) /*!< Max enumerator value of Rx1Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx1Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx2Enable @Bit 2 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Pos (2UL) /*!< Position of Rx2Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Pos) /*!< Bit mask of Rx2Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Min (0x0UL) /*!< Min enumerator value of Rx2Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Max (0x1UL) /*!< Max enumerator value of Rx2Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx2Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx3Enable @Bit 3 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Pos (3UL) /*!< Position of Rx3Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Pos) /*!< Bit mask of Rx3Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Min (0x0UL) /*!< Min enumerator value of Rx3Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Max (0x1UL) /*!< Max enumerator value of Rx3Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx3Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx4Enable @Bit 4 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Pos (4UL) /*!< Position of Rx4Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Pos) /*!< Bit mask of Rx4Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Min (0x0UL) /*!< Min enumerator value of Rx4Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Max (0x1UL) /*!< Max enumerator value of Rx4Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx4Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx5Enable @Bit 5 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Pos (5UL) /*!< Position of Rx5Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Pos) /*!< Bit mask of Rx5Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Min (0x0UL) /*!< Min enumerator value of Rx5Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Max (0x1UL) /*!< Max enumerator value of Rx5Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx5Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

/* Rx6Enable @Bit 6 : (unspecified) */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Pos (6UL) /*!< Position of Rx6Enable field.                                        */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Msk (0x1UL << TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Pos) /*!< Bit mask of Rx6Enable
                                                                            field.*/
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Min (0x0UL) /*!< Min enumerator value of Rx6Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Max (0x1UL) /*!< Max enumerator value of Rx6Enable field.                          */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Disable (0x0UL) /*!< Disable Rx channel data.                                      */
  #define TDM_CONFIG_CHANNEL_MASK_Rx6Enable_Enable (0x1UL) /*!< Enable Rx channel data.                                        */

