NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TDM_CONFIG_CHANNEL_NUM: Select number of channels. */
  #define TDM_CONFIG_CHANNEL_NUM_ResetValue (0x00000001UL) /*!< Reset value of NUM register.                                   */

/* NUM @Bits 0..3 : Select number of channels. */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Pos (0UL)       /*!< Position of NUM field.                                               */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Msk (0xFUL << TDM_CONFIG_CHANNEL_NUM_NUM_Pos) /*!< Bit mask of NUM field.                 */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Min (0x0UL)     /*!< Min enumerator value of NUM field.                                   */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Max (0x7UL)     /*!< Max enumerator value of NUM field.                                   */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm1Ch (0x0UL)  /*!< 1-channel audio (mono).                                              */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm2Ch (0x1UL)  /*!< 2-channel audio (stereo).                                            */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm3Ch (0x2UL)  /*!< 3-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm4Ch (0x3UL)  /*!< 4-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm5Ch (0x4UL)  /*!< 5-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm6Ch (0x5UL)  /*!< 6-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm7Ch (0x6UL)  /*!< 7-channel audio.                                                     */
  #define TDM_CONFIG_CHANNEL_NUM_NUM_Tdm8Ch (0x7UL)  /*!< 8-channel audio.                                                     */


/* TDM_CONFIG_CHANNEL_DELAY: Set channel delay. */
  #define TDM_CONFIG_CHANNEL_DELAY_ResetValue (0x00000001UL) /*!< Reset value of DELAY register.                               */

/* DELAY @Bits 0..1 : Configure number of inactive SCK periods from edge of FSYNC until start of first data bit. */
  #define TDM_CONFIG_CHANNEL_DELAY_DELAY_Pos (0UL)   /*!< Position of DELAY field.                                             */
  #define TDM_CONFIG_CHANNEL_DELAY_DELAY_Msk (0x3UL << TDM_CONFIG_CHANNEL_DELAY_DELAY_Pos) /*!< Bit mask of DELAY field.       */
  #define TDM_CONFIG_CHANNEL_DELAY_DELAY_Min (0x0UL) /*!< Min enumerator value of DELAY field.                                 */
  #define TDM_CONFIG_CHANNEL_DELAY_DELAY_Max (0x2UL) /*!< Max enumerator value of DELAY field.                                 */
  #define TDM_CONFIG_CHANNEL_DELAY_DELAY_Delay0Ck (0x0UL) /*!< No delay. Used with I2S DSP/Aligned format.                     */
  #define TDM_CONFIG_CHANNEL_DELAY_DELAY_Delay1Ck (0x1UL) /*!< One clock pulse delay. Used with Original I2S format.           */
  #define TDM_CONFIG_CHANNEL_DELAY_DELAY_Delay2Ck (0x2UL) /*!< Two clock pulses delay.                                         */



/* ================================================= Struct TDM_CONFIG_FSYNC ================================================= */
/**
  * @brief FSYNC [TDM_CONFIG_FSYNC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  POLARITY;                          /*!< (@ 0x00000000) Set FSYNC Polarity.                                   */
  __IOM uint32_t  DURATION;                          /*!< (@ 0x00000004) Set FSYNC Duration.                                   */
} NRF_TDM_CONFIG_FSYNC_Type;                         /*!< Size = 8 (0x008)                                                     */

/* TDM_CONFIG_FSYNC_POLARITY: Set FSYNC Polarity. */
  #define TDM_CONFIG_FSYNC_POLARITY_ResetValue (0x00000000UL) /*!< Reset value of POLARITY register.                           */

/* POLARITY @Bit 0 : Set the polarity of the active period of FSYNC. */
  #define TDM_CONFIG_FSYNC_POLARITY_POLARITY_Pos (0UL) /*!< Position of POLARITY field.                                        */
  #define TDM_CONFIG_FSYNC_POLARITY_POLARITY_Msk (0x1UL << TDM_CONFIG_FSYNC_POLARITY_POLARITY_Pos) /*!< Bit mask of POLARITY
                                                                            field.*/
  #define TDM_CONFIG_FSYNC_POLARITY_POLARITY_Min (0x0UL) /*!< Min enumerator value of POLARITY field.                          */
  #define TDM_CONFIG_FSYNC_POLARITY_POLARITY_Max (0x1UL) /*!< Max enumerator value of POLARITY field.                          */
  #define TDM_CONFIG_FSYNC_POLARITY_POLARITY_NegEdge (0x0UL) /*!< Frame starts at falling edge of FSYNC.                       */
  #define TDM_CONFIG_FSYNC_POLARITY_POLARITY_PosEdge (0x1UL) /*!< Frame starts at rising edge of FSYNC.                        */


/* TDM_CONFIG_FSYNC_DURATION: Set FSYNC Duration. */
  #define TDM_CONFIG_FSYNC_DURATION_ResetValue (0x00000001UL) /*!< Reset value of DURATION register.                           */

/* DURATION @Bit 0 : Set the duration of the active period of FSYNC in Master mode. */
  #define TDM_CONFIG_FSYNC_DURATION_DURATION_Pos (0UL) /*!< Position of DURATION field.                                        */
  #define TDM_CONFIG_FSYNC_DURATION_DURATION_Msk (0x1UL << TDM_CONFIG_FSYNC_DURATION_DURATION_Pos) /*!< Bit mask of DURATION
                                                                            field.*/
  #define TDM_CONFIG_FSYNC_DURATION_DURATION_Min (0x0UL) /*!< Min enumerator value of DURATION field.                          */
  #define TDM_CONFIG_FSYNC_DURATION_DURATION_Max (0x1UL) /*!< Max enumerator value of DURATION field.                          */
  #define TDM_CONFIG_FSYNC_DURATION_DURATION_Sck (0x0UL) /*!< FSYNC is active for the duration of one SCK pulse                */
  #define TDM_CONFIG_FSYNC_DURATION_DURATION_Channel (0x1UL) /*!< FSYNC is active for the duration of channel                  */



/* ==================================================== Struct TDM_CONFIG ==================================================== */
/**
  * @brief CONFIG [TDM_CONFIG] Configuration registers.
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Mode configuration                                    */
  __IOM uint32_t  RXTXEN;                            /*!< (@ 0x00000004) Reception (RX) and transmission (TX) enable.          */
  __IOM NRF_TDM_CONFIG_MCK_Type MCK;                 /*!< (@ 0x00000008) (unspecified)                                         */
  __IOM NRF_TDM_CONFIG_SCK_Type SCK;                 /*!< (@ 0x00000014) (unspecified)                                         */
  __IOM uint32_t  SWIDTH;                            /*!< (@ 0x00000020) Sample and word width configuration.                  */
  __IOM uint32_t  ALIGN;                             /*!< (@ 0x00000024) Alignment of sample within the audio data word.       */
  __IOM NRF_TDM_CONFIG_CHANNEL_Type CHANNEL;         /*!< (@ 0x00000028) (unspecified)                                         */
  __IOM NRF_TDM_CONFIG_FSYNC_Type FSYNC;             /*!< (@ 0x00000034) (unspecified)                                         */
  __IOM uint32_t  ORS;                               /*!< (@ 0x0000003C) Over-read sample: Extra sample bytes that are
                                                                         transmitted after TXD.MAXCNT bytes have been
                                                                         transmitted, in the case when RXD.MAXCNT is greater
                                                                         than TXD.MAXCNT.*/
} NRF_TDM_CONFIG_Type;                               /*!< Size = 64 (0x040)                                                    */

/* TDM_CONFIG_MODE: Mode configuration */
  #define TDM_CONFIG_MODE_ResetValue (0x00000000UL)  /*!< Reset value of MODE register.                                        */

