NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* COMPARE5_STOP @Bit 21 : Shortcut between event COMPARE[5] and task STOP */
  #define TIMER_SHORTS_COMPARE5_STOP_Pos (21UL)      /*!< Position of COMPARE5_STOP field.                                     */
  #define TIMER_SHORTS_COMPARE5_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE5_STOP_Pos) /*!< Bit mask of COMPARE5_STOP field.       */
  #define TIMER_SHORTS_COMPARE5_STOP_Min (0x0UL)     /*!< Min enumerator value of COMPARE5_STOP field.                         */
  #define TIMER_SHORTS_COMPARE5_STOP_Max (0x1UL)     /*!< Max enumerator value of COMPARE5_STOP field.                         */
  #define TIMER_SHORTS_COMPARE5_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TIMER_SHORTS_COMPARE5_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* COMPARE6_STOP @Bit 22 : Shortcut between event COMPARE[6] and task STOP */
  #define TIMER_SHORTS_COMPARE6_STOP_Pos (22UL)      /*!< Position of COMPARE6_STOP field.                                     */
  #define TIMER_SHORTS_COMPARE6_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE6_STOP_Pos) /*!< Bit mask of COMPARE6_STOP field.       */
  #define TIMER_SHORTS_COMPARE6_STOP_Min (0x0UL)     /*!< Min enumerator value of COMPARE6_STOP field.                         */
  #define TIMER_SHORTS_COMPARE6_STOP_Max (0x1UL)     /*!< Max enumerator value of COMPARE6_STOP field.                         */
  #define TIMER_SHORTS_COMPARE6_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TIMER_SHORTS_COMPARE6_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */

/* COMPARE7_STOP @Bit 23 : Shortcut between event COMPARE[7] and task STOP */
  #define TIMER_SHORTS_COMPARE7_STOP_Pos (23UL)      /*!< Position of COMPARE7_STOP field.                                     */
  #define TIMER_SHORTS_COMPARE7_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE7_STOP_Pos) /*!< Bit mask of COMPARE7_STOP field.       */
  #define TIMER_SHORTS_COMPARE7_STOP_Min (0x0UL)     /*!< Min enumerator value of COMPARE7_STOP field.                         */
  #define TIMER_SHORTS_COMPARE7_STOP_Max (0x1UL)     /*!< Max enumerator value of COMPARE7_STOP field.                         */
  #define TIMER_SHORTS_COMPARE7_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                    */
  #define TIMER_SHORTS_COMPARE7_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                      */


/* TIMER_INTEN: Enable or disable interrupt */
  #define TIMER_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* COMPARE0 @Bit 16 : Enable or disable interrupt for event COMPARE[0] */
  #define TIMER_INTEN_COMPARE0_Pos (16UL)            /*!< Position of COMPARE0 field.                                          */
  #define TIMER_INTEN_COMPARE0_Msk (0x1UL << TIMER_INTEN_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                        */
  #define TIMER_INTEN_COMPARE0_Min (0x0UL)           /*!< Min enumerator value of COMPARE0 field.                              */
  #define TIMER_INTEN_COMPARE0_Max (0x1UL)           /*!< Max enumerator value of COMPARE0 field.                              */
  #define TIMER_INTEN_COMPARE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TIMER_INTEN_COMPARE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE1 @Bit 17 : Enable or disable interrupt for event COMPARE[1] */
  #define TIMER_INTEN_COMPARE1_Pos (17UL)            /*!< Position of COMPARE1 field.                                          */
  #define TIMER_INTEN_COMPARE1_Msk (0x1UL << TIMER_INTEN_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                        */
  #define TIMER_INTEN_COMPARE1_Min (0x0UL)           /*!< Min enumerator value of COMPARE1 field.                              */
  #define TIMER_INTEN_COMPARE1_Max (0x1UL)           /*!< Max enumerator value of COMPARE1 field.                              */
  #define TIMER_INTEN_COMPARE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TIMER_INTEN_COMPARE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE2 @Bit 18 : Enable or disable interrupt for event COMPARE[2] */
  #define TIMER_INTEN_COMPARE2_Pos (18UL)            /*!< Position of COMPARE2 field.                                          */
  #define TIMER_INTEN_COMPARE2_Msk (0x1UL << TIMER_INTEN_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                        */
  #define TIMER_INTEN_COMPARE2_Min (0x0UL)           /*!< Min enumerator value of COMPARE2 field.                              */
  #define TIMER_INTEN_COMPARE2_Max (0x1UL)           /*!< Max enumerator value of COMPARE2 field.                              */
  #define TIMER_INTEN_COMPARE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TIMER_INTEN_COMPARE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE3 @Bit 19 : Enable or disable interrupt for event COMPARE[3] */
  #define TIMER_INTEN_COMPARE3_Pos (19UL)            /*!< Position of COMPARE3 field.                                          */
  #define TIMER_INTEN_COMPARE3_Msk (0x1UL << TIMER_INTEN_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                        */
  #define TIMER_INTEN_COMPARE3_Min (0x0UL)           /*!< Min enumerator value of COMPARE3 field.                              */
  #define TIMER_INTEN_COMPARE3_Max (0x1UL)           /*!< Max enumerator value of COMPARE3 field.                              */
  #define TIMER_INTEN_COMPARE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TIMER_INTEN_COMPARE3_Enabled (0x1UL)       /*!< Enable                                                               */

