NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PORT_SIZE_1 @Bit 0 : Indicates whether the TPIU supports port size of 1-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Pos (0UL) /*!< Position of PORT_SIZE_1 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_1 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_1 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_1 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_NotSupported (0x0UL) /*!< Port size 1 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Supported (0x1UL) /*!< Port size 1 is supported.                                 */

/* PORT_SIZE_2 @Bit 1 : Indicates whether the TPIU supports port size of 2-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Pos (1UL) /*!< Position of PORT_SIZE_2 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_2 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_2 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_2 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_NotSupported (0x0UL) /*!< Port size 2 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Supported (0x1UL) /*!< Port size 2 is supported.                                 */

/* PORT_SIZE_3 @Bit 2 : Indicates whether the TPIU supports port size of 3-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Pos (2UL) /*!< Position of PORT_SIZE_3 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_3 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_3 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_3 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_NotSupported (0x0UL) /*!< Port size 3 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Supported (0x1UL) /*!< Port size 3 is supported.                                 */

/* PORT_SIZE_4 @Bit 3 : Indicates whether the TPIU supports port size of 4-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Pos (3UL) /*!< Position of PORT_SIZE_4 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_4 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_4 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_4 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_NotSupported (0x0UL) /*!< Port size 4 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Supported (0x1UL) /*!< Port size 4 is supported.                                 */

/* PORT_SIZE_5 @Bit 4 : Indicates whether the TPIU supports port size of 5-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Pos (4UL) /*!< Position of PORT_SIZE_5 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_5 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_5 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_5 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_NotSupported (0x0UL) /*!< Port size 5 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Supported (0x1UL) /*!< Port size 5 is supported.                                 */

/* PORT_SIZE_6 @Bit 5 : Indicates whether the TPIU supports port size of 6-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Pos (5UL) /*!< Position of PORT_SIZE_6 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_6 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_6 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_6 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_NotSupported (0x0UL) /*!< Port size 6 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Supported (0x1UL) /*!< Port size 6 is supported.                                 */

/* PORT_SIZE_7 @Bit 6 : Indicates whether the TPIU supports port size of 7-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Pos (6UL) /*!< Position of PORT_SIZE_7 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_7 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_7 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_7 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_NotSupported (0x0UL) /*!< Port size 7 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Supported (0x1UL) /*!< Port size 7 is supported.                                 */

