NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PORT_SIZE_29 @Bit 28 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Pos (28UL) /*!< Position of PORT_SIZE_29 field.                                    */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Pos) /*!< Bit mask of PORT_SIZE_29
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_29 field.                       */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_29 field.                       */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_NotSelected (0x0UL) /*!< Port size 29 is not selected.                             */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Selected (0x1UL) /*!< Port size 29 is selected.                                    */

/* PORT_SIZE_30 @Bit 29 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Pos (29UL) /*!< Position of PORT_SIZE_30 field.                                    */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Pos) /*!< Bit mask of PORT_SIZE_30
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_30 field.                       */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_30 field.                       */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_NotSelected (0x0UL) /*!< Port size 30 is not selected.                             */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Selected (0x1UL) /*!< Port size 30 is selected.                                    */

/* PORT_SIZE_31 @Bit 30 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Pos (30UL) /*!< Position of PORT_SIZE_31 field.                                    */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Pos) /*!< Bit mask of PORT_SIZE_31
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_31 field.                       */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_31 field.                       */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_NotSelected (0x0UL) /*!< Port size 31 is not selected.                             */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Selected (0x1UL) /*!< Port size 31 is selected.                                    */

/* PORT_SIZE_32 @Bit 31 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Pos (31UL) /*!< Position of PORT_SIZE_32 field.                                    */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Pos) /*!< Bit mask of PORT_SIZE_32
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_32 field.                       */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_32 field.                       */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_NotSelected (0x0UL) /*!< Port size 32 is not selected.                             */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Selected (0x1UL) /*!< Port size 32 is selected.                                    */


/* TPIU_SUPPORTEDTRIGGERMODES: The Supported_trigger_modes register indicates the implemented trigger counter multipliers and
                                other supported features of the trigger system. */

  #define TPIU_SUPPORTEDTRIGGERMODES_ResetValue (0x00000000UL) /*!< Reset value of SUPPORTEDTRIGGERMODES register.             */

/* MULT0 @Bit 0 : Indicates whether multiplying the trigger counter by 2^(0+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Pos (0UL) /*!< Position of MULT0 field.                                             */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT0_Pos) /*!< Bit mask of MULT0 field.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Min (0x0UL) /*!< Min enumerator value of MULT0 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Max (0x1UL) /*!< Max enumerator value of MULT0 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(0+1) is supported.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(0+1) is supported.      */

/* MULT1 @Bit 1 : Indicates whether multiplying the trigger counter by 2^(1+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Pos (1UL) /*!< Position of MULT1 field.                                             */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT1_Pos) /*!< Bit mask of MULT1 field.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Min (0x0UL) /*!< Min enumerator value of MULT1 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Max (0x1UL) /*!< Max enumerator value of MULT1 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(1+1) is supported.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(1+1) is supported.      */

/* MULT2 @Bit 2 : Indicates whether multiplying the trigger counter by 2^(2+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Pos (2UL) /*!< Position of MULT2 field.                                             */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT2_Pos) /*!< Bit mask of MULT2 field.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Min (0x0UL) /*!< Min enumerator value of MULT2 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Max (0x1UL) /*!< Max enumerator value of MULT2 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(2+1) is supported.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(2+1) is supported.      */

/* MULT3 @Bit 3 : Indicates whether multiplying the trigger counter by 2^(3+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Pos (3UL) /*!< Position of MULT3 field.                                             */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT3_Pos) /*!< Bit mask of MULT3 field.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Min (0x0UL) /*!< Min enumerator value of MULT3 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Max (0x1UL) /*!< Max enumerator value of MULT3 field.                               */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_NotSelected (0x0UL) /*!< Multiplying the trigger counter by 2^(3+1) is supported.   */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Selected (0x1UL) /*!< Multiplying the trigger counter by 2^(3+1) is supported.      */

