NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TSGEN_CNTCVU: Current Counter Value Upper register */
  #define TSGEN_CNTCVU_ResetValue (0x00000000UL)     /*!< Reset value of CNTCVU register.                                      */

/* CNTCVU_U_32 @Bits 0..31 : Current value of Counter, upper 32 bits */
  #define TSGEN_CNTCVU_CNTCVU_U_32_Pos (0UL)         /*!< Position of CNTCVU_U_32 field.                                       */
  #define TSGEN_CNTCVU_CNTCVU_U_32_Msk (0xFFFFFFFFUL << TSGEN_CNTCVU_CNTCVU_U_32_Pos) /*!< Bit mask of CNTCVU_U_32 field.      */


/* TSGEN_CNTFID0: Base Frequency ID */
  #define TSGEN_CNTFID0_ResetValue (0x00000000UL)    /*!< Reset value of CNTFID0 register.                                     */

/* FREQ @Bits 0..31 : Frequency in number of ticks per second (up to 4 GHz) */
  #define TSGEN_CNTFID0_FREQ_Pos (0UL)               /*!< Position of FREQ field.                                              */
  #define TSGEN_CNTFID0_FREQ_Msk (0xFFFFFFFFUL << TSGEN_CNTFID0_FREQ_Pos) /*!< Bit mask of FREQ field.                         */


/* TSGEN_PIDR4: Peripheral ID4 Register */
  #define TSGEN_PIDR4_ResetValue (0x00000004UL)      /*!< Reset value of PIDR4 register.                                       */

/* DES_2 @Bits 0..3 : JEDEC continuation code indicating the designer of the component, together with the identity code. */
  #define TSGEN_PIDR4_DES_2_Pos (0UL)                /*!< Position of DES_2 field.                                             */
  #define TSGEN_PIDR4_DES_2_Msk (0xFUL << TSGEN_PIDR4_DES_2_Pos) /*!< Bit mask of DES_2 field.                                 */

/* SIZE @Bits 4..7 : This is a 4-bit value that indicates the total contiguous size of the memory window used by this component
                     in powers of 2 from the standard 4KB. If a component only requires the standard 4KB, this must read as 0x0,
                     4KB only. For 8KB set to 0x1, for 16KB set to 0x2, for 32KB set to 0x3, and so on. */

  #define TSGEN_PIDR4_SIZE_Pos (4UL)                 /*!< Position of SIZE field.                                              */
  #define TSGEN_PIDR4_SIZE_Msk (0xFUL << TSGEN_PIDR4_SIZE_Pos) /*!< Bit mask of SIZE field.                                    */


/* TSGEN_PIDR0: Peripheral ID0 Register */
  #define TSGEN_PIDR0_ResetValue (0x00000001UL)      /*!< Reset value of PIDR0 register.                                       */

/* PART_0 @Bits 0..7 : Bits [7:0] of the component part number. This is selected by the designer of the component. */
  #define TSGEN_PIDR0_PART_0_Pos (0UL)               /*!< Position of PART_0 field.                                            */
  #define TSGEN_PIDR0_PART_0_Msk (0xFFUL << TSGEN_PIDR0_PART_0_Pos) /*!< Bit mask of PART_0 field.                             */


/* TSGEN_PIDR1: Peripheral ID1 Register */
  #define TSGEN_PIDR1_ResetValue (0x000000B1UL)      /*!< Reset value of PIDR1 register.                                       */

/* PART_1 @Bits 0..3 : Bits [11:8] of the component part number. This is selected by the designer of the component. */
  #define TSGEN_PIDR1_PART_1_Pos (0UL)               /*!< Position of PART_1 field.                                            */
  #define TSGEN_PIDR1_PART_1_Msk (0xFUL << TSGEN_PIDR1_PART_1_Pos) /*!< Bit mask of PART_1 field.                              */

/* DES_0 @Bits 4..7 : Bits [3:0] of the JEDEC identity code indicating the designer of the component, together with the
                      continuation code. */

  #define TSGEN_PIDR1_DES_0_Pos (4UL)                /*!< Position of DES_0 field.                                             */
  #define TSGEN_PIDR1_DES_0_Msk (0xFUL << TSGEN_PIDR1_DES_0_Pos) /*!< Bit mask of DES_0 field.                                 */


/* TSGEN_PIDR2: Peripheral ID2 Register */
  #define TSGEN_PIDR2_ResetValue (0x0000001BUL)      /*!< Reset value of PIDR2 register.                                       */

/* DES_1 @Bits 0..2 : Bits [6:4] of the JEDEC identity code indicating the designer of the component, together with the
                      continuation code. */

  #define TSGEN_PIDR2_DES_1_Pos (0UL)                /*!< Position of DES_1 field.                                             */
  #define TSGEN_PIDR2_DES_1_Msk (0x7UL << TSGEN_PIDR2_DES_1_Pos) /*!< Bit mask of DES_1 field.                                 */

/* JEDEC @Bit 3 : Always set. Indicates that a JEDEC assigned value is used. */
  #define TSGEN_PIDR2_JEDEC_Pos (3UL)                /*!< Position of JEDEC field.                                             */
  #define TSGEN_PIDR2_JEDEC_Msk (0x1UL << TSGEN_PIDR2_JEDEC_Pos) /*!< Bit mask of JEDEC field.                                 */

/* REVISION @Bits 4..7 : The Revision field is an incremental value starting at 0x0 for the first design of this component. This
                         only increases by 1 for both major and minor revisions and is used as a look-up to establish the exact
                         major and minor revision. */

  #define TSGEN_PIDR2_REVISION_Pos (4UL)             /*!< Position of REVISION field.                                          */
  #define TSGEN_PIDR2_REVISION_Msk (0xFUL << TSGEN_PIDR2_REVISION_Pos) /*!< Bit mask of REVISION field.                        */


/* TSGEN_PIDR3: Peripheral ID3 Register */
  #define TSGEN_PIDR3_ResetValue (0x00000000UL)      /*!< Reset value of PIDR3 register.                                       */

/* CMOD @Bits 0..3 : Where the component is reusable IP, this value indicates if the customer has modified the behavior of the
                     component. In most cases this field is zero. */

  #define TSGEN_PIDR3_CMOD_Pos (0UL)                 /*!< Position of CMOD field.                                              */
  #define TSGEN_PIDR3_CMOD_Msk (0xFUL << TSGEN_PIDR3_CMOD_Pos) /*!< Bit mask of CMOD field.                                    */

/* REVAND @Bits 4..7 : This field indicates minor errata fixes specific to this design, for example metal fixes after
                       implementation. In most cases this field is zero. It is recommended that component designers ensure this
                       field can be changed by a metal fix if required, for example by driving it from registers that reset to
                       zero. */

  #define TSGEN_PIDR3_REVAND_Pos (4UL)               /*!< Position of REVAND field.                                            */
  #define TSGEN_PIDR3_REVAND_Msk (0xFUL << TSGEN_PIDR3_REVAND_Pos) /*!< Bit mask of REVAND field.                              */


