NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TXDRDY @Bit 3 : Enable or disable interrupt for event TXDRDY */
  #define UARTE_INTEN_TXDRDY_Pos (3UL)               /*!< Position of TXDRDY field.                                            */
  #define UARTE_INTEN_TXDRDY_Msk (0x1UL << UARTE_INTEN_TXDRDY_Pos) /*!< Bit mask of TXDRDY field.                              */
  #define UARTE_INTEN_TXDRDY_Min (0x0UL)             /*!< Min enumerator value of TXDRDY field.                                */
  #define UARTE_INTEN_TXDRDY_Max (0x1UL)             /*!< Max enumerator value of TXDRDY field.                                */
  #define UARTE_INTEN_TXDRDY_Disabled (0x0UL)        /*!< Disable                                                              */
  #define UARTE_INTEN_TXDRDY_Enabled (0x1UL)         /*!< Enable                                                               */

/* RXDRDY @Bit 4 : Enable or disable interrupt for event RXDRDY */
  #define UARTE_INTEN_RXDRDY_Pos (4UL)               /*!< Position of RXDRDY field.                                            */
  #define UARTE_INTEN_RXDRDY_Msk (0x1UL << UARTE_INTEN_RXDRDY_Pos) /*!< Bit mask of RXDRDY field.                              */
  #define UARTE_INTEN_RXDRDY_Min (0x0UL)             /*!< Min enumerator value of RXDRDY field.                                */
  #define UARTE_INTEN_RXDRDY_Max (0x1UL)             /*!< Max enumerator value of RXDRDY field.                                */
  #define UARTE_INTEN_RXDRDY_Disabled (0x0UL)        /*!< Disable                                                              */
  #define UARTE_INTEN_RXDRDY_Enabled (0x1UL)         /*!< Enable                                                               */

/* ERROR @Bit 5 : Enable or disable interrupt for event ERROR */
  #define UARTE_INTEN_ERROR_Pos (5UL)                /*!< Position of ERROR field.                                             */
  #define UARTE_INTEN_ERROR_Msk (0x1UL << UARTE_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                 */
  #define UARTE_INTEN_ERROR_Min (0x0UL)              /*!< Min enumerator value of ERROR field.                                 */
  #define UARTE_INTEN_ERROR_Max (0x1UL)              /*!< Max enumerator value of ERROR field.                                 */
  #define UARTE_INTEN_ERROR_Disabled (0x0UL)         /*!< Disable                                                              */
  #define UARTE_INTEN_ERROR_Enabled (0x1UL)          /*!< Enable                                                               */

/* RXTO @Bit 9 : Enable or disable interrupt for event RXTO */
  #define UARTE_INTEN_RXTO_Pos (9UL)                 /*!< Position of RXTO field.                                              */
  #define UARTE_INTEN_RXTO_Msk (0x1UL << UARTE_INTEN_RXTO_Pos) /*!< Bit mask of RXTO field.                                    */
  #define UARTE_INTEN_RXTO_Min (0x0UL)               /*!< Min enumerator value of RXTO field.                                  */
  #define UARTE_INTEN_RXTO_Max (0x1UL)               /*!< Max enumerator value of RXTO field.                                  */
  #define UARTE_INTEN_RXTO_Disabled (0x0UL)          /*!< Disable                                                              */
  #define UARTE_INTEN_RXTO_Enabled (0x1UL)           /*!< Enable                                                               */

/* TXSTOPPED @Bit 12 : Enable or disable interrupt for event TXSTOPPED */
  #define UARTE_INTEN_TXSTOPPED_Pos (12UL)           /*!< Position of TXSTOPPED field.                                         */
  #define UARTE_INTEN_TXSTOPPED_Msk (0x1UL << UARTE_INTEN_TXSTOPPED_Pos) /*!< Bit mask of TXSTOPPED field.                     */
  #define UARTE_INTEN_TXSTOPPED_Min (0x0UL)          /*!< Min enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTEN_TXSTOPPED_Max (0x1UL)          /*!< Max enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTEN_TXSTOPPED_Disabled (0x0UL)     /*!< Disable                                                              */
  #define UARTE_INTEN_TXSTOPPED_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMARXEND @Bit 19 : Enable or disable interrupt for event DMARXEND */
  #define UARTE_INTEN_DMARXEND_Pos (19UL)            /*!< Position of DMARXEND field.                                          */
  #define UARTE_INTEN_DMARXEND_Msk (0x1UL << UARTE_INTEN_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                        */
  #define UARTE_INTEN_DMARXEND_Min (0x0UL)           /*!< Min enumerator value of DMARXEND field.                              */
  #define UARTE_INTEN_DMARXEND_Max (0x1UL)           /*!< Max enumerator value of DMARXEND field.                              */
  #define UARTE_INTEN_DMARXEND_Disabled (0x0UL)      /*!< Disable                                                              */
  #define UARTE_INTEN_DMARXEND_Enabled (0x1UL)       /*!< Enable                                                               */

/* DMARXREADY @Bit 20 : Enable or disable interrupt for event DMARXREADY */
  #define UARTE_INTEN_DMARXREADY_Pos (20UL)          /*!< Position of DMARXREADY field.                                        */
  #define UARTE_INTEN_DMARXREADY_Msk (0x1UL << UARTE_INTEN_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.                  */
  #define UARTE_INTEN_DMARXREADY_Min (0x0UL)         /*!< Min enumerator value of DMARXREADY field.                            */
  #define UARTE_INTEN_DMARXREADY_Max (0x1UL)         /*!< Max enumerator value of DMARXREADY field.                            */
  #define UARTE_INTEN_DMARXREADY_Disabled (0x0UL)    /*!< Disable                                                              */
  #define UARTE_INTEN_DMARXREADY_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMARXBUSERROR @Bit 21 : Enable or disable interrupt for event DMARXBUSERROR */
  #define UARTE_INTEN_DMARXBUSERROR_Pos (21UL)       /*!< Position of DMARXBUSERROR field.                                     */
  #define UARTE_INTEN_DMARXBUSERROR_Msk (0x1UL << UARTE_INTEN_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.         */
  #define UARTE_INTEN_DMARXBUSERROR_Min (0x0UL)      /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define UARTE_INTEN_DMARXBUSERROR_Max (0x1UL)      /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define UARTE_INTEN_DMARXBUSERROR_Disabled (0x0UL) /*!< Disable                                                              */
  #define UARTE_INTEN_DMARXBUSERROR_Enabled (0x1UL)  /*!< Enable                                                               */

/* DMARXMATCH0 @Bit 22 : Enable or disable interrupt for event DMARXMATCH[0] */
  #define UARTE_INTEN_DMARXMATCH0_Pos (22UL)         /*!< Position of DMARXMATCH0 field.                                       */
  #define UARTE_INTEN_DMARXMATCH0_Msk (0x1UL << UARTE_INTEN_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.               */
  #define UARTE_INTEN_DMARXMATCH0_Min (0x0UL)        /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define UARTE_INTEN_DMARXMATCH0_Max (0x1UL)        /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define UARTE_INTEN_DMARXMATCH0_Disabled (0x0UL)   /*!< Disable                                                              */
  #define UARTE_INTEN_DMARXMATCH0_Enabled (0x1UL)    /*!< Enable                                                               */

/* DMARXMATCH1 @Bit 23 : Enable or disable interrupt for event DMARXMATCH[1] */
  #define UARTE_INTEN_DMARXMATCH1_Pos (23UL)         /*!< Position of DMARXMATCH1 field.                                       */
  #define UARTE_INTEN_DMARXMATCH1_Msk (0x1UL << UARTE_INTEN_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.               */
  #define UARTE_INTEN_DMARXMATCH1_Min (0x0UL)        /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define UARTE_INTEN_DMARXMATCH1_Max (0x1UL)        /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define UARTE_INTEN_DMARXMATCH1_Disabled (0x0UL)   /*!< Disable                                                              */
  #define UARTE_INTEN_DMARXMATCH1_Enabled (0x1UL)    /*!< Enable                                                               */

