NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ERROR @Bit 5 : Write '1' to enable interrupt for event ERROR */
  #define UARTE_INTENSET_ERROR_Pos (5UL)             /*!< Position of ERROR field.                                             */
  #define UARTE_INTENSET_ERROR_Msk (0x1UL << UARTE_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                           */
  #define UARTE_INTENSET_ERROR_Min (0x0UL)           /*!< Min enumerator value of ERROR field.                                 */
  #define UARTE_INTENSET_ERROR_Max (0x1UL)           /*!< Max enumerator value of ERROR field.                                 */
  #define UARTE_INTENSET_ERROR_Set (0x1UL)           /*!< Enable                                                               */
  #define UARTE_INTENSET_ERROR_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_ERROR_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* RXTO @Bit 9 : Write '1' to enable interrupt for event RXTO */
  #define UARTE_INTENSET_RXTO_Pos (9UL)              /*!< Position of RXTO field.                                              */
  #define UARTE_INTENSET_RXTO_Msk (0x1UL << UARTE_INTENSET_RXTO_Pos) /*!< Bit mask of RXTO field.                              */
  #define UARTE_INTENSET_RXTO_Min (0x0UL)            /*!< Min enumerator value of RXTO field.                                  */
  #define UARTE_INTENSET_RXTO_Max (0x1UL)            /*!< Max enumerator value of RXTO field.                                  */
  #define UARTE_INTENSET_RXTO_Set (0x1UL)            /*!< Enable                                                               */
  #define UARTE_INTENSET_RXTO_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_RXTO_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* TXSTOPPED @Bit 12 : Write '1' to enable interrupt for event TXSTOPPED */
  #define UARTE_INTENSET_TXSTOPPED_Pos (12UL)        /*!< Position of TXSTOPPED field.                                         */
  #define UARTE_INTENSET_TXSTOPPED_Msk (0x1UL << UARTE_INTENSET_TXSTOPPED_Pos) /*!< Bit mask of TXSTOPPED field.               */
  #define UARTE_INTENSET_TXSTOPPED_Min (0x0UL)       /*!< Min enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTENSET_TXSTOPPED_Max (0x1UL)       /*!< Max enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTENSET_TXSTOPPED_Set (0x1UL)       /*!< Enable                                                               */
  #define UARTE_INTENSET_TXSTOPPED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_TXSTOPPED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMARXEND @Bit 19 : Write '1' to enable interrupt for event DMARXEND */
  #define UARTE_INTENSET_DMARXEND_Pos (19UL)         /*!< Position of DMARXEND field.                                          */
  #define UARTE_INTENSET_DMARXEND_Msk (0x1UL << UARTE_INTENSET_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                  */
  #define UARTE_INTENSET_DMARXEND_Min (0x0UL)        /*!< Min enumerator value of DMARXEND field.                              */
  #define UARTE_INTENSET_DMARXEND_Max (0x1UL)        /*!< Max enumerator value of DMARXEND field.                              */
  #define UARTE_INTENSET_DMARXEND_Set (0x1UL)        /*!< Enable                                                               */
  #define UARTE_INTENSET_DMARXEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_DMARXEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMARXREADY @Bit 20 : Write '1' to enable interrupt for event DMARXREADY */
  #define UARTE_INTENSET_DMARXREADY_Pos (20UL)       /*!< Position of DMARXREADY field.                                        */
  #define UARTE_INTENSET_DMARXREADY_Msk (0x1UL << UARTE_INTENSET_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.            */
  #define UARTE_INTENSET_DMARXREADY_Min (0x0UL)      /*!< Min enumerator value of DMARXREADY field.                            */
  #define UARTE_INTENSET_DMARXREADY_Max (0x1UL)      /*!< Max enumerator value of DMARXREADY field.                            */
  #define UARTE_INTENSET_DMARXREADY_Set (0x1UL)      /*!< Enable                                                               */
  #define UARTE_INTENSET_DMARXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_DMARXREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMARXBUSERROR @Bit 21 : Write '1' to enable interrupt for event DMARXBUSERROR */
  #define UARTE_INTENSET_DMARXBUSERROR_Pos (21UL)    /*!< Position of DMARXBUSERROR field.                                     */
  #define UARTE_INTENSET_DMARXBUSERROR_Msk (0x1UL << UARTE_INTENSET_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.   */
  #define UARTE_INTENSET_DMARXBUSERROR_Min (0x0UL)   /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define UARTE_INTENSET_DMARXBUSERROR_Max (0x1UL)   /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define UARTE_INTENSET_DMARXBUSERROR_Set (0x1UL)   /*!< Enable                                                               */
  #define UARTE_INTENSET_DMARXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define UARTE_INTENSET_DMARXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* DMARXMATCH0 @Bit 22 : Write '1' to enable interrupt for event DMARXMATCH[0] */
  #define UARTE_INTENSET_DMARXMATCH0_Pos (22UL)      /*!< Position of DMARXMATCH0 field.                                       */
  #define UARTE_INTENSET_DMARXMATCH0_Msk (0x1UL << UARTE_INTENSET_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.         */
  #define UARTE_INTENSET_DMARXMATCH0_Min (0x0UL)     /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define UARTE_INTENSET_DMARXMATCH0_Max (0x1UL)     /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define UARTE_INTENSET_DMARXMATCH0_Set (0x1UL)     /*!< Enable                                                               */
  #define UARTE_INTENSET_DMARXMATCH0_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define UARTE_INTENSET_DMARXMATCH0_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMARXMATCH1 @Bit 23 : Write '1' to enable interrupt for event DMARXMATCH[1] */
  #define UARTE_INTENSET_DMARXMATCH1_Pos (23UL)      /*!< Position of DMARXMATCH1 field.                                       */
  #define UARTE_INTENSET_DMARXMATCH1_Msk (0x1UL << UARTE_INTENSET_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.         */
  #define UARTE_INTENSET_DMARXMATCH1_Min (0x0UL)     /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define UARTE_INTENSET_DMARXMATCH1_Max (0x1UL)     /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define UARTE_INTENSET_DMARXMATCH1_Set (0x1UL)     /*!< Enable                                                               */
  #define UARTE_INTENSET_DMARXMATCH1_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define UARTE_INTENSET_DMARXMATCH1_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMARXMATCH2 @Bit 24 : Write '1' to enable interrupt for event DMARXMATCH[2] */
  #define UARTE_INTENSET_DMARXMATCH2_Pos (24UL)      /*!< Position of DMARXMATCH2 field.                                       */
  #define UARTE_INTENSET_DMARXMATCH2_Msk (0x1UL << UARTE_INTENSET_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.         */
  #define UARTE_INTENSET_DMARXMATCH2_Min (0x0UL)     /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define UARTE_INTENSET_DMARXMATCH2_Max (0x1UL)     /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define UARTE_INTENSET_DMARXMATCH2_Set (0x1UL)     /*!< Enable                                                               */
  #define UARTE_INTENSET_DMARXMATCH2_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define UARTE_INTENSET_DMARXMATCH2_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMARXMATCH3 @Bit 25 : Write '1' to enable interrupt for event DMARXMATCH[3] */
  #define UARTE_INTENSET_DMARXMATCH3_Pos (25UL)      /*!< Position of DMARXMATCH3 field.                                       */
  #define UARTE_INTENSET_DMARXMATCH3_Msk (0x1UL << UARTE_INTENSET_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.         */
  #define UARTE_INTENSET_DMARXMATCH3_Min (0x0UL)     /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define UARTE_INTENSET_DMARXMATCH3_Max (0x1UL)     /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define UARTE_INTENSET_DMARXMATCH3_Set (0x1UL)     /*!< Enable                                                               */
  #define UARTE_INTENSET_DMARXMATCH3_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define UARTE_INTENSET_DMARXMATCH3_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* DMATXEND @Bit 26 : Write '1' to enable interrupt for event DMATXEND */
  #define UARTE_INTENSET_DMATXEND_Pos (26UL)         /*!< Position of DMATXEND field.                                          */
  #define UARTE_INTENSET_DMATXEND_Msk (0x1UL << UARTE_INTENSET_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                  */
  #define UARTE_INTENSET_DMATXEND_Min (0x0UL)        /*!< Min enumerator value of DMATXEND field.                              */
  #define UARTE_INTENSET_DMATXEND_Max (0x1UL)        /*!< Max enumerator value of DMATXEND field.                              */
  #define UARTE_INTENSET_DMATXEND_Set (0x1UL)        /*!< Enable                                                               */
  #define UARTE_INTENSET_DMATXEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_DMATXEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* DMATXREADY @Bit 27 : Write '1' to enable interrupt for event DMATXREADY */
  #define UARTE_INTENSET_DMATXREADY_Pos (27UL)       /*!< Position of DMATXREADY field.                                        */
  #define UARTE_INTENSET_DMATXREADY_Msk (0x1UL << UARTE_INTENSET_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.            */
  #define UARTE_INTENSET_DMATXREADY_Min (0x0UL)      /*!< Min enumerator value of DMATXREADY field.                            */
  #define UARTE_INTENSET_DMATXREADY_Max (0x1UL)      /*!< Max enumerator value of DMATXREADY field.                            */
  #define UARTE_INTENSET_DMATXREADY_Set (0x1UL)      /*!< Enable                                                               */
  #define UARTE_INTENSET_DMATXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_DMATXREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* DMATXBUSERROR @Bit 28 : Write '1' to enable interrupt for event DMATXBUSERROR */
  #define UARTE_INTENSET_DMATXBUSERROR_Pos (28UL)    /*!< Position of DMATXBUSERROR field.                                     */
  #define UARTE_INTENSET_DMATXBUSERROR_Msk (0x1UL << UARTE_INTENSET_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.   */
  #define UARTE_INTENSET_DMATXBUSERROR_Min (0x0UL)   /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define UARTE_INTENSET_DMATXBUSERROR_Max (0x1UL)   /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define UARTE_INTENSET_DMATXBUSERROR_Set (0x1UL)   /*!< Enable                                                               */
  #define UARTE_INTENSET_DMATXBUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define UARTE_INTENSET_DMATXBUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* FRAMETIMEOUT @Bit 29 : Write '1' to enable interrupt for event FRAMETIMEOUT */
  #define UARTE_INTENSET_FRAMETIMEOUT_Pos (29UL)     /*!< Position of FRAMETIMEOUT field.                                      */
  #define UARTE_INTENSET_FRAMETIMEOUT_Msk (0x1UL << UARTE_INTENSET_FRAMETIMEOUT_Pos) /*!< Bit mask of FRAMETIMEOUT field.      */
  #define UARTE_INTENSET_FRAMETIMEOUT_Min (0x0UL)    /*!< Min enumerator value of FRAMETIMEOUT field.                          */
  #define UARTE_INTENSET_FRAMETIMEOUT_Max (0x1UL)    /*!< Max enumerator value of FRAMETIMEOUT field.                          */
  #define UARTE_INTENSET_FRAMETIMEOUT_Set (0x1UL)    /*!< Enable                                                               */
  #define UARTE_INTENSET_FRAMETIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define UARTE_INTENSET_FRAMETIMEOUT_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* UARTE_INTENCLR: Disable interrupt */
  #define UARTE_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* CTS @Bit 0 : Write '1' to disable interrupt for event CTS */
  #define UARTE_INTENCLR_CTS_Pos (0UL)               /*!< Position of CTS field.                                               */
  #define UARTE_INTENCLR_CTS_Msk (0x1UL << UARTE_INTENCLR_CTS_Pos) /*!< Bit mask of CTS field.                                 */
  #define UARTE_INTENCLR_CTS_Min (0x0UL)             /*!< Min enumerator value of CTS field.                                   */
  #define UARTE_INTENCLR_CTS_Max (0x1UL)             /*!< Max enumerator value of CTS field.                                   */
  #define UARTE_INTENCLR_CTS_Clear (0x1UL)           /*!< Disable                                                              */
  #define UARTE_INTENCLR_CTS_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_CTS_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

