NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* VALUE @Bits 0..31 : (unspecified) */
  #define UICR_DATA_VALUE_Pos (0UL)                  /*!< Position of VALUE field.                                             */
  #define UICR_DATA_VALUE_Msk (0xFFFFFFFFUL << UICR_DATA_VALUE_Pos) /*!< Bit mask of VALUE field.                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           USBHS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct USBHS_PHY ===================================================== */
/**
  * @brief PHY [USBHS_PHY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) USB PHY parameter overrides                           */
  __IOM uint32_t  CLOCK;                             /*!< (@ 0x00000004) USB PHY clock configurations                          */
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  OVERRIDEVALUES;                    /*!< (@ 0x00000018) Values that are used to override the input signals to
                                                                         the PHY.*/
} NRF_USBHS_PHY_Type;                                /*!< Size = 28 (0x01C)                                                    */

/* USBHS_PHY_CONFIG: USB PHY parameter overrides */
  #define USBHS_PHY_CONFIG_ResetValue (0x5533D6F0UL) /*!< Reset value of CONFIG register.                                      */

/* PLLITUNE @Bits 0..1 : PLL Integral Path Tune */
  #define USBHS_PHY_CONFIG_PLLITUNE_Pos (0UL)        /*!< Position of PLLITUNE field.                                          */
  #define USBHS_PHY_CONFIG_PLLITUNE_Msk (0x3UL << USBHS_PHY_CONFIG_PLLITUNE_Pos) /*!< Bit mask of PLLITUNE field.              */
  #define USBHS_PHY_CONFIG_PLLITUNE_Min (0x0UL)      /*!< Min value of PLLITUNE field.                                         */
  #define USBHS_PHY_CONFIG_PLLITUNE_Max (0x3UL)      /*!< Max size of PLLITUNE field.                                          */

/* PLLPTUNE @Bits 2..5 : PLL Proportional Path Tune */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Pos (2UL)        /*!< Position of PLLPTUNE field.                                          */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Msk (0xFUL << USBHS_PHY_CONFIG_PLLPTUNE_Pos) /*!< Bit mask of PLLPTUNE field.              */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Min (0x0UL)      /*!< Min value of PLLPTUNE field.                                         */
  #define USBHS_PHY_CONFIG_PLLPTUNE_Max (0xFUL)      /*!< Max size of PLLPTUNE field.                                          */

/* COMPDISTUNE0 @Bits 6..8 : Disconnect Threshold Adjustment */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Pos (6UL)    /*!< Position of COMPDISTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Msk (0x7UL << USBHS_PHY_CONFIG_COMPDISTUNE0_Pos) /*!< Bit mask of COMPDISTUNE0 field.  */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Min (0x0UL)  /*!< Min value of COMPDISTUNE0 field.                                     */
  #define USBHS_PHY_CONFIG_COMPDISTUNE0_Max (0x7UL)  /*!< Max size of COMPDISTUNE0 field.                                      */

/* SQRXTUNE0 @Bits 9..11 : Squelch Threshold Adjustment */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Pos (9UL)       /*!< Position of SQRXTUNE0 field.                                         */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Msk (0x7UL << USBHS_PHY_CONFIG_SQRXTUNE0_Pos) /*!< Bit mask of SQRXTUNE0 field.           */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Min (0x0UL)     /*!< Min value of SQRXTUNE0 field.                                        */
  #define USBHS_PHY_CONFIG_SQRXTUNE0_Max (0x3UL)     /*!< Max size of SQRXTUNE0 field.                                         */

/* VDATREFTUNE0 @Bits 12..13 : Data Detect Voltage Adjustment */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Pos (12UL)   /*!< Position of VDATREFTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_VDATREFTUNE0_Pos) /*!< Bit mask of VDATREFTUNE0 field.  */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Min (0x0UL)  /*!< Min value of VDATREFTUNE0 field.                                     */
  #define USBHS_PHY_CONFIG_VDATREFTUNE0_Max (0x3UL)  /*!< Max size of VDATREFTUNE0 field.                                      */

/* TXHSXVTUNE0 @Bits 14..15 : Transmitter High-Speed Crossover Adjustment */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Pos (14UL)    /*!< Position of TXHSXVTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXHSXVTUNE0_Pos) /*!< Bit mask of TXHSXVTUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Min (0x0UL)   /*!< Min value of TXHSXVTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXHSXVTUNE0_Max (0x2UL)   /*!< Max size of TXHSXVTUNE0 field.                                       */

/* TXFSLSTUNE0 @Bits 16..19 : FS/LS Source Impedance Adjustment */
  #define USBHS_PHY_CONFIG_TXFSLSTUNE0_Pos (16UL)    /*!< Position of TXFSLSTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXFSLSTUNE0_Msk (0xFUL << USBHS_PHY_CONFIG_TXFSLSTUNE0_Pos) /*!< Bit mask of TXFSLSTUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXFSLSTUNE0_Min (0x0UL)   /*!< Min value of TXFSLSTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXFSLSTUNE0_Max (0x7UL)   /*!< Max size of TXFSLSTUNE0 field.                                       */

/* TXVREFTUNE0 @Bits 20..23 : HS DC Voltage Level Adjustment */
  #define USBHS_PHY_CONFIG_TXVREFTUNE0_Pos (20UL)    /*!< Position of TXVREFTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXVREFTUNE0_Msk (0xFUL << USBHS_PHY_CONFIG_TXVREFTUNE0_Pos) /*!< Bit mask of TXVREFTUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXVREFTUNE0_Min (0x0UL)   /*!< Min value of TXVREFTUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXVREFTUNE0_Max (0x7UL)   /*!< Max size of TXVREFTUNE0 field.                                       */

/* TXRISETUNE0 @Bits 24..25 : HS Transmitter Rise/Fall Time Adjustment */
  #define USBHS_PHY_CONFIG_TXRISETUNE0_Pos (24UL)    /*!< Position of TXRISETUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXRISETUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXRISETUNE0_Pos) /*!< Bit mask of TXRISETUNE0 field.     */
  #define USBHS_PHY_CONFIG_TXRISETUNE0_Min (0x0UL)   /*!< Min value of TXRISETUNE0 field.                                      */
  #define USBHS_PHY_CONFIG_TXRISETUNE0_Max (0x2UL)   /*!< Max size of TXRISETUNE0 field.                                       */

