NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* TXRESTUNE0 @Bits 26..27 : USB Source Impedance Adjustment */
  #define USBHS_PHY_CONFIG_TXRESTUNE0_Pos (26UL)     /*!< Position of TXRESTUNE0 field.                                        */
  #define USBHS_PHY_CONFIG_TXRESTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXRESTUNE0_Pos) /*!< Bit mask of TXRESTUNE0 field.        */
  #define USBHS_PHY_CONFIG_TXRESTUNE0_Min (0x0UL)    /*!< Min value of TXRESTUNE0 field.                                       */
  #define USBHS_PHY_CONFIG_TXRESTUNE0_Max (0x2UL)    /*!< Max size of TXRESTUNE0 field.                                        */

/* TXPREEMPAMPTUNE0 @Bits 28..29 : HS Transmitter Pre-Emphasis Current Control */
  #define USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Pos (28UL) /*!< Position of TXPREEMPAMPTUNE0 field.                                */
  #define USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Msk (0x3UL << USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Pos) /*!< Bit mask of
                                                                            TXPREEMPAMPTUNE0 field.*/
  #define USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Min (0x0UL) /*!< Min value of TXPREEMPAMPTUNE0 field.                              */
  #define USBHS_PHY_CONFIG_TXPREEMPAMPTUNE0_Max (0x2UL) /*!< Max size of TXPREEMPAMPTUNE0 field.                               */

/* TXPREEMPPULSETUNE0 @Bit 30 : HS Transmitter Pre-Emphasis Duration Control */
  #define USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Pos (30UL) /*!< Position of TXPREEMPPULSETUNE0 field.                            */
  #define USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Msk (0x1UL << USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Pos) /*!< Bit mask of
                                                                            TXPREEMPPULSETUNE0 field.*/
  #define USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Min (0x0UL) /*!< Min value of TXPREEMPPULSETUNE0 field.                          */
  #define USBHS_PHY_CONFIG_TXPREEMPPULSETUNE0_Max (0x1UL) /*!< Max size of TXPREEMPPULSETUNE0 field.                           */


/* USBHS_PHY_CLOCK: USB PHY clock configurations */
  #define USBHS_PHY_CLOCK_ResetValue (0x0000001AUL)  /*!< Reset value of CLOCK register.                                       */

/* FSEL @Bits 0..2 : Select reference clock frequency */
  #define USBHS_PHY_CLOCK_FSEL_Pos (0UL)             /*!< Position of FSEL field.                                              */
  #define USBHS_PHY_CLOCK_FSEL_Msk (0x7UL << USBHS_PHY_CLOCK_FSEL_Pos) /*!< Bit mask of FSEL field.                            */
  #define USBHS_PHY_CLOCK_FSEL_Min (0x0UL)           /*!< Min enumerator value of FSEL field.                                  */
  #define USBHS_PHY_CLOCK_FSEL_Max (0x7UL)           /*!< Max enumerator value of FSEL field.                                  */
  #define USBHS_PHY_CLOCK_FSEL_Clock19200KHz (0x0UL) /*!< Reference clock is 19.2MHz.                                          */
  #define USBHS_PHY_CLOCK_FSEL_Clock20000KHz (0x1UL) /*!< Reference clock is 20MHz.                                            */
  #define USBHS_PHY_CLOCK_FSEL_Clock24000KHz (0x2UL) /*!< Reference clock is 24MHz.                                            */
  #define USBHS_PHY_CLOCK_FSEL_Clock50000KHz (0x7UL) /*!< Reference clock is 50MHz.                                            */

/* PLLBTUNE @Bit 3 : PLL bandwidth adjustment */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Pos (3UL)         /*!< Position of PLLBTUNE field.                                          */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Msk (0x1UL << USBHS_PHY_CLOCK_PLLBTUNE_Pos) /*!< Bit mask of PLLBTUNE field.                */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Min (0x0UL)       /*!< Min enumerator value of PLLBTUNE field.                              */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Max (0x1UL)       /*!< Max enumerator value of PLLBTUNE field.                              */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Disabled (0x0UL)  /*!< PLL bandwidth adjustment disabled.                                   */
  #define USBHS_PHY_CLOCK_PLLBTUNE_Enabled (0x1UL)   /*!< PLL bandwidth adjustment enabled.                                    */

/* COMMONONN @Bit 4 : Common block power down control */
  #define USBHS_PHY_CLOCK_COMMONONN_Pos (4UL)        /*!< Position of COMMONONN field.                                         */
  #define USBHS_PHY_CLOCK_COMMONONN_Msk (0x1UL << USBHS_PHY_CLOCK_COMMONONN_Pos) /*!< Bit mask of COMMONONN field.             */
  #define USBHS_PHY_CLOCK_COMMONONN_Min (0x0UL)      /*!< Min enumerator value of COMMONONN field.                             */
  #define USBHS_PHY_CLOCK_COMMONONN_Max (0x1UL)      /*!< Max enumerator value of COMMONONN field.                             */
  #define USBHS_PHY_CLOCK_COMMONONN_POWERED (0x0UL)  /*!< The REFCLOCK_LOGIC,bias and PLL blocks are powered in sleep or suspend
                                                          mode.*/
  #define USBHS_PHY_CLOCK_COMMONONN_SUSPEND (0x1UL)  /*!< The REFCLOCK_LOGIC, bias and PLL blocks are powered down in suspend
                                                          mode and bias and PLL blocks are powered down in sleep mode.*/


/* USBHS_PHY_OVERRIDEVALUES: Values that are used to override the input signals to the PHY. */
  #define USBHS_PHY_OVERRIDEVALUES_ResetValue (0x04000000UL) /*!< Reset value of OVERRIDEVALUES register.                      */

/* DPPULLDOWN @Bit 23 : This field controls the pull-down resistor on D+ */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Pos (23UL) /*!< Position of DPPULLDOWN field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Pos) /*!< Bit mask of DPPULLDOWN
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Min (0x0UL) /*!< Min enumerator value of DPPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Max (0x1UL) /*!< Max enumerator value of DPPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Enable (0x1UL) /*!< The pull-down resistor on D+ is enabled                      */
  #define USBHS_PHY_OVERRIDEVALUES_DPPULLDOWN_Disable (0x0UL) /*!< The pull-down resistor on D+ is disabled                    */

/* DMPULLDOWN @Bit 24 : This field controls the pull-down resistor on D- */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Pos (24UL) /*!< Position of DMPULLDOWN field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Pos) /*!< Bit mask of DMPULLDOWN
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Min (0x0UL) /*!< Min enumerator value of DMPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Max (0x1UL) /*!< Max enumerator value of DMPULLDOWN field.                       */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Enable (0x1UL) /*!< The pull-down resistor on D+ is enabled                      */
  #define USBHS_PHY_OVERRIDEVALUES_DMPULLDOWN_Disable (0x0UL) /*!< The pull-down resistor on D+ is disabled                    */

