NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* NAK @Bit 4 : NAK Response Received Interrupt (NAK) */
  #define USBHSCORE_HC_INT_NAK_Pos (4UL)             /*!< Position of NAK field.                                               */
  #define USBHSCORE_HC_INT_NAK_Msk (0x1UL << USBHSCORE_HC_INT_NAK_Pos) /*!< Bit mask of NAK field.                             */
  #define USBHSCORE_HC_INT_NAK_Min (0x0UL)           /*!< Min enumerator value of NAK field.                                   */
  #define USBHSCORE_HC_INT_NAK_Max (0x1UL)           /*!< Max enumerator value of NAK field.                                   */
  #define USBHSCORE_HC_INT_NAK_INACTIVE (0x0UL)      /*!< No NAK Response Received Interrupt                                   */
  #define USBHSCORE_HC_INT_NAK_ACTIVE (0x1UL)        /*!< NAK Response Received Interrupt                                      */

/* ACK @Bit 5 : ACK Response Received/Transmitted Interrupt (ACK) */
  #define USBHSCORE_HC_INT_ACK_Pos (5UL)             /*!< Position of ACK field.                                               */
  #define USBHSCORE_HC_INT_ACK_Msk (0x1UL << USBHSCORE_HC_INT_ACK_Pos) /*!< Bit mask of ACK field.                             */
  #define USBHSCORE_HC_INT_ACK_Min (0x0UL)           /*!< Min enumerator value of ACK field.                                   */
  #define USBHSCORE_HC_INT_ACK_Max (0x1UL)           /*!< Max enumerator value of ACK field.                                   */
  #define USBHSCORE_HC_INT_ACK_INACTIVE (0x0UL)      /*!< No ACK Response Received or Transmitted Interrupt                    */
  #define USBHSCORE_HC_INT_ACK_ACTIVE (0x1UL)        /*!< ACK Response Received or Transmitted Interrup                        */

/* NYET @Bit 6 : NYET Response Received Interrupt (NYET) */
  #define USBHSCORE_HC_INT_NYET_Pos (6UL)            /*!< Position of NYET field.                                              */
  #define USBHSCORE_HC_INT_NYET_Msk (0x1UL << USBHSCORE_HC_INT_NYET_Pos) /*!< Bit mask of NYET field.                          */
  #define USBHSCORE_HC_INT_NYET_Min (0x0UL)          /*!< Min enumerator value of NYET field.                                  */
  #define USBHSCORE_HC_INT_NYET_Max (0x1UL)          /*!< Max enumerator value of NYET field.                                  */
  #define USBHSCORE_HC_INT_NYET_INACTIVE (0x0UL)     /*!< No NYET Response Received Interrupt                                  */
  #define USBHSCORE_HC_INT_NYET_ACTIVE (0x1UL)       /*!< NYET Response Received Interrupt                                     */

/* XACTERR @Bit 7 : Transaction Error (XactErr) */
  #define USBHSCORE_HC_INT_XACTERR_Pos (7UL)         /*!< Position of XACTERR field.                                           */
  #define USBHSCORE_HC_INT_XACTERR_Msk (0x1UL << USBHSCORE_HC_INT_XACTERR_Pos) /*!< Bit mask of XACTERR field.                 */
  #define USBHSCORE_HC_INT_XACTERR_Min (0x0UL)       /*!< Min enumerator value of XACTERR field.                               */
  #define USBHSCORE_HC_INT_XACTERR_Max (0x1UL)       /*!< Max enumerator value of XACTERR field.                               */
  #define USBHSCORE_HC_INT_XACTERR_INACTIVE (0x0UL)  /*!< No Transaction Error                                                 */
  #define USBHSCORE_HC_INT_XACTERR_ACTIVE (0x1UL)    /*!< Transaction Error                                                    */

/* BBLERR @Bit 8 : Babble Error (BblErr) */
  #define USBHSCORE_HC_INT_BBLERR_Pos (8UL)          /*!< Position of BBLERR field.                                            */
  #define USBHSCORE_HC_INT_BBLERR_Msk (0x1UL << USBHSCORE_HC_INT_BBLERR_Pos) /*!< Bit mask of BBLERR field.                    */
  #define USBHSCORE_HC_INT_BBLERR_Min (0x0UL)        /*!< Min enumerator value of BBLERR field.                                */
  #define USBHSCORE_HC_INT_BBLERR_Max (0x1UL)        /*!< Max enumerator value of BBLERR field.                                */
  #define USBHSCORE_HC_INT_BBLERR_INACTIVE (0x0UL)   /*!< No Babble Error                                                      */
  #define USBHSCORE_HC_INT_BBLERR_ACTIVE (0x1UL)     /*!< Babble Error                                                         */

/* FRMOVRUN @Bit 9 : Frame Overrun (FrmOvrun). */
  #define USBHSCORE_HC_INT_FRMOVRUN_Pos (9UL)        /*!< Position of FRMOVRUN field.                                          */
  #define USBHSCORE_HC_INT_FRMOVRUN_Msk (0x1UL << USBHSCORE_HC_INT_FRMOVRUN_Pos) /*!< Bit mask of FRMOVRUN field.              */
  #define USBHSCORE_HC_INT_FRMOVRUN_Min (0x0UL)      /*!< Min enumerator value of FRMOVRUN field.                              */
  #define USBHSCORE_HC_INT_FRMOVRUN_Max (0x1UL)      /*!< Max enumerator value of FRMOVRUN field.                              */
  #define USBHSCORE_HC_INT_FRMOVRUN_INACTIVE (0x0UL) /*!< No Frame Overrun                                                     */
  #define USBHSCORE_HC_INT_FRMOVRUN_ACTIVE (0x1UL)   /*!< Frame Overrun                                                        */

/* DATATGLERR @Bit 10 : (unspecified) */
  #define USBHSCORE_HC_INT_DATATGLERR_Pos (10UL)     /*!< Position of DATATGLERR field.                                        */
  #define USBHSCORE_HC_INT_DATATGLERR_Msk (0x1UL << USBHSCORE_HC_INT_DATATGLERR_Pos) /*!< Bit mask of DATATGLERR field.        */
  #define USBHSCORE_HC_INT_DATATGLERR_Min (0x0UL)    /*!< Min enumerator value of DATATGLERR field.                            */
  #define USBHSCORE_HC_INT_DATATGLERR_Max (0x1UL)    /*!< Max enumerator value of DATATGLERR field.                            */
  #define USBHSCORE_HC_INT_DATATGLERR_INACTIVE (0x0UL) /*!< No Data Toggle Error                                               */
  #define USBHSCORE_HC_INT_DATATGLERR_ACTIVE (0x1UL) /*!< Data Toggle Error                                                    */


/* USBHSCORE_HC_INTMSK: Host Channel Interrupt Mask Register */
  #define USBHSCORE_HC_INTMSK_ResetValue (0x00000000UL) /*!< Reset value of INTMSK register.                                   */

/* XFERCOMPLMSK @Bit 0 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Pos (0UL) /*!< Position of XFERCOMPLMSK field.                                      */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Pos) /*!< Bit mask of XFERCOMPLMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Min (0x0UL) /*!< Min enumerator value of XFERCOMPLMSK field.                        */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Max (0x1UL) /*!< Max enumerator value of XFERCOMPLMSK field.                        */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_MASK (0x0UL) /*!< Transfer Completed Mask                                           */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_NOMASK (0x1UL) /*!< No Transfer Completed Mask                                      */

/* CHHLTDMSK @Bit 1 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Pos (1UL)    /*!< Position of CHHLTDMSK field.                                         */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_CHHLTDMSK_Pos) /*!< Bit mask of CHHLTDMSK field.     */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Min (0x0UL)  /*!< Min enumerator value of CHHLTDMSK field.                             */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Max (0x1UL)  /*!< Max enumerator value of CHHLTDMSK field.                             */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_MASK (0x0UL) /*!< Channel Halted Mask                                                  */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_NOMASK (0x1UL) /*!< No Channel Halted Mask                                             */

/* AHBERRMSK @Bit 2 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Pos (2UL)    /*!< Position of AHBERRMSK field.                                         */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_AHBERRMSK_Pos) /*!< Bit mask of AHBERRMSK field.     */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Min (0x0UL)  /*!< Min enumerator value of AHBERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Max (0x1UL)  /*!< Max enumerator value of AHBERRMSK field.                             */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_MASK (0x0UL) /*!< AHB Error Mask                                                       */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_NOMASK (0x1UL) /*!< No AHB Error Mask                                                  */

