NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* SOFMSK @Bit 3 : Mode: Host and Device. Start of (micro)Frame Mask (SofMsk) */
  #define USBHSCORE_GINTMSK_SOFMSK_Pos (3UL)         /*!< Position of SOFMSK field.                                            */
  #define USBHSCORE_GINTMSK_SOFMSK_Msk (0x1UL << USBHSCORE_GINTMSK_SOFMSK_Pos) /*!< Bit mask of SOFMSK field.                  */
  #define USBHSCORE_GINTMSK_SOFMSK_Min (0x0UL)       /*!< Min enumerator value of SOFMSK field.                                */
  #define USBHSCORE_GINTMSK_SOFMSK_Max (0x1UL)       /*!< Max enumerator value of SOFMSK field.                                */
  #define USBHSCORE_GINTMSK_SOFMSK_MASK (0x0UL)      /*!< Start of Frame Mask                                                  */
  #define USBHSCORE_GINTMSK_SOFMSK_NOMASK (0x1UL)    /*!< No Start of Frame Mask                                               */

/* RXFLVLMSK @Bit 4 : Mode: Host and Device. Receive FIFO Non-Empty Mask (RxFLvlMsk) */
  #define USBHSCORE_GINTMSK_RXFLVLMSK_Pos (4UL)      /*!< Position of RXFLVLMSK field.                                         */
  #define USBHSCORE_GINTMSK_RXFLVLMSK_Msk (0x1UL << USBHSCORE_GINTMSK_RXFLVLMSK_Pos) /*!< Bit mask of RXFLVLMSK field.         */
  #define USBHSCORE_GINTMSK_RXFLVLMSK_Min (0x0UL)    /*!< Min enumerator value of RXFLVLMSK field.                             */
  #define USBHSCORE_GINTMSK_RXFLVLMSK_Max (0x1UL)    /*!< Max enumerator value of RXFLVLMSK field.                             */
  #define USBHSCORE_GINTMSK_RXFLVLMSK_MASK (0x0UL)   /*!< Receive FIFO Non-Empty Mask                                          */
  #define USBHSCORE_GINTMSK_RXFLVLMSK_NOMASK (0x1UL) /*!< No Receive FIFO Non-Empty Mask                                       */

/* NPTXFEMPMSK @Bit 5 : Mode: Host and Device. Non-periodic TxFIFO Empty Mask (NPTxFEmpMsk) */
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_Pos (5UL)    /*!< Position of NPTXFEMPMSK field.                                       */
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_NPTXFEMPMSK_Pos) /*!< Bit mask of NPTXFEMPMSK field.   */
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_Min (0x0UL)  /*!< Min enumerator value of NPTXFEMPMSK field.                           */
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_Max (0x1UL)  /*!< Max enumerator value of NPTXFEMPMSK field.                           */
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_MASK (0x0UL) /*!< Non-periodic TxFIFO Empty Mask                                       */
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_NOMASK (0x1UL) /*!< No Non-periodic TxFIFO Empty Mask                                  */

/* GINNAKEFFMSK @Bit 6 : Mode: Device only,. Global Non-periodic IN NAK Effective Mask (GINNakEffMsk) */
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_Pos (6UL)   /*!< Position of GINNAKEFFMSK field.                                      */
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_Msk (0x1UL << USBHSCORE_GINTMSK_GINNAKEFFMSK_Pos) /*!< Bit mask of GINNAKEFFMSK field.*/
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_Min (0x0UL) /*!< Min enumerator value of GINNAKEFFMSK field.                          */
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_Max (0x1UL) /*!< Max enumerator value of GINNAKEFFMSK field.                          */
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_MASK (0x0UL) /*!< Global Non-periodic IN NAK Effective Mask                           */
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_NOMASK (0x1UL) /*!< No Global Non-periodic IN NAK Effective Mask                      */

/* GOUTNAKEFFMSK @Bit 7 : Mode: Device only. Global OUT NAK Effective Mask (GOUTNakEffMsk) */
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Pos (7UL)  /*!< Position of GOUTNAKEFFMSK field.                                     */
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Msk (0x1UL << USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Pos) /*!< Bit mask of GOUTNAKEFFMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Min (0x0UL) /*!< Min enumerator value of GOUTNAKEFFMSK field.                        */
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Max (0x1UL) /*!< Max enumerator value of GOUTNAKEFFMSK field.                        */
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_MASK (0x0UL) /*!< Global OUT NAK Effective Mask                                      */
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_NOMASK (0x1UL) /*!< No Global OUT NAK Effective Mask                                 */

/* ERLYSUSPMSK @Bit 10 : Mode: Device only. Early Suspend Mask (ErlySuspMsk) */
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_Pos (10UL)   /*!< Position of ERLYSUSPMSK field.                                       */
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_ERLYSUSPMSK_Pos) /*!< Bit mask of ERLYSUSPMSK field.   */
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_Min (0x0UL)  /*!< Min enumerator value of ERLYSUSPMSK field.                           */
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_Max (0x1UL)  /*!< Max enumerator value of ERLYSUSPMSK field.                           */
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_MASK (0x0UL) /*!< Early Suspend Mask                                                   */
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_NOMASK (0x1UL) /*!< No Early Suspend Mask                                              */

/* USBSUSPMSK @Bit 11 : Mode: Device only. USB Suspend Mask (USBSuspMsk) */
  #define USBHSCORE_GINTMSK_USBSUSPMSK_Pos (11UL)    /*!< Position of USBSUSPMSK field.                                        */
  #define USBHSCORE_GINTMSK_USBSUSPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_USBSUSPMSK_Pos) /*!< Bit mask of USBSUSPMSK field.      */
  #define USBHSCORE_GINTMSK_USBSUSPMSK_Min (0x0UL)   /*!< Min enumerator value of USBSUSPMSK field.                            */
  #define USBHSCORE_GINTMSK_USBSUSPMSK_Max (0x1UL)   /*!< Max enumerator value of USBSUSPMSK field.                            */
  #define USBHSCORE_GINTMSK_USBSUSPMSK_MASK (0x0UL)  /*!< USB Suspend Mask                                                     */
  #define USBHSCORE_GINTMSK_USBSUSPMSK_NOMASK (0x1UL) /*!< No USB Suspend Mask                                                 */

/* USBRSTMSK @Bit 12 : Mode: Device only. USB Reset Mask (USBRstMsk) */
  #define USBHSCORE_GINTMSK_USBRSTMSK_Pos (12UL)     /*!< Position of USBRSTMSK field.                                         */
  #define USBHSCORE_GINTMSK_USBRSTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_USBRSTMSK_Pos) /*!< Bit mask of USBRSTMSK field.         */
  #define USBHSCORE_GINTMSK_USBRSTMSK_Min (0x0UL)    /*!< Min enumerator value of USBRSTMSK field.                             */
  #define USBHSCORE_GINTMSK_USBRSTMSK_Max (0x1UL)    /*!< Max enumerator value of USBRSTMSK field.                             */
  #define USBHSCORE_GINTMSK_USBRSTMSK_MASK (0x0UL)   /*!< USB Reset Mask                                                       */
  #define USBHSCORE_GINTMSK_USBRSTMSK_NOMASK (0x1UL) /*!< No USB Reset Mask                                                    */

/* ENUMDONEMSK @Bit 13 : Mode: Device only. Enumeration Done Mask (EnumDoneMsk) */
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_Pos (13UL)   /*!< Position of ENUMDONEMSK field.                                       */
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_Msk (0x1UL << USBHSCORE_GINTMSK_ENUMDONEMSK_Pos) /*!< Bit mask of ENUMDONEMSK field.   */
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_Min (0x0UL)  /*!< Min enumerator value of ENUMDONEMSK field.                           */
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_Max (0x1UL)  /*!< Max enumerator value of ENUMDONEMSK field.                           */
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_MASK (0x0UL) /*!< Enumeration Done Mask                                                */
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_NOMASK (0x1UL) /*!< No Enumeration Done Mask                                           */

/* ISOOUTDROPMSK @Bit 14 : Mode: Device only. Isochronous OUT Packet Dropped Interrupt Mask (ISOOutDropMsk) */
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_Pos (14UL) /*!< Position of ISOOUTDROPMSK field.                                     */
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_ISOOUTDROPMSK_Pos) /*!< Bit mask of ISOOUTDROPMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_Min (0x0UL) /*!< Min enumerator value of ISOOUTDROPMSK field.                        */
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_Max (0x1UL) /*!< Max enumerator value of ISOOUTDROPMSK field.                        */
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_MASK (0x0UL) /*!< Isochronous OUT Packet Dropped Interrupt Mask                      */
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_NOMASK (0x1UL) /*!< No Isochronous OUT Packet Dropped Interrupt Mask                 */

/* EOPFMSK @Bit 15 : Mode: Device only. End of Periodic Frame Interrupt Mask (EOPFMsk) */
  #define USBHSCORE_GINTMSK_EOPFMSK_Pos (15UL)       /*!< Position of EOPFMSK field.                                           */
  #define USBHSCORE_GINTMSK_EOPFMSK_Msk (0x1UL << USBHSCORE_GINTMSK_EOPFMSK_Pos) /*!< Bit mask of EOPFMSK field.               */
  #define USBHSCORE_GINTMSK_EOPFMSK_Min (0x0UL)      /*!< Min enumerator value of EOPFMSK field.                               */
  #define USBHSCORE_GINTMSK_EOPFMSK_Max (0x1UL)      /*!< Max enumerator value of EOPFMSK field.                               */
  #define USBHSCORE_GINTMSK_EOPFMSK_MASK (0x0UL)     /*!< End of Periodic Frame Interrupt Mask                                 */
  #define USBHSCORE_GINTMSK_EOPFMSK_NOMASK (0x1UL)   /*!< No End of Periodic Frame Interrupt Mask                              */

/* RSTRDONEINTMSK @Bit 16 : Mode: Host and Device. Restore Done Interrupt Mask (RstrDoneIntMsk) */
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_Pos (16UL) /*!< Position of RSTRDONEINTMSK field.                                   */
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_RSTRDONEINTMSK_Pos) /*!< Bit mask of RSTRDONEINTMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_Min (0x0UL) /*!< Min enumerator value of RSTRDONEINTMSK field.                      */
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_Max (0x1UL) /*!< Max enumerator value of RSTRDONEINTMSK field.                      */
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_MASK (0x0UL) /*!< Restore Done Interrupt Mask                                       */
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_NOMASK (0x1UL) /*!< No Restore Done Interrupt Mask                                  */

/* EPMISMSK @Bit 17 : Mode: Device only. Endpoint Mismatch Interrupt Mask (EPMisMsk) */
  #define USBHSCORE_GINTMSK_EPMISMSK_Pos (17UL)      /*!< Position of EPMISMSK field.                                          */
  #define USBHSCORE_GINTMSK_EPMISMSK_Msk (0x1UL << USBHSCORE_GINTMSK_EPMISMSK_Pos) /*!< Bit mask of EPMISMSK field.            */
  #define USBHSCORE_GINTMSK_EPMISMSK_Min (0x0UL)     /*!< Min enumerator value of EPMISMSK field.                              */
  #define USBHSCORE_GINTMSK_EPMISMSK_Max (0x1UL)     /*!< Max enumerator value of EPMISMSK field.                              */
  #define USBHSCORE_GINTMSK_EPMISMSK_MASK (0x0UL)    /*!< Endpoint Mismatch Interrupt Mask                                     */
  #define USBHSCORE_GINTMSK_EPMISMSK_NOMASK (0x1UL)  /*!< No Endpoint Mismatch Interrupt Mask                                  */

/* IEPINTMSK @Bit 18 : Mode: Device only. IN Endpoints Interrupt Mask (IEPIntMsk) */
  #define USBHSCORE_GINTMSK_IEPINTMSK_Pos (18UL)     /*!< Position of IEPINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_IEPINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_IEPINTMSK_Pos) /*!< Bit mask of IEPINTMSK field.         */
  #define USBHSCORE_GINTMSK_IEPINTMSK_Min (0x0UL)    /*!< Min enumerator value of IEPINTMSK field.                             */
  #define USBHSCORE_GINTMSK_IEPINTMSK_Max (0x1UL)    /*!< Max enumerator value of IEPINTMSK field.                             */
  #define USBHSCORE_GINTMSK_IEPINTMSK_MASK (0x0UL)   /*!< IN Endpoints Interrupt Mask                                          */
  #define USBHSCORE_GINTMSK_IEPINTMSK_NOMASK (0x1UL) /*!< No IN Endpoints Interrupt Mask                                       */

/* OEPINTMSK @Bit 19 : Mode: Device only. OUT Endpoints Interrupt Mask (OEPIntMsk) */
  #define USBHSCORE_GINTMSK_OEPINTMSK_Pos (19UL)     /*!< Position of OEPINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_OEPINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_OEPINTMSK_Pos) /*!< Bit mask of OEPINTMSK field.         */
  #define USBHSCORE_GINTMSK_OEPINTMSK_Min (0x0UL)    /*!< Min enumerator value of OEPINTMSK field.                             */
  #define USBHSCORE_GINTMSK_OEPINTMSK_Max (0x1UL)    /*!< Max enumerator value of OEPINTMSK field.                             */
  #define USBHSCORE_GINTMSK_OEPINTMSK_MASK (0x0UL)   /*!< OUT Endpoints Interrupt Mask                                         */
  #define USBHSCORE_GINTMSK_OEPINTMSK_NOMASK (0x1UL) /*!< No OUT Endpoints Interrupt Mask                                      */

/* INCOMPLPMSK @Bit 21 : Incomplete Periodic Transfer Mask (incomplPMsk) */
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_Pos (21UL)   /*!< Position of INCOMPLPMSK field.                                       */
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_INCOMPLPMSK_Pos) /*!< Bit mask of INCOMPLPMSK field.   */
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_Min (0x0UL)  /*!< Min enumerator value of INCOMPLPMSK field.                           */
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_Max (0x1UL)  /*!< Max enumerator value of INCOMPLPMSK field.                           */
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_MASK (0x0UL) /*!< Host mode: Incomplete Periodic Transfer MaskDevice mode: Incomplete
                                                          Isochronous OUT Transfer Mask*/
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_NOMASK (0x1UL) /*!< Host mode: No Incomplete Periodic Transfer MaskDevice mode: No
                                                            Incomplete Isochronous OUT Transfer Mask*/

/* FETSUSPMSK @Bit 22 : Mode: Device only. Data Fetch Suspended Mask (FetSuspMsk) */
  #define USBHSCORE_GINTMSK_FETSUSPMSK_Pos (22UL)    /*!< Position of FETSUSPMSK field.                                        */
  #define USBHSCORE_GINTMSK_FETSUSPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_FETSUSPMSK_Pos) /*!< Bit mask of FETSUSPMSK field.      */
  #define USBHSCORE_GINTMSK_FETSUSPMSK_Min (0x0UL)   /*!< Min enumerator value of FETSUSPMSK field.                            */
  #define USBHSCORE_GINTMSK_FETSUSPMSK_Max (0x1UL)   /*!< Max enumerator value of FETSUSPMSK field.                            */
  #define USBHSCORE_GINTMSK_FETSUSPMSK_MASK (0x0UL)  /*!< Data Fetch Suspended Mask                                            */
  #define USBHSCORE_GINTMSK_FETSUSPMSK_NOMASK (0x1UL) /*!< No Data Fetch Suspended Mask                                        */

/* RESETDETMSK @Bit 23 : Mode: Device only. Reset detected Interrupt Mask (ResetDetMsk) */
  #define USBHSCORE_GINTMSK_RESETDETMSK_Pos (23UL)   /*!< Position of RESETDETMSK field.                                       */
  #define USBHSCORE_GINTMSK_RESETDETMSK_Msk (0x1UL << USBHSCORE_GINTMSK_RESETDETMSK_Pos) /*!< Bit mask of RESETDETMSK field.   */
  #define USBHSCORE_GINTMSK_RESETDETMSK_Min (0x0UL)  /*!< Min enumerator value of RESETDETMSK field.                           */
  #define USBHSCORE_GINTMSK_RESETDETMSK_Max (0x1UL)  /*!< Max enumerator value of RESETDETMSK field.                           */
  #define USBHSCORE_GINTMSK_RESETDETMSK_MASK (0x0UL) /*!< Reset detected Interrupt Mask                                        */
  #define USBHSCORE_GINTMSK_RESETDETMSK_NOMASK (0x1UL) /*!< No Reset detected Interrupt Mask                                   */

/* PRTINTMSK @Bit 24 : Mode: Host only. Host Port Interrupt Mask (PrtIntMsk) */
  #define USBHSCORE_GINTMSK_PRTINTMSK_Pos (24UL)     /*!< Position of PRTINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_PRTINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_PRTINTMSK_Pos) /*!< Bit mask of PRTINTMSK field.         */
  #define USBHSCORE_GINTMSK_PRTINTMSK_Min (0x0UL)    /*!< Min enumerator value of PRTINTMSK field.                             */
  #define USBHSCORE_GINTMSK_PRTINTMSK_Max (0x1UL)    /*!< Max enumerator value of PRTINTMSK field.                             */
  #define USBHSCORE_GINTMSK_PRTINTMSK_MASK (0x0UL)   /*!< Host Port Interrupt Mask                                             */
  #define USBHSCORE_GINTMSK_PRTINTMSK_NOMASK (0x1UL) /*!< No Host Port Interrupt Mask                                          */

