NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* LPMCHNLINDX @Bits 17..20 : LPM Channel Index */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_Pos (17UL)   /*!< Position of LPMCHNLINDX field.                                       */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_Msk (0xFUL << USBHSCORE_GLPMCFG_LPMCHNLINDX_Pos) /*!< Bit mask of LPMCHNLINDX field.   */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_Min (0x0UL)  /*!< Min enumerator value of LPMCHNLINDX field.                           */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_Max (0xFUL)  /*!< Max enumerator value of LPMCHNLINDX field.                           */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH0 (0x0UL)  /*!< Channel 0                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH1 (0x1UL)  /*!< Channel 1                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH2 (0x2UL)  /*!< Channel 2                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH3 (0x3UL)  /*!< Channel 3                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH4 (0x4UL)  /*!< Channel 4                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH5 (0x5UL)  /*!< Channel 5                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH6 (0x6UL)  /*!< Channel 6                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH7 (0x7UL)  /*!< Channel 7                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH8 (0x8UL)  /*!< Channel 8                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH9 (0x9UL)  /*!< Channel 9                                                            */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH10 (0xAUL) /*!< Channel 10                                                           */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH11 (0xBUL) /*!< Channel 11                                                           */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH12 (0xCUL) /*!< Channel 12                                                           */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH13 (0xDUL) /*!< Channel 13                                                           */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH14 (0xEUL) /*!< Channel 14                                                           */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH15 (0xFUL) /*!< Channel15                                                            */

/* LPMRETRYCNT @Bits 21..23 : LPM Retry Count (LPM_Retry_Cnt) */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_Pos (21UL)   /*!< Position of LPMRETRYCNT field.                                       */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_Msk (0x7UL << USBHSCORE_GLPMCFG_LPMRETRYCNT_Pos) /*!< Bit mask of LPMRETRYCNT field.   */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_Min (0x0UL)  /*!< Min enumerator value of LPMRETRYCNT field.                           */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_Max (0x7UL)  /*!< Max enumerator value of LPMRETRYCNT field.                           */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY0 (0x0UL) /*!< Zero LPM retries                                                   */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY1 (0x1UL) /*!< One LPM retry                                                      */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY2 (0x2UL) /*!< Two LPM retries                                                    */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY3 (0x3UL) /*!< Three LPM retries                                                  */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY4 (0x4UL) /*!< Four LPM retries                                                   */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY5 (0x5UL) /*!< Five LPM retries                                                   */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY6 (0x6UL) /*!< Six LPM retries                                                    */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY7 (0x7UL) /*!< Seven LPM retries                                                  */

/* SNDLPM @Bit 24 : Send LPM Transaction (SndLPM) */
  #define USBHSCORE_GLPMCFG_SNDLPM_Pos (24UL)        /*!< Position of SNDLPM field.                                            */
  #define USBHSCORE_GLPMCFG_SNDLPM_Msk (0x1UL << USBHSCORE_GLPMCFG_SNDLPM_Pos) /*!< Bit mask of SNDLPM field.                  */
  #define USBHSCORE_GLPMCFG_SNDLPM_Min (0x0UL)       /*!< Min enumerator value of SNDLPM field.                                */
  #define USBHSCORE_GLPMCFG_SNDLPM_Max (0x1UL)       /*!< Max enumerator value of SNDLPM field.                                */
  #define USBHSCORE_GLPMCFG_SNDLPM_DISABLED (0x0UL)  /*!< In host-only mode: Received the response from the device for the LPM
                                                          transaction*/
  #define USBHSCORE_GLPMCFG_SNDLPM_ENABLED (0x1UL)   /*!< In host-only mode: Sending LPM transaction containing EXT and LPM
                                                          tokens*/

/* LPMRETRYCNTSTS @Bits 25..27 : LPM Retry Count Status (LPM_RetryCnt_Sts) */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Pos (25UL) /*!< Position of LPMRETRYCNTSTS field.                                   */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Msk (0x7UL << USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Pos) /*!< Bit mask of LPMRETRYCNTSTS
                                                                            field.*/
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Min (0x0UL) /*!< Min enumerator value of LPMRETRYCNTSTS field.                      */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Max (0x7UL) /*!< Max enumerator value of LPMRETRYCNTSTS field.                      */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM0 (0x0UL) /*!< Zero LPM retries remaining                                  */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM1 (0x1UL) /*!< One LPM retry remaining                                     */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM2 (0x2UL) /*!< Two LPM retries remaining                                   */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM3 (0x3UL) /*!< Three LPM retries remaining                                 */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM4 (0x4UL) /*!< Four LPM retries remaining                                  */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM5 (0x5UL) /*!< Five LPM retries remaining                                  */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM6 (0x6UL) /*!< Six LPM retries remaining                                   */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM7 (0x7UL) /*!< Seven LPM retries remaining                                 */

