NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF_INEPNTXFDEP_Pos (16UL)   /*!< Position of INEPNTXFDEP field.                                       */
  #define USBHSCORE_DIEPTXF_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF_INEPNTXFDEP_Pos) /*!< Bit mask of INEPNTXFDEP field. */


/* USBHSCORE_HCFG: Host Configuration Register */
  #define USBHSCORE_HCFG_ResetValue (0x00000200UL)   /*!< Reset value of HCFG register.                                        */

/* FSLSPCLKSEL @Bits 0..1 : FS/LS PHY Clock Select (FSLSPclkSel) */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Pos (0UL)       /*!< Position of FSLSPCLKSEL field.                                       */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Msk (0x3UL << USBHSCORE_HCFG_FSLSPCLKSEL_Pos) /*!< Bit mask of FSLSPCLKSEL field.         */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Min (0x0UL)     /*!< Min enumerator value of FSLSPCLKSEL field.                           */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Max (0x2UL)     /*!< Max enumerator value of FSLSPCLKSEL field.                           */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK3060 (0x0UL) /*!< PHY clock is running at 30/60 MHz                                    */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK48 (0x1UL)   /*!< PHY clock is running at 48 MHz                                       */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK6 (0x2UL)    /*!< PHY clock is running at 6 MHz                                        */

/* FSLSSUPP @Bit 2 : FS- and LS-Only Support (FSLSSupp) */
  #define USBHSCORE_HCFG_FSLSSUPP_Pos (2UL)          /*!< Position of FSLSSUPP field.                                          */
  #define USBHSCORE_HCFG_FSLSSUPP_Msk (0x1UL << USBHSCORE_HCFG_FSLSSUPP_Pos) /*!< Bit mask of FSLSSUPP field.                  */
  #define USBHSCORE_HCFG_FSLSSUPP_Min (0x0UL)        /*!< Min enumerator value of FSLSSUPP field.                              */
  #define USBHSCORE_HCFG_FSLSSUPP_Max (0x1UL)        /*!< Max enumerator value of FSLSSUPP field.                              */
  #define USBHSCORE_HCFG_FSLSSUPP_HSFSLS (0x0UL)     /*!< HS/FS/LS, based on the maximum speed supported by the connected
                                                          device*/
  #define USBHSCORE_HCFG_FSLSSUPP_FSLS (0x1UL)       /*!< FS/LS-only, even if the connected device can support HS              */

/* ENA32KHZS @Bit 7 : Enable 32 KHz Suspend mode (Ena32KHzS) */
  #define USBHSCORE_HCFG_ENA32KHZS_Pos (7UL)         /*!< Position of ENA32KHZS field.                                         */
  #define USBHSCORE_HCFG_ENA32KHZS_Msk (0x1UL << USBHSCORE_HCFG_ENA32KHZS_Pos) /*!< Bit mask of ENA32KHZS field.               */
  #define USBHSCORE_HCFG_ENA32KHZS_Min (0x0UL)       /*!< Min enumerator value of ENA32KHZS field.                             */
  #define USBHSCORE_HCFG_ENA32KHZS_Max (0x1UL)       /*!< Max enumerator value of ENA32KHZS field.                             */
  #define USBHSCORE_HCFG_ENA32KHZS_DISABLED (0x0UL)  /*!< 32 KHz Suspend mode disabled                                         */
  #define USBHSCORE_HCFG_ENA32KHZS_ENABLED (0x1UL)   /*!< 32 KHz Suspend mode enabled                                          */

/* RESVALID @Bits 8..15 : Resume Validation Period (ResValid) */
  #define USBHSCORE_HCFG_RESVALID_Pos (8UL)          /*!< Position of RESVALID field.                                          */
  #define USBHSCORE_HCFG_RESVALID_Msk (0xFFUL << USBHSCORE_HCFG_RESVALID_Pos) /*!< Bit mask of RESVALID field.                 */

/* MODECHTIMEN @Bit 31 : Mode Change Ready Timer Enable (ModeChTimEn) */
  #define USBHSCORE_HCFG_MODECHTIMEN_Pos (31UL)      /*!< Position of MODECHTIMEN field.                                       */
  #define USBHSCORE_HCFG_MODECHTIMEN_Msk (0x1UL << USBHSCORE_HCFG_MODECHTIMEN_Pos) /*!< Bit mask of MODECHTIMEN field.         */
  #define USBHSCORE_HCFG_MODECHTIMEN_Min (0x0UL)     /*!< Min enumerator value of MODECHTIMEN field.                           */
  #define USBHSCORE_HCFG_MODECHTIMEN_Max (0x1UL)     /*!< Max enumerator value of MODECHTIMEN field.                           */
  #define USBHSCORE_HCFG_MODECHTIMEN_ENABLED (0x0UL) /*!< The Host core waits for either 200 PHY clock cycles or a linestate of
                                                          SE0 at the end of resume to change the opmode from 0x2 to 0x0*/
  #define USBHSCORE_HCFG_MODECHTIMEN_DISABLED (0x1UL) /*!< The Host core waits only for a linestate of SE0 at the end of resume
                                                           to change the opmode from 0x2 to 0x0*/


/* USBHSCORE_HFIR: Host Frame Interval Register */
  #define USBHSCORE_HFIR_ResetValue (0x0000EA60UL)   /*!< Reset value of HFIR register.                                        */

/* FRINT @Bits 0..15 : Frame Interval (FrInt) */
  #define USBHSCORE_HFIR_FRINT_Pos (0UL)             /*!< Position of FRINT field.                                             */
  #define USBHSCORE_HFIR_FRINT_Msk (0xFFFFUL << USBHSCORE_HFIR_FRINT_Pos) /*!< Bit mask of FRINT field.                        */

/* HFIRRLDCTRL @Bit 16 : Reload Control (HFIRRldCtrl) */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Pos (16UL)      /*!< Position of HFIRRLDCTRL field.                                       */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Msk (0x1UL << USBHSCORE_HFIR_HFIRRLDCTRL_Pos) /*!< Bit mask of HFIRRLDCTRL field.         */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Min (0x0UL)     /*!< Min enumerator value of HFIRRLDCTRL field.                           */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Max (0x1UL)     /*!< Max enumerator value of HFIRRLDCTRL field.                           */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_DISABLED (0x0UL) /*!< The HFIR cannot be reloaded dynamically                             */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_ENABLED (0x1UL) /*!< The HFIR can be dynamically reloaded during runtime                  */


/* USBHSCORE_HFNUM: Host Frame Number/Frame Time Remaining Register */
  #define USBHSCORE_HFNUM_ResetValue (0x00003FFFUL)  /*!< Reset value of HFNUM register.                                       */

