NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ESSREGRESTORED @Bit 13 : Essential Register Values Restored (EssRegRestored) */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Pos (13UL) /*!< Position of ESSREGRESTORED field.                                   */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Msk (0x1UL << USBHSCORE_PCGCCTL_ESSREGRESTORED_Pos) /*!< Bit mask of ESSREGRESTORED
                                                                            field.*/
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Min (0x0UL) /*!< Min enumerator value of ESSREGRESTORED field.                      */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Max (0x1UL) /*!< Max enumerator value of ESSREGRESTORED field.                      */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_NOT_RESTORED (0x0UL) /*!< Register values of essential registers are not restored   */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_RESTORED (0x1UL) /*!< Register values of essential registers have been restored     */

/* RESTOREVALUE @Bits 14..31 : Restore Value (RestoreValue) */
  #define USBHSCORE_PCGCCTL_RESTOREVALUE_Pos (14UL)  /*!< Position of RESTOREVALUE field.                                      */
  #define USBHSCORE_PCGCCTL_RESTOREVALUE_Msk (0x3FFFFUL << USBHSCORE_PCGCCTL_RESTOREVALUE_Pos) /*!< Bit mask of RESTOREVALUE
                                                                            field.*/


/* USBHSCORE_GSTARFXDIS: Global STAR Fix Disable Register */
  #define USBHSCORE_GSTARFXDIS_ResetValue (0x00002200UL) /*!< Reset value of GSTARFXDIS register.                              */

/* HOSTIGNORESRMTWKUPDIS @Bit 0 : Disable the STAR fix added for Device controller to go back to low power mode when Host
                                  ignores Remote wakeup */

  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Pos (0UL) /*!< Position of HOSTIGNORESRMTWKUPDIS field.                   */
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Pos) /*!< Bit mask
                                                                            of HOSTIGNORESRMTWKUPDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Min (0x0UL) /*!< Min enumerator value of HOSTIGNORESRMTWKUPDIS field.     */
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Max (0x1UL) /*!< Max enumerator value of HOSTIGNORESRMTWKUPDIS field.     */
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_ENABLE_FIX (0x0UL) /*!< Device controller goes back into SUSPENDED state
                                                                            when host ignores Remote Wakeup*/
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_DISABLE_FIX (0x1UL) /*!< Device controller waits indefinitely without
                                                                            entering SUSPENDED state when host ignores the
                                                                            Remote Wakeup*/

/* RESUMEFRMCHKBUSDIS @Bit 1 : Disable the STAR fix added for Device controller to detect lineK and move to RESUMING state after
                               the 50us pull-up delay ends */

  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Pos (1UL) /*!< Position of RESUMEFRMCHKBUSDIS field.                         */
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Pos) /*!< Bit mask of
                                                                            RESUMEFRMCHKBUSDIS field.*/
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Min (0x0UL) /*!< Min enumerator value of RESUMEFRMCHKBUSDIS field.           */
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Max (0x1UL) /*!< Max enumerator value of RESUMEFRMCHKBUSDIS field.           */
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_ENABLE_FIX (0x0UL) /*!< Device controller detects line K and resumes         */
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_DISABLE_FIX (0x1UL) /*!< Device controller does not detect line K and resume */

/* IGNORECTLOUTDATA0DIS @Bit 2 : Disable the STAR fix added for Device controller to reject DATA0 for the first Control OUT Data
                                 Phase and Control Status OUT Phase */

  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Pos (2UL) /*!< Position of IGNORECTLOUTDATA0DIS field.                     */
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Pos) /*!< Bit mask
                                                                            of IGNORECTLOUTDATA0DIS field.*/
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Min (0x0UL) /*!< Min enumerator value of IGNORECTLOUTDATA0DIS field.       */
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Max (0x1UL) /*!< Max enumerator value of IGNORECTLOUTDATA0DIS field.       */
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_ENABLE_FIX (0x0UL) /*!< Transaction Error reported when host sends DATA0
                                                                            PID*/
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_DISABLE_FIX (0x1UL) /*!< Transaction Error not reported when host sends
                                                                            DATA0 PID*/

/* SSPLITSTALLNYETERRDIS @Bit 3 : Disable the STAR fix added for Host controller to flag error for SSPLIT STALL/NYET */
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Pos (3UL) /*!< Position of SSPLITSTALLNYETERRDIS field.                   */
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Pos) /*!< Bit mask
                                                                            of SSPLITSTALLNYETERRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Min (0x0UL) /*!< Min enumerator value of SSPLITSTALLNYETERRDIS field.     */
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Max (0x1UL) /*!< Max enumerator value of SSPLITSTALLNYETERRDIS field.     */
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_ENABLE_FIX (0x0UL) /*!< Transaction Error reported when device sends
                                                                            STALL/NYET for SSPLIT*/
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_DISABLE_FIX (0x1UL) /*!< Transaction Error not reported when device sends
                                                                            STALL/NYET for SSPLIT*/

