NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* ACCEPTISOCSPLITDATA1DIS @Bit 4 : Disable the STAR fix added for Host controller to accept DATA1 PID from device for ISOC
                                    Split transfers */

  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Pos (4UL) /*!< Position of ACCEPTISOCSPLITDATA1DIS field.               */
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Pos) /*!< Bit
                                                                            mask of ACCEPTISOCSPLITDATA1DIS field.*/
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Min (0x0UL) /*!< Min enumerator value of ACCEPTISOCSPLITDATA1DIS field. */
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Max (0x1UL) /*!< Max enumerator value of ACCEPTISOCSPLITDATA1DIS field. */
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_ENABLE_FIX (0x0UL) /*!< Transaction Error not reported when device sends
                                                                            DATA1 PID for ISOC Split*/
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_DISABLE_FIX (0x1UL) /*!< Transaction Error reported when device sends
                                                                            DATA1 PID for ISOC Split*/

/* HANDLEFAULTYCABLEDIS @Bit 5 : Disable the STAR fix added for Host controller to handle Faulty cable scenarios */
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Pos (5UL) /*!< Position of HANDLEFAULTYCABLEDIS field.                     */
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Pos) /*!< Bit mask
                                                                            of HANDLEFAULTYCABLEDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Min (0x0UL) /*!< Min enumerator value of HANDLEFAULTYCABLEDIS field.       */
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Max (0x1UL) /*!< Max enumerator value of HANDLEFAULTYCABLEDIS field.       */
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_ENABLE_FIX (0x0UL) /*!< Fix for handling faulty cable enabled              */
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_DISABLE_FIX (0x1UL) /*!< Fix for handling faulty cable disabled            */

/* LSIPGINCRDIS @Bit 6 : Disable the STAR fix added for Host controller LS mode IPG increment from 2 LS bit times to 3 LS bit
                         times */

  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Pos (6UL) /*!< Position of LSIPGINCRDIS field.                                     */
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Pos) /*!< Bit mask of LSIPGINCRDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Min (0x0UL) /*!< Min enumerator value of LSIPGINCRDIS field.                       */
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Max (0x1UL) /*!< Max enumerator value of LSIPGINCRDIS field.                       */
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_ENABLE_FIX (0x0UL) /*!< Host LS mode IPG is 3 LS bit times                         */
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_DISABLE_FIX (0x1UL) /*!< Host LS mode IPG is 2 LS bit times                        */

/* FSDISCIDLEDIS @Bit 7 : Disable the STAR fix added for Device controller to transition to IDLE state during FS device
                          disconnect */

  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Pos (7UL) /*!< Position of FSDISCIDLEDIS field.                                   */
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Pos) /*!< Bit mask of
                                                                            FSDISCIDLEDIS field.*/
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Min (0x0UL) /*!< Min enumerator value of FSDISCIDLEDIS field.                     */
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Max (0x1UL) /*!< Max enumerator value of FSDISCIDLEDIS field.                     */
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_ENABLE_FIX (0x0UL) /*!< Device controller transitions to IDLE state during FS
                                                                     device disconnect*/
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_DISABLE_FIX (0x1UL) /*!< Device controller does not transition to IDLE state during
                                                                      FS device disconnect*/

/* CONCURRENTRMTWKUPUSBRESUMEDIS @Bit 8 : Disable the STAR fix added for Device controller to not start Remote Wakeup signalling
                                          when USB resume has already started */

  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Pos (8UL) /*!< Position of CONCURRENTRMTWKUPUSBRESUMEDIS field.   */
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Pos)
                                                                            /*!< Bit mask of CONCURRENTRMTWKUPUSBRESUMEDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Min (0x0UL) /*!< Min enumerator value of
                                                                            CONCURRENTRMTWKUPUSBRESUMEDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Max (0x1UL) /*!< Max enumerator value of
                                                                            CONCURRENTRMTWKUPUSBRESUMEDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_ENABLE_FIX (0x0UL) /*!< Device controller does not start remote
                                                                            wakeup signalling when host resume has already
                                                                            started*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_DISABLE_FIX (0x1UL) /*!< Device controller is allowed to start
                                                                            remote wakeup signalling when host resume has
                                                                            already started*/

/* CONCURRENTRMTWKUPUSBRESUMEHIBDIS @Bit 9 : Disable the STAR fix added for Device controller to not hang when Remote Wakeup
                                             signalling clashes with Host resume */

  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Pos (9UL) /*!< Position of CONCURRENTRMTWKUPUSBRESUMEHIBDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Pos)
                                                                            /*!< Bit mask of CONCURRENTRMTWKUPUSBRESUMEHIBDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Min (0x0UL) /*!< Min enumerator value of
                                                                            CONCURRENTRMTWKUPUSBRESUMEHIBDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Max (0x1UL) /*!< Max enumerator value of
                                                                            CONCURRENTRMTWKUPUSBRESUMEHIBDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_ENABLE_FIX (0x0UL) /*!< Device controller does not hang when
                                                                            remote wakeup signalling clashes with host resume
                                                                            during Hibernation exit*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_DISABLE_FIX (0x1UL) /*!< Device controller hangs when remote
                                                                            wakeup signalling clashes with host resume during
                                                                            Hibernation exit*/

/* LSIPGCHKAFTERNAKSTALLFORINDIS @Bit 10 : Disable the STAR fix added for Host controller to wait for IPG duration to send next
                                           token after receiving NAK/STALL for previous IN token with FS/LS device */

