NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* OPMODEXCVRSELCHIRPENCORRDIS @Bit 17 : Disable the STAR fix added for correcting Opmode and XcvrSel on UTMI Interface when
                                         reset is detected in suspend state. */

  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Pos (17UL) /*!< Position of OPMODEXCVRSELCHIRPENCORRDIS field.      */
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Pos)
                                                                            /*!< Bit mask of OPMODEXCVRSELCHIRPENCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Min (0x0UL) /*!< Min enumerator value of OPMODEXCVRSELCHIRPENCORRDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_Max (0x1UL) /*!< Max enumerator value of OPMODEXCVRSELCHIRPENCORRDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_ENABLE_FIX (0x0UL) /*!< Valid Combination of Opmode and XcvrSel is
                                                                            driven when reset is detected in suspend state*/
  #define USBHSCORE_GSTARFXDIS_OPMODEXCVRSELCHIRPENCORRDIS_DISABLE_FIX (0x1UL) /*!< Invalid Combination of Opmode and XcvrSel is
                                                                            driven when reset is detected in suspend state*/

/* TXVALIDDEASSERTIONCORRDIS @Bit 18 : Disable the STAR fix added for correcting Txvalid deassertion on UTMI Interface when soft
                                       disconnect is done. */

  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Pos (18UL) /*!< Position of TXVALIDDEASSERTIONCORRDIS field.          */
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Pos) /*!<
                                                                            Bit mask of TXVALIDDEASSERTIONCORRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Min (0x0UL) /*!< Min enumerator value of TXVALIDDEASSERTIONCORRDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_Max (0x1UL) /*!< Max enumerator value of TXVALIDDEASSERTIONCORRDIS
                                                                          field.*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_ENABLE_FIX (0x0UL) /*!< Txvalid is deasserted during soft disconnect
                                                                            after receiving Txready from the PHY*/
  #define USBHSCORE_GSTARFXDIS_TXVALIDDEASSERTIONCORRDIS_DISABLE_FIX (0x1UL) /*!< Txvalid is deasserted during soft disconnect
                                                                            without waiting for Txready from the PHY*/

/* HOSTNOXFERAFTERPRTDISFIXDIS @Bit 19 : Disable the STAR fix added for correcting Host behavior when port is disabled. */
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Pos (19UL) /*!< Position of HOSTNOXFERAFTERPRTDISFIXDIS field.      */
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Pos)
                                                                            /*!< Bit mask of HOSTNOXFERAFTERPRTDISFIXDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Min (0x0UL) /*!< Min enumerator value of HOSTNOXFERAFTERPRTDISFIXDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_Max (0x1UL) /*!< Max enumerator value of HOSTNOXFERAFTERPRTDISFIXDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_ENABLE_FIX (0x0UL) /*!< Txvalid is not asserted when port is
                                                                            disabled*/
  #define USBHSCORE_GSTARFXDIS_HOSTNOXFERAFTERPRTDISFIXDIS_DISABLE_FIX (0x1UL) /*!< Txvalid can be asserted when port is
                                                                            disabled*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        VDETPOF5V0                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct VDETPOF5V0_CONFIG ================================================= */
/**
  * @brief CONFIG [VDETPOF5V0_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFG;                               /*!< (@ 0x00000000) Voltage detector configuration                        */
  __IOM uint32_t  POFWARNLVL;                        /*!< (@ 0x00000004) Power fail comparator threshold voltage level         */
} NRF_VDETPOF5V0_CONFIG_Type;                        /*!< Size = 8 (0x008)                                                     */

/* VDETPOF5V0_CONFIG_CFG: Voltage detector configuration */
  #define VDETPOF5V0_CONFIG_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                    */

/* POFWARNHYST @Bits 0..1 : Power fail comparator hysteresis voltage value */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Pos (0UL) /*!< Position of POFWARNHYST field.                                      */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Msk (0x3UL << VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Pos) /*!< Bit mask of POFWARNHYST
                                                                            field.*/
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Min (0x0UL) /*!< Min enumerator value of POFWARNHYST field.                        */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Max (0x3UL) /*!< Max enumerator value of POFWARNHYST field.                        */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Val0V050 (0x0UL) /*!< Hysteresis voltage is 50mV                                   */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Val0V100 (0x1UL) /*!< Hysteresis voltage is 100mV                                  */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Val0V000 (0x2UL) /*!< Hysteresis voltage is 0mV                                    */
  #define VDETPOF5V0_CONFIG_CFG_POFWARNHYST_Val0V025 (0x3UL) /*!< Hysteresis voltage is 25mV                                   */


/* VDETPOF5V0_CONFIG_POFWARNLVL: Power fail comparator threshold voltage level */
  #define VDETPOF5V0_CONFIG_POFWARNLVL_ResetValue (0x00000000UL) /*!< Reset value of POFWARNLVL register.                      */

/* VAL @Bits 0..4 : Threshold voltage value. */
  #define VDETPOF5V0_CONFIG_POFWARNLVL_VAL_Pos (0UL) /*!< Position of VAL field.                                               */
  #define VDETPOF5V0_CONFIG_POFWARNLVL_VAL_Msk (0x1FUL << VDETPOF5V0_CONFIG_POFWARNLVL_VAL_Pos) /*!< Bit mask of VAL field.    */



/* ================================================= Struct VDETPOF5V0_TRIM ================================================== */
/**
  * @brief TRIM [VDETPOF5V0_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  POFWARN;                           /*!< (@ 0x00000000) Power fail comparator trimming                        */
} NRF_VDETPOF5V0_TRIM_Type;                          /*!< Size = 4 (0x004)                                                     */

/* VDETPOF5V0_TRIM_POFWARN: Power fail comparator trimming */
  #define VDETPOF5V0_TRIM_POFWARN_ResetValue (0x00000000UL) /*!< Reset value of POFWARN register.                              */

/* VAL @Bits 0..2 : Threshold voltage trimming value */
  #define VDETPOF5V0_TRIM_POFWARN_VAL_Pos (0UL)      /*!< Position of VAL field.                                               */
  #define VDETPOF5V0_TRIM_POFWARN_VAL_Msk (0x7UL << VDETPOF5V0_TRIM_POFWARN_VAL_Pos) /*!< Bit mask of VAL field.               */


/* ==================================================== Struct VDETPOF5V0 ==================================================== */
/**
  * @brief VDETPOF5V0 peripheral
  */
  typedef struct {                                   /*!< VDETPOF5V0 Structure                                                 */
    __OM uint32_t TASKS_PWRUP;                       /*!< (@ 0x00000000) Power up voltage detector                             */
    __OM uint32_t TASKS_PWRDOWN;                     /*!< (@ 0x00000004) Power down voltage detector                           */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) Power up done                                         */
    __IM uint32_t RESERVED1;
    __IOM uint32_t EVENTS_POFWARN;                   /*!< (@ 0x00000108) Power failure warning                                 */
    __IM uint32_t RESERVED2[125];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED3[64];
    __IOM NRF_VDETPOF5V0_CONFIG_Type CONFIG;         /*!< (@ 0x00000410) (unspecified)                                         */
    __IM uint32_t RESERVED4[10];
    __IOM NRF_VDETPOF5V0_TRIM_Type TRIM;             /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED5[15];
    __IOM uint32_t MIRROR;                           /*!< (@ 0x00000480) Enable LOCK for mirrored registers                    */
  } NRF_VDETPOF5V0_Type;                             /*!< Size = 1156 (0x484)                                                  */

