NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* VDETPOF5V0_TASKS_PWRUP: Power up voltage detector */
  #define VDETPOF5V0_TASKS_PWRUP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRUP register.                           */

/* TASKS_PWRUP @Bit 0 : Power up voltage detector */
  #define VDETPOF5V0_TASKS_PWRUP_TASKS_PWRUP_Pos (0UL) /*!< Position of TASKS_PWRUP field.                                     */
  #define VDETPOF5V0_TASKS_PWRUP_TASKS_PWRUP_Msk (0x1UL << VDETPOF5V0_TASKS_PWRUP_TASKS_PWRUP_Pos) /*!< Bit mask of TASKS_PWRUP
                                                                            field.*/
  #define VDETPOF5V0_TASKS_PWRUP_TASKS_PWRUP_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRUP field.                       */
  #define VDETPOF5V0_TASKS_PWRUP_TASKS_PWRUP_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRUP field.                       */
  #define VDETPOF5V0_TASKS_PWRUP_TASKS_PWRUP_Trigger (0x1UL) /*!< Trigger task                                                 */


/* VDETPOF5V0_TASKS_PWRDOWN: Power down voltage detector */
  #define VDETPOF5V0_TASKS_PWRDOWN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PWRDOWN register.                       */

/* TASKS_PWRDOWN @Bit 0 : Power down voltage detector */
  #define VDETPOF5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos (0UL) /*!< Position of TASKS_PWRDOWN field.                               */
  #define VDETPOF5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Msk (0x1UL << VDETPOF5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Pos) /*!< Bit mask of
                                                                            TASKS_PWRDOWN field.*/
  #define VDETPOF5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Min (0x1UL) /*!< Min enumerator value of TASKS_PWRDOWN field.                 */
  #define VDETPOF5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Max (0x1UL) /*!< Max enumerator value of TASKS_PWRDOWN field.                 */
  #define VDETPOF5V0_TASKS_PWRDOWN_TASKS_PWRDOWN_Trigger (0x1UL) /*!< Trigger task                                             */


/* VDETPOF5V0_EVENTS_READY: Power up done */
  #define VDETPOF5V0_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                         */

/* EVENTS_READY @Bit 0 : Power up done */
  #define VDETPOF5V0_EVENTS_READY_EVENTS_READY_Pos (0UL) /*!< Position of EVENTS_READY field.                                  */
  #define VDETPOF5V0_EVENTS_READY_EVENTS_READY_Msk (0x1UL << VDETPOF5V0_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of
                                                                            EVENTS_READY field.*/
  #define VDETPOF5V0_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                    */
  #define VDETPOF5V0_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                    */
  #define VDETPOF5V0_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define VDETPOF5V0_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                          */


/* VDETPOF5V0_EVENTS_POFWARN: Power failure warning */
  #define VDETPOF5V0_EVENTS_POFWARN_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_POFWARN register.                     */

/* EVENTS_POFWARN @Bit 0 : Power failure warning */
  #define VDETPOF5V0_EVENTS_POFWARN_EVENTS_POFWARN_Pos (0UL) /*!< Position of EVENTS_POFWARN field.                            */
  #define VDETPOF5V0_EVENTS_POFWARN_EVENTS_POFWARN_Msk (0x1UL << VDETPOF5V0_EVENTS_POFWARN_EVENTS_POFWARN_Pos) /*!< Bit mask of
                                                                            EVENTS_POFWARN field.*/
  #define VDETPOF5V0_EVENTS_POFWARN_EVENTS_POFWARN_Min (0x0UL) /*!< Min enumerator value of EVENTS_POFWARN field.              */
  #define VDETPOF5V0_EVENTS_POFWARN_EVENTS_POFWARN_Max (0x1UL) /*!< Max enumerator value of EVENTS_POFWARN field.              */
  #define VDETPOF5V0_EVENTS_POFWARN_EVENTS_POFWARN_NotGenerated (0x0UL) /*!< Event not generated                               */
  #define VDETPOF5V0_EVENTS_POFWARN_EVENTS_POFWARN_Generated (0x1UL) /*!< Event generated                                      */


/* VDETPOF5V0_INTEN: Enable or disable interrupt */
  #define VDETPOF5V0_INTEN_ResetValue (0x00000000UL) /*!< Reset value of INTEN register.                                       */

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define VDETPOF5V0_INTEN_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define VDETPOF5V0_INTEN_READY_Msk (0x1UL << VDETPOF5V0_INTEN_READY_Pos) /*!< Bit mask of READY field.                       */
  #define VDETPOF5V0_INTEN_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTEN_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTEN_READY_Disabled (0x0UL)    /*!< Disable                                                              */
  #define VDETPOF5V0_INTEN_READY_Enabled (0x1UL)     /*!< Enable                                                               */

/* POFWARN @Bit 2 : Enable or disable interrupt for event POFWARN */
  #define VDETPOF5V0_INTEN_POFWARN_Pos (2UL)         /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_INTEN_POFWARN_Msk (0x1UL << VDETPOF5V0_INTEN_POFWARN_Pos) /*!< Bit mask of POFWARN field.                 */
  #define VDETPOF5V0_INTEN_POFWARN_Min (0x0UL)       /*!< Min enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTEN_POFWARN_Max (0x1UL)       /*!< Max enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTEN_POFWARN_Disabled (0x0UL)  /*!< Disable                                                              */
  #define VDETPOF5V0_INTEN_POFWARN_Enabled (0x1UL)   /*!< Enable                                                               */


/* VDETPOF5V0_INTENSET: Enable interrupt */
  #define VDETPOF5V0_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                 */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define VDETPOF5V0_INTENSET_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VDETPOF5V0_INTENSET_READY_Msk (0x1UL << VDETPOF5V0_INTENSET_READY_Pos) /*!< Bit mask of READY field.                 */
  #define VDETPOF5V0_INTENSET_READY_Min (0x0UL)      /*!< Min enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTENSET_READY_Max (0x1UL)      /*!< Max enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTENSET_READY_Set (0x1UL)      /*!< Enable                                                               */
  #define VDETPOF5V0_INTENSET_READY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define VDETPOF5V0_INTENSET_READY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* POFWARN @Bit 2 : Write '1' to enable interrupt for event POFWARN */
  #define VDETPOF5V0_INTENSET_POFWARN_Pos (2UL)      /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_INTENSET_POFWARN_Msk (0x1UL << VDETPOF5V0_INTENSET_POFWARN_Pos) /*!< Bit mask of POFWARN field.           */
  #define VDETPOF5V0_INTENSET_POFWARN_Min (0x0UL)    /*!< Min enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTENSET_POFWARN_Max (0x1UL)    /*!< Max enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTENSET_POFWARN_Set (0x1UL)    /*!< Enable                                                               */
  #define VDETPOF5V0_INTENSET_POFWARN_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDETPOF5V0_INTENSET_POFWARN_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* VDETPOF5V0_INTENCLR: Disable interrupt */
  #define VDETPOF5V0_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                 */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define VDETPOF5V0_INTENCLR_READY_Pos (0UL)        /*!< Position of READY field.                                             */
  #define VDETPOF5V0_INTENCLR_READY_Msk (0x1UL << VDETPOF5V0_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                 */
  #define VDETPOF5V0_INTENCLR_READY_Min (0x0UL)      /*!< Min enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTENCLR_READY_Max (0x1UL)      /*!< Max enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTENCLR_READY_Clear (0x1UL)    /*!< Disable                                                              */
  #define VDETPOF5V0_INTENCLR_READY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define VDETPOF5V0_INTENCLR_READY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

