NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* POFWARN @Bit 2 : Write '1' to disable interrupt for event POFWARN */
  #define VDETPOF5V0_INTENCLR_POFWARN_Pos (2UL)      /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_INTENCLR_POFWARN_Msk (0x1UL << VDETPOF5V0_INTENCLR_POFWARN_Pos) /*!< Bit mask of POFWARN field.           */
  #define VDETPOF5V0_INTENCLR_POFWARN_Min (0x0UL)    /*!< Min enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTENCLR_POFWARN_Max (0x1UL)    /*!< Max enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTENCLR_POFWARN_Clear (0x1UL)  /*!< Disable                                                              */
  #define VDETPOF5V0_INTENCLR_POFWARN_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VDETPOF5V0_INTENCLR_POFWARN_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* VDETPOF5V0_INTPEND: Pending interrupts */
  #define VDETPOF5V0_INTPEND_ResetValue (0x00000000UL) /*!< Reset value of INTPEND register.                                   */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define VDETPOF5V0_INTPEND_READY_Pos (0UL)         /*!< Position of READY field.                                             */
  #define VDETPOF5V0_INTPEND_READY_Msk (0x1UL << VDETPOF5V0_INTPEND_READY_Pos) /*!< Bit mask of READY field.                   */
  #define VDETPOF5V0_INTPEND_READY_Min (0x0UL)       /*!< Min enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTPEND_READY_Max (0x1UL)       /*!< Max enumerator value of READY field.                                 */
  #define VDETPOF5V0_INTPEND_READY_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define VDETPOF5V0_INTPEND_READY_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* POFWARN @Bit 2 : Read pending status of interrupt for event POFWARN */
  #define VDETPOF5V0_INTPEND_POFWARN_Pos (2UL)       /*!< Position of POFWARN field.                                           */
  #define VDETPOF5V0_INTPEND_POFWARN_Msk (0x1UL << VDETPOF5V0_INTPEND_POFWARN_Pos) /*!< Bit mask of POFWARN field.             */
  #define VDETPOF5V0_INTPEND_POFWARN_Min (0x0UL)     /*!< Min enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTPEND_POFWARN_Max (0x1UL)     /*!< Max enumerator value of POFWARN field.                               */
  #define VDETPOF5V0_INTPEND_POFWARN_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define VDETPOF5V0_INTPEND_POFWARN_Pending (0x1UL) /*!< Read: Pending                                                        */


/* VDETPOF5V0_MIRROR: Enable LOCK for mirrored registers */
  #define VDETPOF5V0_MIRROR_ResetValue (0x00000001UL) /*!< Reset value of MIRROR register.                                     */

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define VDETPOF5V0_MIRROR_LOCK_Pos (0UL)           /*!< Position of LOCK field.                                              */
  #define VDETPOF5V0_MIRROR_LOCK_Msk (0x1UL << VDETPOF5V0_MIRROR_LOCK_Pos) /*!< Bit mask of LOCK field.                        */
  #define VDETPOF5V0_MIRROR_LOCK_Min (0x0UL)         /*!< Min enumerator value of LOCK field.                                  */
  #define VDETPOF5V0_MIRROR_LOCK_Max (0x1UL)         /*!< Max enumerator value of LOCK field.                                  */
  #define VDETPOF5V0_MIRROR_LOCK_Disabled (0x0UL)    /*!< Lock disabled                                                        */
  #define VDETPOF5V0_MIRROR_LOCK_Enabled (0x1UL)     /*!< Lock enabled                                                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                      VDMADESCRIPTOR                                      ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================== Struct VDMADESCRIPTOR ================================================== */
/**
  * @brief Job descriptor for vector-based DMA.
  */
  typedef struct {                                   /*!< VDMADESCRIPTOR Structure                                             */
    __IOM uint32_t PTR;                              /*!< (@ 0x00000000) Pointer to data buffer.                               */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000004) Job configuration. Configuration of attributes and
                                                                         buffer length.*/
  } NRF_VDMADESCRIPTOR_Type;                         /*!< Size = 8 (0x008)                                                     */

/* VDMADESCRIPTOR_PTR: Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                       */

/* PTR @Bits 0..31 : Pointer to data buffer. */
  #define VDMADESCRIPTOR_PTR_PTR_Pos (0UL)           /*!< Position of PTR field.                                               */
  #define VDMADESCRIPTOR_PTR_PTR_Msk (0xFFFFFFFFUL << VDMADESCRIPTOR_PTR_PTR_Pos) /*!< Bit mask of PTR field.                  */


/* VDMADESCRIPTOR_CONFIG: Job configuration. Configuration of attributes and buffer length. */
  #define VDMADESCRIPTOR_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                 */

/* CNT @Bits 0..23 : Maximum number of bytes in data buffer. */
  #define VDMADESCRIPTOR_CONFIG_CNT_Pos (0UL)        /*!< Position of CNT field.                                               */
  #define VDMADESCRIPTOR_CONFIG_CNT_Msk (0xFFFFFFUL << VDMADESCRIPTOR_CONFIG_CNT_Pos) /*!< Bit mask of CNT field.              */

/* ATTRIBUTE @Bits 24..29 : Job attribute. */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos (24UL) /*!< Position of ATTRIBUTE field.                                         */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Msk (0x3FUL << VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Pos) /*!< Bit mask of ATTRIBUTE field.*/
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Min (0x0UL) /*!< Min enumerator value of ATTRIBUTE field.                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Max (0x6UL) /*!< Max enumerator value of ATTRIBUTE field.                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_ByteSwap (0x00UL) /*!< Byte swap attribute.                                          */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_JobList (0x01UL) /*!< Job list attribute.                                            */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_BufferFill (0x02UL) /*!< Buffer fill attribute.                                      */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_FixedSize (0x03UL) /*!< Fixed size attribute.                                        */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_StaticAddress (0x04UL) /*!< Static address attribute.                                */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_PlainDataBufferWrite (0x05UL) /*!< Plain data buffer write attribute.                */
  #define VDMADESCRIPTOR_CONFIG_ATTRIBUTE_Crc (0x06UL) /*!< CRC attribute.                                                     */

