NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* SBVERSION @Bits 29..31 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBVERSION_Pos (29UL)      /*!< Position of SBVERSION field.                                         */
  #define VPR_DEBUGIF_SBCS_SBVERSION_Msk (0x7UL << VPR_DEBUGIF_SBCS_SBVERSION_Pos) /*!< Bit mask of SBVERSION field.           */
  #define VPR_DEBUGIF_SBCS_SBVERSION_Min (0x0UL)     /*!< Min enumerator value of SBVERSION field.                             */
  #define VPR_DEBUGIF_SBCS_SBVERSION_Max (0x1UL)     /*!< Max enumerator value of SBVERSION field.                             */
  #define VPR_DEBUGIF_SBCS_SBVERSION_version0 (0x0UL) /*!< The System Bus interface conforms to mainline drafts of thia RISC-V
                                                           External Debug Support spec older than 1 January, 2018.*/
  #define VPR_DEBUGIF_SBCS_SBVERSION_version1 (0x1UL) /*!< The System Bus interface conforms to RISC-V External Debug Support
                                                           version 0.14.0-DRAFT. Other values are reserved for future versions.*/


/* VPR_DEBUGIF_SBADDRESS0: System Bus Addres 31:0 */
  #define VPR_DEBUGIF_SBADDRESS0_ResetValue (0x00000000UL) /*!< Reset value of SBADDRESS0 register.                            */

/* ADDRESS @Bits 0..31 : Accesses bits 31:0 of the physical address in sbaddress. */
  #define VPR_DEBUGIF_SBADDRESS0_ADDRESS_Pos (0UL)   /*!< Position of ADDRESS field.                                           */
  #define VPR_DEBUGIF_SBADDRESS0_ADDRESS_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBADDRESS0_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* VPR_DEBUGIF_SBADDRESS1: System Bus Addres 63:32 */
  #define VPR_DEBUGIF_SBADDRESS1_ResetValue (0x00000000UL) /*!< Reset value of SBADDRESS1 register.                            */

/* ADDRESS @Bits 0..31 : Accesses bits 63:32 of the physical address in sbaddress (if the system address bus is that wide). */
  #define VPR_DEBUGIF_SBADDRESS1_ADDRESS_Pos (0UL)   /*!< Position of ADDRESS field.                                           */
  #define VPR_DEBUGIF_SBADDRESS1_ADDRESS_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBADDRESS1_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* VPR_DEBUGIF_SBADDRESS2: System Bus Addres 95:64 */
  #define VPR_DEBUGIF_SBADDRESS2_ResetValue (0x00000000UL) /*!< Reset value of SBADDRESS2 register.                            */

/* ADDRESS @Bits 0..31 : Accesses bits 95:64 of the physical address in sbaddress (if the system address bus is that wide). */
  #define VPR_DEBUGIF_SBADDRESS2_ADDRESS_Pos (0UL)   /*!< Position of ADDRESS field.                                           */
  #define VPR_DEBUGIF_SBADDRESS2_ADDRESS_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBADDRESS2_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* VPR_DEBUGIF_SBDATA0: System Bus Data 31:0 */
  #define VPR_DEBUGIF_SBDATA0_ResetValue (0x00000000UL) /*!< Reset value of SBDATA0 register.                                  */

/* DATA @Bits 0..31 : Accesses bits 31:0 of sbdata */
  #define VPR_DEBUGIF_SBDATA0_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define VPR_DEBUGIF_SBDATA0_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBDATA0_DATA_Pos) /*!< Bit mask of DATA field.             */


/* VPR_DEBUGIF_SBDATA1: System Bus Data 63:32 */
  #define VPR_DEBUGIF_SBDATA1_ResetValue (0x00000000UL) /*!< Reset value of SBDATA1 register.                                  */

/* DATA @Bits 0..31 : Accesses bits 63:32 of sbdata (if the system bus is that wide). */
  #define VPR_DEBUGIF_SBDATA1_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define VPR_DEBUGIF_SBDATA1_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBDATA1_DATA_Pos) /*!< Bit mask of DATA field.             */


/* VPR_DEBUGIF_SBDATA2: System Bus Data 95:64 */
  #define VPR_DEBUGIF_SBDATA2_ResetValue (0x00000000UL) /*!< Reset value of SBDATA2 register.                                  */

/* DATA @Bits 0..31 : Accesses bits 95:64 of sbdata (if the system bus is that wide). */
  #define VPR_DEBUGIF_SBDATA2_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define VPR_DEBUGIF_SBDATA2_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBDATA2_DATA_Pos) /*!< Bit mask of DATA field.             */


/* VPR_DEBUGIF_SBDATA3: System Bus Data 127:96 */
  #define VPR_DEBUGIF_SBDATA3_ResetValue (0x00000000UL) /*!< Reset value of SBDATA3 register.                                  */

/* DATA @Bits 0..31 : Accesses bits 127:96 of sbdata (if the system bus is that wide). */
  #define VPR_DEBUGIF_SBDATA3_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define VPR_DEBUGIF_SBDATA3_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBDATA3_DATA_Pos) /*!< Bit mask of DATA field.             */


/* VPR_DEBUGIF_HALTSUM0: Halt summary 0 */
  #define VPR_DEBUGIF_HALTSUM0_ResetValue (0x00000000UL) /*!< Reset value of HALTSUM0 register.                                */

/* HALTSUM0 @Bits 0..31 : Halt summary 0 */
  #define VPR_DEBUGIF_HALTSUM0_HALTSUM0_Pos (0UL)    /*!< Position of HALTSUM0 field.                                          */
  #define VPR_DEBUGIF_HALTSUM0_HALTSUM0_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HALTSUM0_HALTSUM0_Pos) /*!< Bit mask of HALTSUM0
                                                                            field.*/


/* ======================================================= Struct VPR ======================================================== */
/**
  * @brief VPR peripheral registers
  */
  typedef struct {                                   /*!< VPR Structure                                                        */
    __OM uint32_t TASKS_TRIGGER[32];                 /*!< (@ 0x00000000) VPR task [n] register                                 */
    __IOM uint32_t SUBSCRIBE_TRIGGER[32];            /*!< (@ 0x00000080) Subscribe configuration for task TASKS_TRIGGER[n]     */
    __IOM uint32_t EVENTS_TRIGGERED[32];             /*!< (@ 0x00000100) VPR event [n] register                                */
    __IOM uint32_t PUBLISH_TRIGGERED[32];            /*!< (@ 0x00000180) Publish configuration for event EVENTS_TRIGGERED[n]   */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED1[60];
    __IOM NRF_VPR_DEBUGIF_Type DEBUGIF;              /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED2[191];
    __IOM uint32_t CPURUN;                           /*!< (@ 0x00000800) State of the CPU after a core reset                   */
    __IM uint32_t RESERVED3;
    __IOM uint32_t INITPC;                           /*!< (@ 0x00000808) Initial value of the PC at CPU start.                 */
  } NRF_VPR_Type;                                    /*!< Size = 2060 (0x80C)                                                  */

/* VPR_TASKS_TRIGGER: VPR task [n] register */
  #define VPR_TASKS_TRIGGER_MaxCount (32UL)          /*!< Max size of TASKS_TRIGGER[32] array.                                 */
  #define VPR_TASKS_TRIGGER_MaxIndex (31UL)          /*!< Max index of TASKS_TRIGGER[32] array.                                */
  #define VPR_TASKS_TRIGGER_MinIndex (0UL)           /*!< Min index of TASKS_TRIGGER[32] array.                                */
  #define VPR_TASKS_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGGER[32] register.                          */

/* TASKS_TRIGGER @Bit 0 : VPR task [n] register */
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL)  /*!< Position of TASKS_TRIGGER field.                                     */
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << VPR_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of TASKS_TRIGGER
                                                                            field.*/
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGGER field.                        */
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGGER field.                        */
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL) /*!< Trigger task                                                    */


/* VPR_SUBSCRIBE_TRIGGER: Subscribe configuration for task TASKS_TRIGGER[n] */
  #define VPR_SUBSCRIBE_TRIGGER_MaxCount (32UL)      /*!< Max size of SUBSCRIBE_TRIGGER[32] array.                             */
  #define VPR_SUBSCRIBE_TRIGGER_MaxIndex (31UL)      /*!< Max index of SUBSCRIBE_TRIGGER[32] array.                            */
  #define VPR_SUBSCRIBE_TRIGGER_MinIndex (0UL)       /*!< Min index of SUBSCRIBE_TRIGGER[32] array.                            */
  #define VPR_SUBSCRIBE_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_TRIGGER[32] register.                  */

/* EN @Bit 31 : Subscription enable bit */
  #define VPR_SUBSCRIBE_TRIGGER_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define VPR_SUBSCRIBE_TRIGGER_EN_Msk (0x1UL << VPR_SUBSCRIBE_TRIGGER_EN_Pos) /*!< Bit mask of EN field.                      */
  #define VPR_SUBSCRIBE_TRIGGER_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define VPR_SUBSCRIBE_TRIGGER_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define VPR_SUBSCRIBE_TRIGGER_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define VPR_SUBSCRIBE_TRIGGER_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


