NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* PUBLISH2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Pos (2UL)   /*!< Position of PUBLISH2 field.                                          */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH2_Pos) /*!< Bit mask of PUBLISH2 field.    */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Min (0x0UL) /*!< Min enumerator value of PUBLISH2 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Max (0x1UL) /*!< Max enumerator value of PUBLISH2 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Disabled (0x0UL) /*!< Publish disabled for EVENTS[2]                                  */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Enabled (0x1UL) /*!< Publish enabled for EVENTS[2]                                    */

/* PUBLISH3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Pos (3UL)   /*!< Position of PUBLISH3 field.                                          */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH3_Pos) /*!< Bit mask of PUBLISH3 field.    */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Min (0x0UL) /*!< Min enumerator value of PUBLISH3 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Max (0x1UL) /*!< Max enumerator value of PUBLISH3 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Disabled (0x0UL) /*!< Publish disabled for EVENTS[3]                                  */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Enabled (0x1UL) /*!< Publish enabled for EVENTS[3]                                    */

/* PUBLISH4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Pos (4UL)   /*!< Position of PUBLISH4 field.                                          */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH4_Pos) /*!< Bit mask of PUBLISH4 field.    */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Min (0x0UL) /*!< Min enumerator value of PUBLISH4 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Max (0x1UL) /*!< Max enumerator value of PUBLISH4 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Disabled (0x0UL) /*!< Publish disabled for EVENTS[4]                                  */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Enabled (0x1UL) /*!< Publish enabled for EVENTS[4]                                    */

/* PUBLISH5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Pos (5UL)   /*!< Position of PUBLISH5 field.                                          */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH5_Pos) /*!< Bit mask of PUBLISH5 field.    */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Min (0x0UL) /*!< Min enumerator value of PUBLISH5 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Max (0x1UL) /*!< Max enumerator value of PUBLISH5 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Disabled (0x0UL) /*!< Publish disabled for EVENTS[5]                                  */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Enabled (0x1UL) /*!< Publish enabled for EVENTS[5]                                    */

/* PUBLISH6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Pos (6UL)   /*!< Position of PUBLISH6 field.                                          */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH6_Pos) /*!< Bit mask of PUBLISH6 field.    */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Min (0x0UL) /*!< Min enumerator value of PUBLISH6 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Max (0x1UL) /*!< Max enumerator value of PUBLISH6 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Disabled (0x0UL) /*!< Publish disabled for EVENTS[6]                                  */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Enabled (0x1UL) /*!< Publish enabled for EVENTS[6]                                    */

/* PUBLISH7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Pos (7UL)   /*!< Position of PUBLISH7 field.                                          */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH7_Pos) /*!< Bit mask of PUBLISH7 field.    */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Min (0x0UL) /*!< Min enumerator value of PUBLISH7 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Max (0x1UL) /*!< Max enumerator value of PUBLISH7 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Disabled (0x0UL) /*!< Publish disabled for EVENTS[7]                                  */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Enabled (0x1UL) /*!< Publish enabled for EVENTS[7]                                    */

/* PUBLISH8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Pos (8UL)   /*!< Position of PUBLISH8 field.                                          */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH8_Pos) /*!< Bit mask of PUBLISH8 field.    */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Min (0x0UL) /*!< Min enumerator value of PUBLISH8 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Max (0x1UL) /*!< Max enumerator value of PUBLISH8 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Disabled (0x0UL) /*!< Publish disabled for EVENTS[8]                                  */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Enabled (0x1UL) /*!< Publish enabled for EVENTS[8]                                    */

/* PUBLISH9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Pos (9UL)   /*!< Position of PUBLISH9 field.                                          */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH9_Pos) /*!< Bit mask of PUBLISH9 field.    */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Min (0x0UL) /*!< Min enumerator value of PUBLISH9 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Max (0x1UL) /*!< Max enumerator value of PUBLISH9 field.                              */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Disabled (0x0UL) /*!< Publish disabled for EVENTS[9]                                  */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Enabled (0x1UL) /*!< Publish enabled for EVENTS[9]                                    */

/* PUBLISH10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Pos (10UL) /*!< Position of PUBLISH10 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH10_Pos) /*!< Bit mask of PUBLISH10 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Min (0x0UL) /*!< Min enumerator value of PUBLISH10 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Max (0x1UL) /*!< Max enumerator value of PUBLISH10 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Disabled (0x0UL) /*!< Publish disabled for EVENTS[10]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Enabled (0x1UL) /*!< Publish enabled for EVENTS[10]                                  */

/* PUBLISH11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Pos (11UL) /*!< Position of PUBLISH11 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH11_Pos) /*!< Bit mask of PUBLISH11 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Min (0x0UL) /*!< Min enumerator value of PUBLISH11 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Max (0x1UL) /*!< Max enumerator value of PUBLISH11 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Disabled (0x0UL) /*!< Publish disabled for EVENTS[11]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Enabled (0x1UL) /*!< Publish enabled for EVENTS[11]                                  */

