NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_types.h
/* OUT1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_Pos (1UL)     /*!< Position of OUT1 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT1_Pos) /*!< Bit mask of OUT1 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_Min (0x0UL)   /*!< Min enumerator value of OUT1 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_Max (0x1UL)   /*!< Max enumerator value of OUT1 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* OUT2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_Pos (2UL)     /*!< Position of OUT2 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT2_Pos) /*!< Bit mask of OUT2 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_Min (0x0UL)   /*!< Min enumerator value of OUT2 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_Max (0x1UL)   /*!< Max enumerator value of OUT2 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* OUT3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_Pos (3UL)     /*!< Position of OUT3 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT3_Pos) /*!< Bit mask of OUT3 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_Min (0x0UL)   /*!< Min enumerator value of OUT3 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_Max (0x1UL)   /*!< Max enumerator value of OUT3 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* OUT4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_Pos (4UL)     /*!< Position of OUT4 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT4_Pos) /*!< Bit mask of OUT4 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_Min (0x0UL)   /*!< Min enumerator value of OUT4 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_Max (0x1UL)   /*!< Max enumerator value of OUT4 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* OUT5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_Pos (5UL)     /*!< Position of OUT5 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT5_Pos) /*!< Bit mask of OUT5 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_Min (0x0UL)   /*!< Min enumerator value of OUT5 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_Max (0x1UL)   /*!< Max enumerator value of OUT5 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* OUT6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_Pos (6UL)     /*!< Position of OUT6 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT6_Pos) /*!< Bit mask of OUT6 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_Min (0x0UL)   /*!< Min enumerator value of OUT6 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_Max (0x1UL)   /*!< Max enumerator value of OUT6 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* OUT7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_Pos (7UL)     /*!< Position of OUT7 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT7_Pos) /*!< Bit mask of OUT7 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_Min (0x0UL)   /*!< Min enumerator value of OUT7 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_Max (0x1UL)   /*!< Max enumerator value of OUT7 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* OUT8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_Pos (8UL)     /*!< Position of OUT8 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT8_Pos) /*!< Bit mask of OUT8 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_Min (0x0UL)   /*!< Min enumerator value of OUT8 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_Max (0x1UL)   /*!< Max enumerator value of OUT8 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

